{
  "id": "bear-lake-9-key-elelment-plan-2018-2",
  "rawText": "\n\nBear Lake Watershed Plan GY 17 \n1 \n \nBear Lake Watershed Plan \n9 Key Elements/Alternate Plan \nHUC 080302040902 \nMWS 9307 \nGY17 Proposed Project Area \nOctober 5, 2018 \n \nElement a: Identification of Causes and Sources of Impairment \n \nBear Lake Watershed (080302040902) is located predominately in southwestern Tunica County \nand with a small amount in northwestern Coahoma County.  Bear Lake watershed is a 26,494-\nacre watershed where cropland comprises 77% (20,341acres) and wetlands 16% (4,164 acres) of \nthe land use within the watershed according to the 2011 National Land Cover Database (NLCD) \n(Figure 1).   \n \nBeginning in 1998, the Yazoo-Mississippi Delta Water Management District (YMD) began to \norganize watershed level meetings throughout the Coldwater River Watershed, which included \nMoon Lake. In 2003, the U.S. Army Corp of Engineers signed an agreement with YMD and the \nTunica County Soil and Water Conservation District (TCSWCD) to develop a watershed-scale \nplan to further identify watershed problems and solutions. Subsequently, YMD and TCSWCD \nentered into multi-year agreement whereas funds were provided for monitoring and conservation \npractice implementation. According to the 2008 report by YMD, although $1,025,000 had been \nspent on conservation practices in the Coldwater River Watershed (HUC8), very little work had \nbeen completed within the Moon Lake watershed, particularly in the Phillip’s Bayou watershed \n(HUC 10) where only one site had been documented as an installed conservation practice.   \n \nMoon Lake is also included in a Coldwater River Watershed-Based Plan developed by Delta \nF.A.R.M. in 2012. While the plan covered the entire HUC8 watershed, BMP implementation and \nevaluation focused on specific sites where funding from the NRCS Mississippi River Basin \nInitiative was leveraged. No work was completed in watersheds upstream of Moon Lake through \nthis plan or project.  \n \nBear Lake Watershed is a sub-watershed of the Phillips Bayou-Yazoo Pass watershed (HUC10) \nthat drains into Moon Lake.  Moon Lake is a popular destination for recreational users enjoying \nactivities such as boating and fishing. Due to this, the east bank of the lake is highly developed, \nwith houses lining much of the perimeter. A portion of the western bank has also been subject to \ndevelopment. With high public use comes interest and concern for maintaining optimal \nconditions for fishing and boating. Historical declines in lake conditions have prompted several \nstudies and investigations of the lake and surrounding watershed. One of the first was An \nEnvironmental Assessment of Moon Lake, Mississippi and its Watershed in 1989 by the USDA-\nARS National Sedimentation Laboratory. Following this, a Phase I Diagnostic/Feasibility study \nwas conducted by FTN Associates in 1991. These studies were conducted in response to \nconcerns of reduction in depth, water clarity, and the possible presence of pesticides.  Results of \nthe studies indicated that while pesticides weren’t an issue elevated turbidity levels following \nstorms were preventing the lake from achieving its recreational and fishery potential.   \n \n\nBear Lake Watershed Plan GY 17 \n2 \n \n \nFigure 1: Bear Lake Watershed Landuse Map \n\nBear Lake Watershed Plan GY 17 \n3 \n \n \nIn 1996, Moon Lake (MS320MLM) was included on MS’s Section 303(d) List of Impaired \nWater Bodies for siltation, nutrients, and pesticides.  A Total Maximum Daily Load (TMDL) \nwas developed for sediment/siltation for Moon Lake in 2003.  With the advancement of \ntechnology and data since this TMDL was written, the watershed area of Moon Lake has now \nbeen divided into three 12-digit HUCs (Figure 2).  The lake itself lies in the Yazoo Pass sub-\nwatershed (HUC 080302040903).  The sediment loading to the lake has been studied and \ndetermined to primarily be coming from Phillips Bayou on the northern end of the lake, which is \nthe outlet for the Bear Lake sub-watershed (HUC 080302040902), and the primary focus of this \nwatershed based plan.     \n \nThere are no facilities in the Bear Lake Watershed with NPDES permits that include limits for \nTotal Suspended Solids (TSS) which is used as an indicator of sediment contributions from \npermitted activities.  The pollutant of concern for the Moon Lake TMDL is sediment from land-\nuse runoff.  Certain contaminants may be associated with sediment such as pesticides and \nnutrients. These contaminants were not addressed directly within this TMDL. However, these \ncontaminants would also be controlled by the same best management practices (BMPs) that \ncontrol the sediment from nonpoint sources of pollution.  The target for the TMDL was based on \nreference sediment yields developed by the Channel and Watershed Processes Research Unit \n(CWPRU) at the National Sedimentation Laboratory (NSL).  Based on the ranges of stable and \nunstable yield values, a reduction in sediment of 35% to 56% is needed in the Moon Lake \nwatershed. \n \nNonpoint loading of sediment in a water body results from the transport of material into \nreceiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion.  Sources of sediment include: agriculture, silviculture, rangeland, construction sites, \nroads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream sources, \nand historical landuse activities and channel alterations.   \n\nBear Lake Watershed Plan GY 17 \n4 \n \n \n \nFigure 2: HUC 10 changed to HUC12 \n \n\nBear Lake Watershed Plan GY 17 \n5 \n \nElement b: Expected Load Reduction \n \nA TMDL was developed for sediment/siltation on Moon Lake in 2003 which called for a 35% to \n56% reduction in the sediment loading to the waterbodies within the watershed. Nonpoint \nloading of sediment in a water body results from the transport of material into receiving waters \nby the processes of mass wasting, head cutting, gullying, and sheet and rill erosion.  Sources of \nsediment include: ariculture, silviculture, rangeland, construction sites, roads, urban areas, mass \nwasting areas, gullies, surface mining, in-channel and instream sources, and historical landuse \nactivities and channel alterations. The Natural Resources Conservation Service (NRCS) has a list \nof approved BMPs that address sedimentation issues and this list will be used to identify BMPs \nthat are candidates to be used in the Moon Lake Watershed.   \n \nElement c: Proposed Management Measures \n \nIn the Bear Lake – Phillips Bayou Watershed, MDEQ will be working with Delta Farmers \nAdvocating Resource Management (F.A.R.M), a long-time partner in this region of the state.  As \na local resource to farmers, Delta F.A.R.M. staff communicate regularly with the local \nlandowners and operators within the watershed as they work to support sign-ups for Farm Bill \nand other conservation initiatives.     Delta F.A.R.M. staff understand conservation needs at the \nlocal level, and have knowledge of the amount of unfunded applications for federal program \nassistance which meet Section 319 eligibility requirements.  Under this watershed plan, Delta \nF.A.R.M. will implement conservation strategies for the Bear Lake – Phillips Bayou Watershed. \nStakeholder committees representing lake and farm interests have been established and \npreliminary discussions are underway regarding priority areas for conservation practice \nimplementation. Based on input received to date, Phillips Bayou is the primary watershed \ncontributing sediment and nutrient loads to Moon Lake and should be considered a priority focus \narea.  \n \nPreliminary surveys of the Bear Lake watershed have been conducted to estimate the type and \nquantity of conservation practices needed on the landscape. Delta F.A.R.M. used this as a \nstarting point to initiate surveys to prioritize sites for implementation so that the greatest \nenvironmental gain may be achieved with the available resources. Farm stakeholders in the \nwatershed have expressed interest in working cooperatively to implement and maintain \nconservation practices. Being in close proximity to the Mississippi River, the Bear Lake \nwatershed is characterized by ridge and swale topography, which is prone to sedimentation loss \ndue to sheet, rill, and gully erosion. Gully erosion will be addressed with water control \nstructures, both slotted and riser pipes. Sheet and rill erosion will be addressed through structural \nconservation practices as well as non-structural agricultural management practices. Structural \nmeasures include low-grade weirs and two-stage vegetated ditches. Non-structural practices such \nas cover crops and reduced tillage are proven to be the best method of addressing sheet and rill \nerosion. However, this requires farmers to alter their crop production practices, thus introducing \nrisk of financial loss. Overcoming these hurdles to the adoption of cover crops, reduced tillage, \nand other practices that improve soil health while providing environmental benefits has been a \nlarge part of Delta F.A.R.M.’s work over the past several years. This work will be transitioned \ninto the Bear Lake watershed by working with farmers to implement these practices, with \ntechnical and financial assistance, in priority areas prone to high rates of sediment and nutrient \n\nBear Lake Watershed Plan GY 17 \n6 \n \nloss. Delta F.A.R.M. will also identify opportunities for BMP implementation through NRCS \ncovered programs and provide assistance to producers throughout the application and \nimplementation process.  Based on their analysis, installation of the following BMPs would \nmitigate the sediment issues in the Bear Lake – Phillips Bayou Watershed:  \n \n Water Control Structure  \n Vegetated Ditches  \n Grade Stabilization Structures  \n Cover Crops  \n No-Till/Strip-Till  \n Nutrient Management  \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project that may contribute match include Delta F.A.R.M., USGS (monitoring), \nand/or local landowners.  Delta F.A.R.M. provided the following numbers used to estimate costs \nfor BMP installation.  Provided below is summary of estimated project costs for a full-scale \nwatershed restoration: \n \nEstimated Quantity and Cost of Conservation Practices for the Bear Lake Watershed.  \n \nActivity Size/Amount Estimated \nCost \nLandowner \nMatch \nBMPs \n   \n     Grade Stabilization Structure (#) \n32 @ $6,480 $207,360  $82,944  \n     Water Control Structure (#) \n82 @ $2,400 $196,800  $78,720  \n     Vegetated Ditch (in ft) \n20,898 @ $10 $208,980  $83,592  \n     Nutrient Management (ac - 1 yr) \n17,727 @ $2 $35,454  $14,182  \n     Cover Crop (ac - 1 yr) \n17,727 @ $73 $1,294,071  $517,628  \n     No-Till/Strip-Till (ac - 1 yr) \n17,727 @ $15 $265,905  $106,362  \nEducation/Outreach \n \n$24,900  \n \nMonitoring \n \n$90,000  \n \nProject Management, \nImplementation, Coordination, \nPlan Revision \n \n \n \n$54,660  \n \nTotal Estimated Project Cost \n \n$2,378,130  $883,428  \n\nBear Lake Watershed Plan GY 17 \n7 \n \n \nGiven the large financial burden of full watershed-scale conservation practice implementation, \nan incremental approach focusing on building producer partnerships and leveraging other \nfederal, state, and private investment in conservation should be considered. The following table \nsummarizes the quantity and costs of conservation practices that could occur through an initial \nimplementation phase.  \n \nPhase 1: Estimated Quantity and Cost of Conservation Practices for the Bear Lake \nWatershed.  \n \nActivity Size/Amount Estimated Cost Landowner Match \nBMPs       \n     Grade Stabilization Structure (#) 5 @ $6,480 $32,400  $12,960  \n     Water Control Structure (#) 40 @ $2,400 $96,000  $38,400  \n     Cover Crop (3 80 ac sites - 2 yr) \n240 ac/yr @ \n$73 $35,040  $14,016  \nEducation/Outreach N/A $24,900  N/A \nMonitoring N/A $90,000  N/A \nProject Management, Implementation, \nCoordination, Plan Revision \n  $54,660  N/A \nTotal Estimated Project Cost   $333,000  $65,376  \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor land-use categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Bear Lake watershed project by tailoring them to address the \nsedimentation.  A positive approach is used to reach the full diversity of people in the \ncommunity with projects that foster a “sense of place”, a “sense of pride in community”, and a \nsense of the native plants, animals, and general ecology of their region, as well as, the history of \nthe community and a sense of economics.  Stakeholders and coordinators join together to \nparticipate in problem-solving brainstorming, plan development, training workshops, festival \nevent planning, soil and water conservation field days, tree boards, poster, art and writing \nprojects and other activities that promote collaboration and ownership of the watershed, as well \nas, solutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/ post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nMoon Lake watershed are listed below: \n \n\nBear Lake Watershed Plan GY 17 \n8 \n \n Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Moon Lake Watershed. \n Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n  “Train the Trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n \nAs part of the education outreach efforts, the stakeholder group forming the Bear Lake \nWatershed Implementation Team (WIT) will participate in a minimum of five face-to-face \nmeetings.  The purpose of these meetings is to provide updates on implementation activities, \neducation events and review and modify the watershed plan.  In concert with these WIT \nmeetings, and to incentivize stakeholder participation, project funding will be used to purchase \nfood and other refreshments for the WIT along with providing support for renting facilities in \nwhich to host those events.   \n \nElement f: Implementation Schedule \n \nThe following work plan describes the approaches and tasks that the grantee shall collaboratively \nperform with project partners to advance and implement this watershed-based plan. During this \neffort, the grantee will work with the MDEQ Basin Team and will put forth its best effort to \nperform the tasks identified below within the given timetable. \n  \n1. In the event of §319 NPS funding award from MDEQ to support implementation of this \nwatershed-based plan for this HUC 12 sub-watershed, the grantee shall work with MDEQ \nto develop, execute, and implement a Sub-Grant Agreement that roles, tasks, \nrequirements, and milestones of the grantee. (Month 1)  \n \n2. The grantee, with assistance from MDEQ, shall determine priority areas that are \ncontributing significant sediment loading to the watershed.  (Months 1-2) \n \n3. The grantee, with assistance from MDEQ, shall assist in the identification of members \nand development of a Watershed Implementation Team (WIT). (Months 1-2) \n \n4. The grantee, with assistance from the WIT, shall develop a Watershed Based Plan (WBP) \nfor the watershed that includes the tasks for achieving a reduction in sediment loading to \nwaterbodies within the watershed. (Months 1-6) \n \n5. The grantee, in cooperation with the WIT, MDEQ, and others, shall assist in the \ndevelopment and implementation of a watershed monitoring plan for the project (Months 1- \n36). \n \n\nBear Lake Watershed Plan GY 17 \n9 \n \n6. The grantee shall inform landowners and operators within the identified priority areas \nabout the project and secure commitments from these priority-area landowners and \noperators who are willing to participate in the project. (Months 1-12) \n \n7. The grantee, in accordance with the previously submitted and approved WBP, shall \ndevelop plans for the installation of BMPs on priority lands within the watershed. \n(Months 2-36)  \n \n8. The grantee shall assist participants in installing approved BMPs.  All BMPs shall be \ninstalled in accordance with the guidelines developed in the latest edition of the NRCS \nTechnical Field Manual, or other approved guidelines. (Months 2-36) \n \n9. The grantee shall, in a timely manner, notify MDEQ project officer of all project-site \nlocations/inspections/public meetings so that MDEQ project officer may have the \nopportunity to attend.  (Months 2-36) \n \n10. The grantee shall collect relevant GPS coordinates of all implemented practices and \nincorporate into GIS format.  All geospatial data shall be collected in a manner consistent \nwith the Federal Geographic Data Committee endorsed standards.  (Months 1-36) \n \n11. The grantee shall take adequate photo documentation before, during, and after the \ninstallation of the implemented practice. (Months 1-36) \n \n12. The grantee shall submit bi-annual reports not later than September 25\nth\n and March 25\nth\n \nof each year showing the status of tasks and start/completion dates of each task. (Months \n1-36) \n \n13. The grantee shall make project presentations as requested by MDEQ. (Month 1-36) \n \n14. The grantee shall assist the MDEQ project officer in conducting inspections during \nconstruction. (Months 3-36) \n \n15. The grantee shall submit a final report to MDEQ to include measured, or estimated, non-\npoint source pollutant reductions or water quality improvements, acreage affected, pre- \nand post- site conditions, and GIS data.  The grantee shall make revisions, if necessary, \nupon the request of MDEQ. (Month 36) \n \n\nBear Lake Watershed Plan GY 17 \n10 \n \n \nElement g:  Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, and \nUSGS to determine priority areas that \nare contributing significant pollutant \nloads to Moon Lake \nTarget priority areas \nfor BMPs \nMonth 1-6 \nEstablish Watershed Implementation \nTeam to begin refinement of Watershed \nBased Plan for Moon Lake watershed \nEstablish WIT \n \nMonth 1-2 \nInitiate watershed monitoring Baseline condition \nmonitoring \nMonth 3-12 \nMeet with landowners and cooperators \nto secure commitments to install BMPs \nin priority areas \nLandowner \nCommitment \nMonths 1-6 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 12-36 \nCoordinate with Delta F.A.R.M. to \ninspect BMPs that were installed using \nSection 319 funds \nBMP Inspection Months 24-36 \nBegin monitoring to collect data on \npost-BMP water quality \nPost-BMP Monitoring Months 30-42 \nFinalize education and outreach plan Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 28-36 \n \n \nElement h:  Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters do \nnot include a water quality standard applicable to aquatic life protection due to sediment. \nHowever, a narrative standard for the protection of aquatic life was interpreted to determine an \napplicable target for the Moon Lake TMDL. The narrative standard is that waters shall be free \nfrom materials attributable to municipal, industrial, agricultural, or other dischargers producing \ncolor, odor, taste, total suspended solids, or other conditions in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to aquatic life and wildlife, \nor adversely affect the palatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses.  In lieu of numeric criteria for sediment, the monitoring plan will be designed to \ncollect data on parameters that are considered surrogates for sediment concentrations and may \ninclude measurements for total suspended solids, total suspended sediment, and turbidity along \nwith conventional parameters generally measured to determine aquatic health (e.g. dissolved \noxygen, pH, temperature, conductivity).  The following thresholds will be used to measure \ncompliance with water quality criteria: \n\nBear Lake Watershed Plan GY 17 \n11 \n \n \nParameter   Threshold \nDissolved Oxygen  Daily Average of 5.0mg/L; Instantaneous threshold of 4.0 mg/L \npH    6.0-9.0 \nTemperature   Not to exceed 90°F \nSpecific Conductance  Less than 1,000microhos/cm \nDissolved Solids   Monthly average less than 750 mg/L; instantaneous threshold less \nthan 1,500 mg/L \n \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project.  These data are extremely helpful in identifying positive \ntrends in water quality and should provide information to help determine if the implementation \nactivities are resulting in water quality improvements.  As has been done in other watersheds in \nthis region, MDEQ and Delta F.A.R.M. will work with other watershed partners to identify \nopportunities to establish edge of field monitoring as well as cooperative in-stream flow and \nsediment monitoring for baseline and storm events with the USGS.   \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the work plan.  At the end of the project, data will be analyzed to \ndetermine if they indicate improvements to water quality.  In the event data indicate little or no \npositive change, a Stressor Analysis will be conducted to determine if any new or additional \nstressors are preventing improvements to water quality.  If any new stressors are identified, the \nWatershed Implementation Team will identify future actions/activities to address those stressors. \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation chemical and biological monitoring have been \ncompiled to serve as a baseline for the project along with any historical data available in the Bear \nLake – Phillips Bayou Watershed and Moon Lake.  This varied water quality monitoring \nincluded water chemistry data (nutrients, suspended solids, oxygen demand, chlorides, etc.), in-\nsitu field measurements for such parameters as dissolved oxygen, pH, temperature, specific \nconductance, turbidity and secchi depth (lakes), datalogger (sonde) deployment for continuous \nin-situ field measurement data as well as biological community monitoring for benthic \nmacroinvertebrates in streams and algal chlorophyll-a in lakes for trophic index determination. A \nsummary of this historical water quality monitoring in the Bear Lake watershed is provided in \nthe table below and their locations are shown in Figure 3.  \n \nStation \nID \nWater \nBody \nSample \nYear(s) \nCollecting \nAgency \nProject Water \nChem \nIn-\nSitu \nSonde Benthics \n111A12 Phillips \nBayou \n2010 USGS, \nMDEQ \nDelta \nBISQ \n  \nX X \nA0270015 Yazoo \nPass \n2009, \n2013 \nUSGS, \nMDEQ \nDelta \nBISQ \nX \n  \nX \nYZ291 Moon \nLake \n2002-\n2004, \n2009, \nMDEQ Nutrient \nCriteria, \nAmbient \nX X \n  \n\nBear Lake Watershed Plan GY 17 \n12 \n \nStation \nID \nWater \nBody \nSample \nYear(s) \nCollecting \nAgency \nProject Water \nChem \nIn-\nSitu \nSonde Benthics \n2011, \n2015 - \n2018 \nLakes \nStatus & \nTrends \nYZ292 Moon \nLake \n2002-\n2004, \n2009, \n2011, \n2015 - \n2018 \nMDEQ Nutrient \nCriteria, \nAmbient \nLakes \nStatus & \nTrends \nX X \n  \nYZ431 Moon \nLake \n2002-\n2004, \n2009, \n2011, \n2015 - \n2018 \nMDEQ Nutrient \nCriteria, \nAmbient \nLakes \nStatus & \nTrends \nX X \n  \n \n \nPost-implementation monitoring locations will be selected using best professional judgment and \nwill be targeted to reflect water quality downstream of BMP activity.  Once BMP installation is \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring \nwill be initiated.  Post BMP monitoring will be conducted in a way that allows for comparison \nwith the pre-implementation data.  Because recovery periods of streams can be dependent on \ntype and amount of BMPs installed, more than 1 year of post BMP data may be needed to \nobserve a change in water quality.  In some cases, it may take 5 or more years to see full benefits \nof BMPs. All data collection efforts will be conducted using trained personnel following \nestablished Standard Operating Procedures and adhering to agency Quality Assurance protocols.   \n \n\nBear Lake Watershed Plan GY 17 \n13 \n \n \n \nFigure 3: Monitoring Locations: Moon Lake and Bear Lake – Phillips Bayou Watershed ",
  "metadata": {
    "id": "bear-lake-9-key-elelment-plan-2018-2",
    "originalName": "Bear_Lake_9_Key_Elelment_Plan_2018.pdf",
    "size": 1500132,
    "uploadedAt": "2025-10-03T01:17:05.901Z",
    "pageCount": 13,
    "info": {}
  }
}