{
  "id": "bear-creek-watershed-plan-2007",
  "rawText": "\n\n 1 \n \n \nBEAR CREEK WATERSHED \nIMPLEMENTATION PLAN \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFINAL PLAN \nAugust 10, 2007 \n \n \n \n \n\n 2 \nBEAR CREEK WATERSHED \nIMPLEMENTATION PLAN\n \n \n \n \n \n \n \nPrepared for: \n \nYazoo River Basins Team \nMississippi Department of Environmental Quality \n \n \n \nDeveloped by: \n \nBear Creek Watershed Implementation Team \nP.O. Box 276 \nStoneville, MS 38776 \n \n \n \nPrepared by: \n \nDelta F.A.R.M. \nP.O. Box 257 \nStoneville, MS 38776 \n \nDelta Wildlife, Inc. \nP.O. Box 276 \nStoneville, MS 38776 \n \n \n \nWith additional technical assistance from: \n \nFTN Associates, Ltd.  \n3 Innwood Circle, Suite 220 \nLittle Rock, AR 72211 \n \nMississippi Department of Environmental Quality \nOffice of Pollution Control \nP.O. Box 20385 \nJackson, MS 39289 \n\n 3 \nTABLE OF CONTENTS \n \nMission Statement         5 \nBear Creek Watershed Description       5 \nWatershed Implementation Team (WIT)      8 \nInterests and Concerns        9 \nPriority Concerns         10 \nBear Creek Resources         11 \n Water Quality Standards       11 \n  Current Condition       11 \n   Surface Water Quality     11 \n   Ground Water Resources     12 \n   TMDLs       13 \n   Fisheries, Plant, and Wildlife Resources   14 \nWatershed Implementation Plan (WIP)      16 \n Goal          16  \n Sediment/Turbidity        16 \n Low DO/Organic Enrichment       18 \n High Nutrient Levels         20 \n Fish Advisories        21 \n Noxious Aquatic Vegetation       22 \n Fisheries Management       23 \n Access to Public Water       24 \nEducation Strategy         25 \n Goals           25 \n  Delta Wildlife and Delta F.A.R.M.     25 \n  Mississippi Natural Resources Conservation Service  25 \n  Mississippi Soil and Water Conservation Commission  28 \n  Mississippi State University        32 \n  Mississippi Department of Environmental Quality      32 \nEvaluation          35 \n Monitoring         35 \n Assessment of Progress       35 \n Plan Evaluation Procedure       35 \nReferences          37  \nAppendix          39 \n A – Stressors           39 \n B – Checklist of WIP Elements      40 \n \n \n \n \n \n \n\n 4 \nLIST OF TABLES \n \nTable 1.  Priority Concerns in Bear Creek Watershed    10 \nTable 2. Water quality criteria for Bear Creek watershed.    11 \nTable 3. 2002 303(d) Listings for Bear Creek watershed    12 \nTable 4. Species of Special Concern in Bear Creek Watershed   14\n \nTable 5.  Projected Costs for Agricultural Best Management Practices  18 \nTable 6.  Projected Costs for Weirs and Flow Augmentation   19 \nTable 7.  Project Costs for Noxious Aquatic Weed Control     22 \nTable 8.  Projected Costs for Fisheries Management on Mossy Lake  23 \nTable 9.  MDEQ NPS Pollution Educational Activities and Materials.  34 \n \n \nLIST OF FIGURES \n \nFigure 1.  Bear Creek Watershed (Location within the State)   5 \nFigure 2.  Bear Creek Watershed       6 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 5 \nMission Statement \n \nThe mission of the Bear Creek Watershed Implementation Plan (WIP) is to develop a \nmore sustainable future for the resources, residences, and businesses located within the \nwatershed by addressing all identified natural and wildlife resources concerns.  The \nimplementation of this plan also partially fulfills the mission of all members of the Bear \nCreek WIT including: Ducks Unlimited, Delta Wildlife, Delta F.A.R.M., Mississippi \nDepartment of Environmental Quality, U.S. Fish and Wildlife Service, USDA Natural \nResources Conservation Service, Mississippi Soil & Water Conservation Commission, \nMississippi Department of Wildlife, Fisheries, and Parks, Mississippi State Department \nof Health, Mississippi State University, Yazoo-Mississippi Delta Joint Water \nManagement District, and all other partnering agencies, private landowners, farmers, and \nbusiness owners in the watershed. \n   \n \nBear Creek Watershed Description \n \nBear Creek drains approximately 74,001 acres of the Yazoo River basin in portions of \nLeflore, Sunflower, and Humphreys counties in west central Mississippi \n(MDEQ 2003a,b). We estimate that approximately 7,400 people lived in this watershed \nin 2000 (based on Census 2000 data for Leflore County). Portions of the towns of Itta \nBena and Quito are in the Bear Creek watershed. Swiftown is the largest town entirely in \nthe watershed. In 1993 land use in the watershed was primarily agricultural (68%) and \nforestland (16%) (MDEQ 2003a,b). Crops produced in the watershed include catfish, \nrice, soybeans, milo, corn, and cotton. \n \nFigure 1.  Bear Creek Watershed (Location within the State) \n \n \n\n 6 \nFigure 2.  Bear Creek Watershed \n \n \nThe watershed is underlain by Mississippi River alluvium. The topography of the \nwatershed is primarily flat, with the main topographic relief provided by river terraces \n(MDEQ 2000). Forestdale, Dundee, Dubbs, Sharkey, and Alligator soils are prevalent \nthroughout the watershed.  The watershed is located in the Mississippi Alluvial Plain \necoregion. Native vegetation in the watershed is bottomland hardwood forest, which \nincludes oak, tupelo gum, cottonwood, and cypress (MARIS). The Mississippi \nDepartment of Natural Heritage has identified a number of environmentally sensitive \nareas in the Bear Creek watershed (MARIS). \n \nBear Creek is a system of small oxbow lakes connected by stream segments. Blue Lake is \nthe upstream-most lake and is fed by Gayden Brake, a cypress-tupelo swamp that forms \nthe headwaters of the Bear Creek system. As Bear Creek proceeds from Blue Lake it \npasses through One Mile Lake, Three Mile Lake, Six Mile Lake, Four Mile Lake, and \nWasp Lake, which empties into the Yazoo River. A control structure between Wasp Lake \nand the Yazoo River controls backwater flooding of lower Bear Creek by the Yazoo \nRiver. A number of additional oxbow lakes in the watershed are connected to the Bear \nCreek system only during high water conditions; Mossy Lake connects to One Mile Lake, \nMacon Lake connects to Three Mile Lake, and Sky Lake connects to Four Mile Lake \n(MDEQ 2003a, Pennington et al. 1991).   \n \n \n \n \n \n \n\n 7 \nApproximately 7,496 acres of wetlands occur in the watershed. Water levels in the \ncreeks, lakes, and wetlands are maintained by rainwater and the shallow Mississippi \nRiver alluvial aquifer that underlies the watershed. Ground water withdrawals for \nagricultural use, primarily irrigation, are made from the alluvial aquifer and surface \nwater, with a majority coming from the alluvial aquifer. These withdrawals have resulted \nin ground water level declines in this aquifer. Deep, confined aquifers are the primary \ndrinking water source in the watershed and are not affected by the alluvial aquifer. These \nconfined aquifers are generally not susceptible to contamination (MDEQ 2000). \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 8 \nWatershed Implementation Team \n \nFormal members of the Bear Creek Watershed Implementation Team are listed below \nand represent various professional resource agencies interested in the watershed.  A \ngroup of 19 landowners and stakeholders also participated in the WIP development \nprocess by providing input during at the Bear Creek Watershed Stakeholder meeting.  \nDespite their participation and contribution to this document, stakeholders and \nlandowners that attended this meeting chose not to be formally recognized on the WIT, \nand therefore, not listed below.   \n \nDelta F.A.R.M. and Delta Wildlife, Inc. \n Trey Cooke \n Sam Franklin \n Gayden Pollan \nDucks Unlimitied \n Stacey Shankle \nMississippi Department of Environmental Quality \n Steve Goff \n Ronn Killebrew \nMississippi State Department of Health \n Gene Herring \nMississippi Department of Wildlife, Fisheries, and Parks \n Fisheries Division \n  Garry Lucus \n Wildlife Division \n  Lann Wilf \nMississippi State University \n College of Forest Resources \n  Department of Wildlife & Fisheries \n   Todd Teitjen \nMississippi Soil and Water Conservation Commission \n Patrick Vowell \nUSDA Natural Resources Conservation Service \n Bobby McCain, Engineer \n Dale Gardner, Lelfore County District Conservationist \n Chad Feber, Humphreys County District Conservationist \n Sunflower County District Conservationist \nU.S. Fish and Wildlife Service \n Chris Woodson \n Bo Olswanger \nU.S. Geological Survey \n Richard Rebich \nYazoo-Mississippi Delta Joint Water Management District \n Dean Pennington \n \n \n\n 9 \nInterests and Concerns \n \nIt is recognized that production agriculture is the primary source of economic stability in \nthe Bear Creek Watershed.  Therefore, the WIT and stakeholders shall only support \nactivities that improve the overall natural resources of the watershed while promoting a \nmore sustainable future for agriculture. \n \nSedimentation and erosion was a common theme among both the WIT and stakeholders.  \nBoth groups identified multiple resource concerns that could be minimized or resolved by \naddressing sedimentation and erosion in the watershed.  These concerns included \nfisheries, wetland habitat, irrigation water storage capacity, drainage, and aesthetics. \nOther common interests included general wetland and wildlife habitat in the watershed \nand noxious aquatic weeds in watershed lakes and drainage systems. \n \nIn addition to sedimentation and erosion, several other water quality concerns were listed \nby water quality resource agencies on the WIT.  These concerns include legacy \npesticides, low dissolved oxygen, organic enrichment, and nutrients.  Wildlife biologists \nsited 27 species of special concern in the watershed, including the Louisiana Black Bear.  \nFisheries biologists were especially concerned with the significant disappearance of game \nfish populations. \n \nStakeholders and landowners sited drainage as an additional concern in the watershed.  \nSedimentation and subsequent shallowing of stream channels has allowed thick \nvegetation to establish in many parts of Bear Creek.  Buttonbush and other aquatics have \nbegun to impede drainage.  The problem has been compound by beaver and nutria. \n \nThe last sited issue of interest and concern in the watershed is public access.  Opinions on \naccess vary greatly, among both groups.  Many fishermen and residents of the watershed \nwould like to gain access to some of the oxbows in the watershed for fishing and \nrecreational purposes.  However, access to oxbows in the watershed is almost entirely \ncontrolled by private landowners.  Many landowners are opposed to granting access to \nthe public while other landowners are not opposed. \n \n \n \n \n \n \n \n \n \n \n \n \n\n 10 \nPriority Concerns \n \nTable 1.  Priority Concerns in Bear Creek Watershed \nStatus Description \nConcern: \nCause: \nLocation: \nExtent: \nSedimentation/Turbidity \nNonpoint source agricultural runoff due to erosion \nImpairment occurs in Mossy, Six Mile, Wasp, and Sky Lakes \nEntire watershed \nConcern: \nCause: \nLocation: \nExtent: \nLow DO/Organic Enrichment \nNonpoint source agricultural runoff and/or failing septic systems \nImpairment occurs in Bear Creek, Blue, Mossy, Three Mile, and Wasp Lakes \nApproximately 52 miles of surface water \nConcern: \nCause: \nLocation: \n \nExtent: \nHigh Nutrient Levels \nNonpoint source agricultural runoff \nImpairment occurs in Bear Creek, Blue, Four Mile, Mossy, Six Mile, Sky, Six \nMile, Three Mile, and Wasp Lakes \nApproximately 52 miles of surface water \nConcern: \nCause: \nLocation: \nExtent: \nFish Advisories \nSoil persistence of legacy pesticides (DDT & Toxophene) \nAll water bodies containing gar, buffalo, carp, and catfish longer than 22” \nEntire watershed \nConcern: \nCause: \nLocation: \n \nExtent: \nNoxious Aquatic Vegetation \nNatural dispersal and boat hull transfer \nImpairment occurs in Bear Creek and all oxbows connected by Bear Creek \nduring normal water level conditions. \nEntire watershed \nConcern: \nCause: \nLocation: \nExtent: \nFisheries Management \nDecline of game fish populations \nAssociated oxbow lakes able to sustain fisheries during low water \nEntire watershed \nConcern: \nCause: \nLocation: \nExtent: \nAccess to Public Waters  \nLack of sufficient public access to larger oxbow lakes in watershed \nAssociated oxbow lakes able to sustain fisheries during low water \nEntire watershed \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 11 \nBear Creek Resources \n  \nWater Quality Standards \n \nThe water use classification for all perennial surface waters of this watershed stated in the \nMississippi water quality regulations is Fish and Wildlife Support. The designated \nbeneficial uses for these waters are Secondary Contact Recreation and Aquatic Life \nSupport  (MDEQ 2003).  Table 2 lists the numeric water quality criteria applicable to \nBear Creek watershed perennial surface waters (MDEQ 2002). \n \nTable 2. Water quality criteria for Bear Creek watershed. \nParameter Criteria \nDissolved Oxygen 5.0 mg/L daily average, 4.0 mg/L instantaneous \nPH Between 6.0 and 9.0 su \nTemperature 32.2 deg C \nFecal coliform May – October: geometric mean of 200 per 100 mL, 400 per \n100 mL less than ten percent (10%) of the time during a 30 \nday period. \nNovember – April: geometric mean of 2000 per 100 mL, \n4000 per 100 mL less than ten percent of the time during a \n30 day period. \nSpecific conductance 1000 uohms/cm \nDissolved Solids 750 mg/L monthly average, 1500 mg/L instantaneous \n \nMississippi’s water quality standard for sediment is narrative and reads as follows: \n“Waters shall be free from materials attributed to municipal, industrial, agricultural or \nother discharges producing color, odor, taste, total suspended or dissolved solids, \nsediment, turbidity, or other conditions in such degree as to create a nuisance, render the \nwaters injurious to public health, recreation or to aquatic life and wildlife or adversely \naffect the palatability of fish, aesthetic quality, or impair the waters for any designated \nuse” (MDEQ 2002). \n \nCurrent Condition \n \nSurface Water Quality \n \nThere is not a routine water quality monitoring station in Bear Creek watershed. \nTwo major water quality studies have been conducted on Bear Creek, one by the \nNational Sedimentation Laboratory in the late 1970’s, and one by the Vicksburg \nDistrict Corps of Engineers during 1990. Data from the 1990 study indicate \ndissolved oxygen conditions that do not meet the water quality criteria for the \nBear Creek system (MDEQ 2003a). Bacterial and pesticide contamination of Bear \nCreek was investigated by the USDA-ARS during the 1980’s (MDEQ 2003c). \nThe USDA-ARS also conducted investigations of the fisheries, plankton, and \nsediments in the Bear Creek system during the 1980’s. A summary of data \n\n 12 \ncollected during all of these studies as well as listings of reports associated with \nthem are available in the Yazoo River basin data compendium (MDEQ 2003c). \n \nA number of water bodies in the Bear Creek watershed have been evaluated as \nimpaired (not based on water quality measurements) and are included on the \nMississippi 303 (d) List. Table 3 summarizes the listings from the 2002 303(d) \nList. A number of water bodies in the watershed that were included on previous \n303(d) Lists are being de-listed. Bear Creek, Wasp Lake and Three Mile Lake \nlistings for nutrients, organic enrichment/low DO, and sediment/siltation are \nscheduled for de-listing due to completion of TMDLs for these pollutants. \nPrevious impairment listings of Blue Lake and Mossy Lake due to nutrients and \norganic enrichment/low DO are also scheduled for de-listing due to completion of \nTMDLs; as are previous listings of Four Mile Lake, Macon Lake, Six Mile Lake, \nand Sky Lake for nutrients; and a Wasp Lake listing for pesticides (MDEQ \n2004a).  \n \nTable 3. 2002 303(d) Listings for Bear Creek watershed \nWater Body Impairment Pollutant/Cause \nBear Creek Aquatic Life Support Pesticides \nMacon Lake Aquatic Life Support Pesticides \nSediment/siltation \nMossy Lake Aquatic Life Support Pesticides \nSediment/siltation \nSix Mile Lake Aquatic Life Support Pesticides \nSediment/siltation \nSky Lake  Aquatic Life Support Pesticides \nSediment/siltation \nUpper Six Mile Lake Aquatic Life Support Nutrients \nPesticides \nSediment/siltation \nFour Mile Lake Aquatic Life Support pesticides \n \nGroundwater Resources \n \nThe majority of drinking water use in this watershed is supplied by groundwater \nfrom the deep aquifer. The majority of agricultural water use in this watershed is \nsupplied by groundwater from the shallow alluvial aquifer. No issues have yet \nbeen raised with regard to the quality of groundwater in this watershed. Declining \ngroundwater levels in the alluvial aquifer are an issue in the watershed (MDEQ \n2000). \n \n \n \n\n 13 \nTMDLs \n \nThe water bodies in the Bear Creek watershed have been included on Mississippi \n303(d) Lists.  Three total maximum daily load studies (TMDLs) related to these \nlisted segments have already been completed, one addressing sediment/siltation, \nand one addressing organic enrichment/low dissolved oxygen and nutrients. \n \nA TMDL addressing sediment/siltation impairment listings for Bear Creek, Three \nMile Lake, and Wasp Lake has been completed and approved by U.S. EPA \n(MDEQ 2003b). Nonpoint sources of sediment (due to erosion) are the primary \nsources of concern. Sources identified in the TMDL include agriculture, \nsilviculture, rangeland, construction sites, roads, urban areas, mass wasting areas, \ngullies, surface mines, in-channel and in-stream processes, and historical land use \nactivities and channel alterations. Wet weather conditions are the critical \nconditions for sediment loading to the water bodies. The target sediment yield for \nthe watershed at the effective discharge is 2.4E-03 to 7.3E-03 tons/acre/day. The \nexisting yield for the watershed is estimated to be between 3.9E-03 and 7.0E-03 \ntons/acre/day. Thus the TMDL does not recommend a reduction in the sediment \nload, but does recommend maintaining existing management practices to prevent \nan increase in the sediment load (MDEQ 2003b). \n \nA phase 1 TMDL addressing organic enrichment/low dissolved oxygen and \nnutrients listings for Bear Creek, Blue Lake, Four Mile Lake, Macon Lake, Mossy \nLake, Six Mile Lake, Sky Lake, and Three Mile Lake has been completed and \napproved by U.S. EPA (MDEQ 2003a). There are currently no numerical criteria \nfor nutrient concentrations in Mississippi surface waters, so a TMDL for nutrients \nwas not developed. However, nutrient contributions to oxygen demand were \nincluded in the dissolved oxygen TMDL. Nonpoint sources are considered to be \nthe primary source of oxygen demand in the Bear Creek system. However, the \nTMDL recommends that no oxygen demanding point source discharges be added \nto the watershed since operation of the Wasp Lake control structure reduces the \nassimilative capacity of the system by reducing flow. No estimate was made of \nexisting oxygen demanding loads or of reductions required to achieve the \nTMDLs. The TBODu target value for the TMDL is 7.5 mg/L. Flow varying \nTMDLs were calculated by multiplying the target TBODu concentration by the \nflow. The resulting TBODu TMDLs for Bear Creek ranged from 0 lb/day to \n202,166 lb/day, or 0 lb/acre-day to 2.73 lb/acre-day (MDEQ 2003a).  \n \nThe Wasp Lake pesticide impairment was addressed in a pesticide TMDL for the \nYazoo River basin (MDEQ 2003d). The target for this TMDL is removal of fish \nconsumption advisories for DDT and Toxaphene, and reduction of water column \nconcentrations to the DDT human health and aquatic organism standard, and the \nToxaphene fresh water chronic standard. The methods proposed for achieving \nthese targets included implementation of BMPs to reduce sediment loading to \nwater bodies (pesticides are present in basin soils) and natural attenuation \n(historical pesticide monitoring data from the Yazoo River basin indicate a \n\n 14 \ndecreasing trend in pesticide concentrations in soils, fish tissue, and water) \n(MDEQ 2003d). \n \nFisheries, Plant, and Wildlife Resources \n \nThe only federally endangered species listed by the Mississippi Natural Heritage \nInventory for the Bear Creek watershed area is pondberry (Lindera melissifolia) \nin Sunflower County.  The only federally threatened species that may occur the \nHumphreys County portion of the watershed is the Louisiana black bear (Ursus \namericanus luteolus). Although not federally listed, the State of Mississippi has \nlisted the American black bear (Ursus americanus) as threatened in the Sunflower \nand Leflore County portions of the watershed.  These species have the potential to \nbe present in the Bear Creek watershed. There are also approximately 27 species \nof “special concern” for Leflore, Humphreys, and Sunflower counties included in \nthe Natural Heritage Inventory. \n \nTable 4. Species of Special Concern in Bear Creek Watershed \nScientific Name Common Name Status \nGraptemys ouachitensis Ouachita map turtle Special Concern \nGraptemys pseudogeographica \nkohni \nMS map turtle Special Concern \nMacrochelys temminckii Alligator Snapping Turtle Special Concern \nPleurobema rubrum Pyramid Pigtoe Special Concern \nPolyodon spathula Paddlefish Special Concern \nQuadrula nodulata Wartyback Special Concern \nTruncilla truncate Deertoe Special Concern \nActinonaias ligamentia Mucket Special Concern \nAnodonta suborbiculata Flat Floater Special Concern \nArcidens confragosus Rock Pocketbook Special Concern \nEllipsaria lineolata Butterfly Special Concern \nEllipto dilatata Spike Special Concern \nPlethobasus cyphyus Sheepnose Special Concern \nPotamilus ohiensis Pink Papershell Special Concern \nQuadrula cylindrical \ncylindrical \nRabbitsfoot Special Concern \nUniomerus declivis Tapered Pondhorn Special Concern \nUrsus americanus luteolus Louisiana Black Bear Federally Threatened \nLasiurus cinereus Hoary Bat Special Concern \nFraxinus profunda Pumpkin Ash Special Concern \nPenstemon tenuis Sharp-Sepal Beardtongue Special Concern \nCarya leiodermis Swamp Hickory Special Concern \nLindera melissifolia Pondberry Federally Endangered \nMenispermum canadense Canada Moonseed Special Concern \nThalia dealbata Powdery Thalia Special Concern \nArmoracia aquatica  Lake Cress Special Concern \nBumelia reclinata Florida Bumelia Special Concern \nCarex decomposita Cypress-Knee Sedge Special Concern \nIris fulva Red Flag Special Concern \nQuercus mississippiensis Delta Post Oak Special Concern \nUrsus americanus American Black Bear State Threatened \n \n\n 15 \n \nAll water bodies in the Delta, including those in the Bear Creek watershed, were \nplaced under fish consumption advisory in 2001 for the legacy pesticides DDT \nand Toxaphene. The fish covered by the advisory were carp, buffalo, gar, and \nnon-farm raised catfish over 22 inches (MDEQ 2001). \n \nSince 1985, bottomland wetland and forest habitats have been restored in the \nwatershed through USDA Farm Bill Programs such as CRP and WRP.  \nAdditionally, the Sky Lake WMA was established by the USACE as a mitigation \nsite and is now managed by the Mississippi Department of Wildlife, Fisheries and \nParks.  This WMA is home to the former State Champion Bald Cypress.  It is \nestimated that nearly 20% of the watershed has been restored to bottomland \nhardwood forests in the past 20 years.  \n \nBecause of increased forest lands and an abundance of natural wetlands, the Bear \nCreek Watershed has significant populations of numerous consumptive wildlife \nspecies such as white-tailed deer, migratory waterfowl, and small game.  The \neastern wild turkey is also making a humble living in parts of the watershed.   \n \nFishing is only second to hunting as an outdoor recreational activity in the \nwatershed.  Among the many oxbow lakes that scatter the watershed, several are \nconsidered outstanding crappie fisheries.  Unfortunately, MDWFP have cited \ndeclines in bluegill and other sunfish populations in Mossy Lake and other more \nproductive fisheries in the watershed.  The cause is unknown, but siltation is \nsuspected.   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 16 \nWatershed Implementation Plan (WIP) \n  \nGoal \n \nThe goals of this watershed implementation plan is to remove named waterbodies \nin this watershed from the 303(d) list (Table 3), thereby removing the potential \nregulatory actions carried by approved TMDLs on named waterbodies in this \nwatershed.  This can only be accomplished through the reduction of named \npollutants in named waterbodies in the watershed.   Ultimately, all waterbodies in \nthis watershed must reach and maintain their MDEQ designated use for Fish and \nWildlife Support, Secondary Contact Recreation, and Aquatic Life Support. The \ngoals of this watershed plan can be achieved through the implementation of \nagricultural BMPs.  Priority Concerns (Table 1) that do not directly identify \n303(d) listed impairments or TMDLs in the watershed may also be addressed by \nthis watershed plan because it is comprehensive in nature.  But it must be noted \nthat these concerns are secondary objectives.  \n \nSediment/Turbidity \n \n  Participants \n      \n  Delta F.A.R.M. \n  Local Soil and Water Conservation Districts (SWCD) \n  Mississippi Department of Environmental Quality (MDEQ) \n  Mississippi Partners for Fish and Wildlife (MPFW) \n  Mississippi State University Extension Service (ES) \n  Private Landowners and Farmers \n  US Army Corps of Engineers (USACE) \n  USDA-ARS National Soil Sedimentation Laboratory (Sedimentation Lab) \n  USDA Farm Service Agency (FSA) \n  USDA Natural Resources Conservation Service (NRCS) \n  Yazoo-Mississippi Delta Joint Water Management District (YMD) \n   \n  Implementation/Action \n   \nSilt and soil that choke drainage, stress fisheries, increase turbidity, and \nshorten the overall life span of most lakes in Bear Creek come from \nadjacent cropland, bank sloughing, and head cutting due to flooding.  All \ncauses can be addressed by programs authorized and funded through the \nConservation Title of the Farm Bill.  Programs such as the Environmental \nQuality Incentives Program (EQIP), Conservation Reserve Program \n(CRP), Wildlife Habitat Incentives Program (WHIP), and Wetland \nReserve Program (WRP) all provide significant financial incentives to \nhelp landowners address sedimentation issues in Bear Creek.  The USDA \nNRCS and/or FSA administers these programs and also provides \nsignificant technical assistance opportunities to private landowners.  Those \n\n 17 \nlandowners concerned about sedimentation in Bear Creek can often find \ntechnical and financial assistance by simply contacting their local county \nUSDA Service Center.   \n \nOther funding opportunities for BMP installation within the watershed \nwould include the Mississippi Partners for Fish and Wildlife and grants \nfrom other entities like the National Fish and Wildlife Foundation. \nTechnical assistance to address sedimentation in the Bear Creek \nWatershed can be provided by Delta F.A.R.M., Sedimentation Laboratory, \nMississippi State University Extension Service, YMD, MPFW, USACE, \nand MDEQ.  \n \nIf installed and maintained property, the following Best Management \nPractices could be used to reduce sedimentation by 35% - 67% in the Bear \nCreek Watershed. \n \n• Structures for Water Control (100 units minimum) \n• Overfall Pipes (40 units minimum) \n• Riparian Buffers (100 acres minimum) \n• Grass Filter Strips (included in riparian buffer estimate) \n• Grass Waterways (25 acres minimum) \n• Stiff Grass Hedges (+100 sites) \n• Field Borders (40 acres) \n• Reforestation (1000 acres) \n• Wetland Construction (100 acres) \n• Hydrology Restoration (included in wetland construction estimate) \n• Land Forming (1000 acres) \n• Bank Stabilization (as needed, minimum 25 sites) \n• No-Till (1000 acres) \n• Cover/Double Cropping (1000 acres) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 18 \n  Budget \n \nProjected costs for implementing practices that address sedimentation and \nsiltation can be found in Table 5. \n \nTable 5.  Projected Costs for Agricultural Best Management Practices \nPractice Unit Cost \n(w/installation) \nNumber of Units Total Cost \nWater Control \nStructures \n$1,500.00 100 $150,000.00 \nOverfall Pipes $1,600.00 40 $64,000.00 \nRiparian Buffers \n(rental payment*) \n$125.00/acre \n$55.00/acre x 15 years* \n100/acres \n100/acres* \n$12,500.00 \n$82,500.00* \nGrass Waterways $35.00/acre 25/acres $875.00 \nStiff Grass Hedges $250.00/site 100/sites $25,000.00 \nField Borders $125.00/acre 40/acres $5,000.00 \nReforestation $145.00/acre 1000/acres $145,000.00 \nWetland Construction $500.00/acre 100/acres $50,000.00 \nLand Forming $400.00/acre 1000/acres $400,000.00 \nBank Stabilization $3,000.00/site 25/sites $75,000.00 \nNo-Till* $20.00/acre x 15 years* 1000/acres* $300,000.00* \nCover/Double Cropping $20.00/acre x 15 years* 1000/acres* $300,000.00* \nTOTAL   $1,609,874.00 \n \nLow DO/Organic Enrichment \n \n  Participants \n      \n  Delta F.A.R.M. \n  Local Soil and Water Conservation Districts (SWCD) \n  Mississippi Department of Environmental Quality (MDEQ) \n  Mississippi Department of Health (MDH) \n  Mississippi Partners for Fish and Wildlife (MPFW) \n  Mississippi State University Extension Service (ES) \n  Private Landowners and Farmers \n  US Army Corps of Engineers (USACE) \n  USDA-ARS National Soil Sedimentation Laboratory (Sedimentation Lab) \n  USDA Farm Service Agency (FSA) \n  USDA Natural Resources Conservation Service (NRCS) \n  US Geological Survey (USGS) \n  Yazoo-Mississippi Delta Joint Water Management District (YMD) \n\n 19 \n   \n  Implementation/Action \n   \nAlthough there are many causes for low DO levels and high organic \nenrichment, it is thought that non-point sources from agricultural runoff \nand failing septic systems are the primary causes in the Bear Creek \nWatershed.   \n \nImplementing agricultural BMPs that reduce erosion and sedimentation \nimprove DO levels and reduce organic enrichment. Therefore, the first \ncourse of action would be to implement those BMPs listed in the previous \nsection as addressing sediment and turbidity. \n \nLow DO levels can also be cause by low flow/shallow waters, algae \nblooms, and extreme water temperatures.  These issues can be addressed \nby the installation of low water weirs to impound more water during \nperiods of drought.  Furthermore, flows could be augmented by other \nwater sources as they have in other Yazoo Basin streams.  MDEQ, \nUSACE, USGS, and YMD all have experience in these activities.  \nExtreme water temperatures can also be mitigated by installing riparian \nforest buffers near waters to provide shading.  The die-off of noxious \naquatics may also cause low DO levels in the fall.  However, an action \nplan to address noxious aquatics will be discussed in a later section. \n \nOutside of agriculture, failing septic systems may also be a major \ncontributor to organic enrichment in the Bear Creek Watershed.  Many \nsecondary homes (weekend homes, fish camps, hunting camps, etc...) line \nthe banks of several lakes in the watershed.  It is thought that many of \nthese homes do not have adequate septic systems.  However, this must be \nconfirmed before action is taken.  The Mississippi Department of Health \nand MDEQ shall take the lead on further identifying the problem and any \nfurther action.   \n \n  Budget \n \nProjected costs for implementing ag BMPs that address Low DO and \nOrganic Enrichment are listed in Table 5.  Other efforts to address Low \nDO and Organic Enrichment are listed below in Table 6.  \n \nTable 6.  Projected Costs for Weirs and Flow Augmentation \nPractice Unit Cost \n(w/installation) \nNumber of Units Total Cost \nWeir $250,000.00 3 $750,000.00 \nFlow Augmentation $100,000.00 1 $100,000.00 \nTOTAL   $850,000.00 \n\n 20 \n \nHigh Nutrient Levels \n \n  Participants \n      \n  Delta F.A.R.M. \n  Local Soil and Water Conservation Districts (SWCD) \n  Mississippi Department of Environmental Quality (MDEQ) \n  Mississippi Department of Health (MDH) \n  Mississippi Partners for Fish and Wildlife (MPFW) \n  Mississippi State University Extension Service (ES) \n  Private Landowners and Farmers \n  US Army Corps of Engineers (USACE) \n  USDA-ARS National Soil Sedimentation Laboratory (Sedimentation Lab) \n  USDA Farm Service Agency (FSA) \n  USDA Natural Resources Conservation Service (NRCS) \n  US Geological Survey (USGS) \n  Yazoo-Mississippi Delta Joint Water Management District (YMD) \n   \n  Implementation/Action \n   \nHigh nutrient levels are also attributed to non-point agricultural run-off.  \nSimilar to sediment and organic enrichment, nutrients can be significantly \nreduced by using those same BMPs listed in Table 5.  By implementing \nthese BMPs, nutrients can be reduced by approximately 70% (Freedman et \nal. 2003, Klapproth and Johnson 2000). \n \n  Budget \n \nProjected costs for implementing ag BMPs that reduce nutrient loading are \nlisted in Table 5.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 21 \n \nFish Advisories \n \n  Participants \n   \n  Delta F.A.R.M. \n  Local Soil and Water Conservation Districts (SWCD) \n  Mississippi Department of Environmental Quality (MDEQ) \n  Mississippi Department of Health (MDH) \n  Mississippi Department of Wildlife, Fisheries, and Parks (MDWFP) \n  Mississippi Partners for Fish and Wildlife (MPFW) \n  Mississippi State University Extension Service (ES) \n  Private Landowners and Farmers \n  US Army Corps of Engineers (USACE) \n  USDA-ARS National Soil Sedimentation Laboratory (Sedimentation Lab) \n  USDA Farm Service Agency (FSA) \n  USDA Natural Resources Conservation Service (NRCS) \n  Yazoo-Mississippi Delta Joint Water Management District (YMD) \n     \n  Implementation/Action \n   \nFish advisories stem from the persistence and existence of levels of legacy \npesticides like DDT and Toxaphene in fish tissue.  The EPA sets tolerance \nlevels for said fish advisories and MDEQ enforces these advisories.  The \nFisheries Bureau of MDWFP also assists MDEQ with educational \nprocesses associated with fish advisories.   \n \nThe goal of this action item is to removal fish consumption advisories for \nDDT and Toxaphene, and reduction of water column concentrations to the \nDDT human health and aquatic organism standard, and the Toxaphene \nfresh water chronic standard. The methods proposed for achieving these \ntargets included implementation of BMPs to reduce sediment loading to \nwater bodies (pesticides are present in basin soils) and natural attenuation \n(historical pesticide monitoring data from the Yazoo River basin indicate a \ndecreasing trend in pesticide concentrations in soils, fish tissue, and water) \n(MDEQ 2003d).  Therefore, those BMPs listed in Table 5 will also serve \nto achieve this goal. \n \n  Budget \n   \nProjected costs for implementing BMPs that would reduce the loading of \nlegacy pesticides are listed in Table 5.  \n \n \n \n \n\n 22 \nNoxious Aquatic Vegetation \n \n  Participants \n   \n  Mississippi Department of Wildlife, Fisheries, and Parks \n  Mississippi State University Extension Service \n  U.S. Army Corps of Engineers    \n    \n  Implementation/Action \n   \n Alligator weed has been identified as the primary noxious aquatic weed \nfound in the Bear Creek Watershed.  Biological control measures such as \nthe use of the Alligator Flea Beetle can and will be used.  MDWFP will \nstock said insects in those lakes with higher public use and access to \ncontrol the weed.  The USACE rears these insects and provides them to \nMDWFP upon request. \n \nHerbicides may also be used to successfully treat Alligator weed.  \nHowever, these means are typically very expensive and labor intensive, \nrequiring a significant investment.  MDWFP is conducting some herbicide \ntreatment on area lakes, but it is cost prohibitive for the entire watershed.   \n \nThe Mississippi State University Extension Service is also working on the \ndevelopment of new control measures.  As these new measures are \nidentified and perfected, it is hopeful that they could be utilized in the \nBear Creek Watershed and throughout the Yazoo Basin wherever \nAlligator weed exists.   \n \n  Budget \n \nProjected costs for control and/or eradication of targeted noxious aquatic \nvegetation in the Bear Creek Watershed are listed in Table 7. \n \nTable 7.  Project Costs for Noxious Aquatic Weed Control \nPractice Unit Cost \n(w/installation) \nNumber of Units Total Cost \nMDWFP Monitoring $300 day 3 days/yr./5 years $4,500.00 \nMDWFP Stocking $300 day 1 day/yr/5 years $1,500.00 \nFlea Beatles $0.00/500 insects N/A $0.00 \nHerbicide Treatments $90.00/ac. 1000 acres $90,000.00 \nTotal   $96,000.00 \n \n \n \n\n 23 \nFisheries Management \n \n  Participants \n      \n  Mississippi Department of Wildlife, Fisheries, and Parks \n \n  Implementation/Action \n   \nMDWFP Bureau of Fisheries takes an active role in the management of \nmost popular public waters in the state.  Of those many lakes in the Bear \nCreek watershed, only a very few offer public access, thereby reducing \npublic use and the importance of MDWFP’s activities in the watershed.  \nHowever, public access can be gained to several of the lakes, of which, \nMossy Lake is the most popular fishery.   \n \nFor Mossy Lake, MDWFP has proposed to map the lakes depth profile as \na part of a comprehensive, statewide effort to provide new lake maps to \nthe public.  This project is ongoing.  Furthermore, it is proposed that a \nfisheries management plan be developed, implemented and its subsequent \nresults monitored.  Management actions may include the implementation \nof specific creel and slot sizes on certain species of game fish like white \ncrappie and black bass. \n \nNo other actions have been proposed for other lakes in the watershed. \n   \n   Budget \n \nProjected costs associated with fisheries management on Mossy Lake are \noutlined in Table 8. \n \nTable 8.  Projected Costs for Fisheries Management on Mossy Lake \nPractice Unit Cost \n(w/installation) \nNumber of Units Total Cost \nMonitoring  \n    Field \n    Fish Pop. Reports \n    Field \n    Harvest Survey  \n \n$590/day \n$266/day \n$288/day \n$266/day \n \n4 \n2 \n28 \n10 \n$13,622.00 \nMgt. Plan Development $266/day 7 $1,860.00 \nMapping $554/day 4 $2,216.00 \nTOTAL   $17,698.00 \n \n \n\n 24 \nAccess to Public Water \n \n  Participants \n      \n  Mississippi Department of Wildlife, Fisheries, and Parks \n  Mississippi Department of Environmental Quality \n  Private Landowners \n  General Public/Lake Users \n   \n  Implementation/Action \n   \nThe Technical Committee of this Watershed Implementation Team, along \nwith the public users in the watershed, have identified access to public \nwaters as a primary concern in this watershed.  However, this point was \ngenerally contested by the private landowners in the watershed who own \nland surrounding these public waters.  Although there were exceptions, the \nlandowners generally agreed to oppose any efforts to increase public \naccess to the public waters in the watershed. \n \nBecause the entire Watershed Implementation Team did not reach \nconsensus on this issue, no plan of action will be recommended. \n \n  Budget \n \nBecause no action item was developed, there is no budget for this priority \nconcern. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 25 \nEducation Strategy \n \nGoal \n \nThe overall objective of the education strategy in the Bear Creek watershed is to \ndevelop an atmosphere that promotes sustained, long-term protection and \nimprovement of aquatic resources in the watershed. Specific objectives of \neducation efforts in the watershed include the following. \n \n• Increase farmer and landowner awareness of the value of clean water and \ntheir responsibility to insure others down stream have clean water. \n• Increase farmer and landowner knowledge of programs that offer financial \nand/or technical assistance to plan, design, and/or install BMPs to improve \nwater quality.   \n• Increase public awareness of the value of clean water. \n• Increase public awareness of how common activities affect water quality \nand critical flora and fauna. \n• Increase public awareness of how BMPs can be used to reduce negative \nwater quality and habitat affects. \n• Increase public awareness of the long term environmental and economic \nadvantages of protecting and improving water quality and habitat in the \nBear Creek watershed. \n \n  Delta Wildlife and Delta F.A.R.M. \n \nEducation and outreach are part of Delta Wildlife and Delta F.A.R.M.’s \nmission. Delta Wildlife publishes a quarterly magazine as Delta F.AR.M. \npublishes a quarterly newsletter for members and make educational \npresentations at schools and to various groups.  A portion of these efforts \nwill be targeted towards landowners and residents in this watershed.  \nFurthermore, the organization will use other means of outreach through \npress releases and their website.  This implementation plan will also be \navailable on both organization’s website along with information for \nlandowners in the watershed who wish to participate. \n \n Mississippi Natural Resources Conservation Service \n \nThe Mississippi Natural Resources Conservation Service (NRCS) \nprovides technical resources and education through a number of \nconservation programs, the Natural Resource Inventory, public service \nannouncements, technical resources, and their website \n(http://www.ms.nrcs.usda.gov)\n. Information on some of these programs \nand resources is provided below. Additional information is available on \n\n 26 \nthe Mississippi NRCS website or by contacting Mississippi NRCS or \ncounty USDA Service Centers. Education and outreach activities are \nperformed primarily by county conservationists. \n \nConservation Programs \n \nThe Mississippi Natural Resources Conservation Commission \nassists in implementing a number of conservation programs in \nMississippi. These programs provide technical and/or financial \nassistance to landowners for conservation of particular land uses \nand restoration of natural habitats. A list of these programs is \nprovided below.  \n \n• Conservation of Private Grazing Lands \n• Conservation Technical Assistance \n• Emergency Watershed Protection \n• Environmental Quality Incentives Program (EQIP) \n• Farmland Protection Program \n• Grassland Reserve Program \n• Grazing Lands Conservation Initiative \n• Resource Conservation and Development \n• Soil Survey Programs \n• Watershed Protection and Flood Prevention \n• Wetlands Reserve Program \n• Wildlife Habitat Incentives Program \n \nNRCS also assists in the Conservation Reserve Program (CRP) \nmanaged by Farm Service Agency, and the Stewardship Incentive \nProgram managed by Forest Service. Information about these \nprograms is available on the website, or by contacting the County \nUSDA Service Centers. \n \nTechnical Resource Documents \n \nTechnical resource documents are available on a wide variety of \nsubjects. These documents can be obtained through the website, or \nby contacting the County USDA Service Centers. Technical \nresource documents are available for the following subject areas: \n \n• Agronomy, wind and water erosion, \n• Air quality, \n• Conservation practice standards, \n• Cultural resources, \n• Economics resources, \n• Engineering tools and resources, \n\n 27 \n• Environmental compliance, \n• Farmland information center, \n• Forestry and agroforestry, \n• Invasive species, \n• Natural resource data and analysis, \n• Nutrient management, \n• Pest management, \n• Plants, \n• Range and pasture, \n• Soils, \n• Streams, \n• Understanding ecosystems, \n• Water resources, and \n• Wildlife biology. \n \nTechnical Tools and Models \n \nTechnical tools and models are available through the Mississippi \nNRCS. These tools are available on the website, or by contacting \nthe County USDA Service Centers. The available tools and models \ninclude:  \n \n• Animal waste management software, \n• Computer tools for conservation decision making, \n• Engineering documents and tools, \n• Irrigation and water management tools, \n• Manure Master decision support system, \n• Pest management, \n• Interactive web tool for selecting and sizing buffer \npractices for the Conservation Buffer Initiative, \n• SITES water resources site analysis program, \n• Soil Data Viewer, \n• Soil quality test kits, \n• STATSGO soils browser, \n• TR-55, urban hydrology for small watersheds, and  \n• The web based VegSpec program. \n \n \n \n \n \n\n 28 \nConservation Education Resources \n \nThe Mississippi NRCS is also involved in a number of \nconservation education efforts. Most of these programs are geared \ntoward children in kindergarten through 12\nth\n grade. Information on \nthese programs and how to obtain educational materials is \navailable on the website at \nhttp://www.nrcs.usda.gov/feature/education/\n. Included are \nmaterials about soil science education, backyard conservation, \nconservation history, and living in harmony with wetlands. An \ninteractive educational program “S.K. Worm Teaches Soils” is \navailable on the website at \nhttp://www.nrcs.usda.gov/feature/education/squirm/skworm.html. \n \n Mississippi Soil and Water Conservation Commission \n \nThe Mississippi Soil and Water Conservation Commission (MSWCC) \nmaintains a number of educational programs and materials. Detailed \ninformation is provided below. In addition to these programs, the Soil and \nWater Conservation Commission and county districts also maintain \nwebsites for the purpose of providing information and outreach \n(www.mswcc.state.ms.us\n).  \n \nEducational videos \n \nFive educational videos have been produced for adults.  These \nvideos can be obtained from local Soil and Water Conservation \nDistrict (SWCD) offices or from the MSWCC. \n \n• Conservation Tillage \n• Native Mississippi Wildflowers \n• Scenic Rivers \n• Urban Nonpoint Source Pollution: A citizen’s Guide \n• Our Little River \n \nModels \n \nWorking models of an aquifer, farm, urban area, and watershed are \navailable. These models can be used to demonstrate pollution \nproblems, and conservation practices. The models can be obtained \nfrom SWCD offices or from the MSWCC. \n \n \n \n \n\n 29 \nActivity booklets \n \nThree activity booklets have been developed for education of \nchildren. Two of the booklets are appropriate for ages pre-\nkindergarten through three years; “Sammy Soil” teaches the basics \nof soil and water conservation and, “Wendy Water” teaches basic \nwater conservation. One booklet can be used for ages pre-\nkindergarten through junior high school: “Earthworms, Recycling \nand Composting in the Classroom”. These booklets can be \nobtained from local SWCD offices or from the MSWCC. \n \nNewsletters \n \nThree newsletters are published regularly. Current issues are \navailable from MSWCC. \n  \n• MSWCC Annual Report \n• MACD “Conservation Outlook” \n• Envirothon “EnviroUpdate” \n \nAwards \n \nAn awards program for outstanding conservation teachers at the \nelementary and secondary level, and outstanding conservation \neducation program is sponsored. These awards are given yearly \nand recognized at the Annual Meeting of the Mississippi \nAssociation of Conservation Districts in January. They spotlight \nthe Conservation Education efforts of individual teachers in local \nschools who integrate responsible conservation awareness into \ntheir everyday classroom curriculum. The Conservation Education \nProgram District award is presented to the Soil and Water \nConservation District that has shown innovative methods of \ndelivering the conservation message to students as well as adults \nthrough a comprehensive education program. Each state winner is \nnominated for the national award sponsored by Zeneca and the \nNational Association Conservation Districts. \n \n \n \n \n \n \n \n \n \n\n 30 \nCarnivals and field days \n \nLocal SWCDs organize and conduct educational hands-on field \ndays to provide school age students an opportunity to participate in \nconservation activities in various natural areas. Local and state \nresource professionals, as well as trained volunteers, conduct the \nstops and lead or guide the groups in the learning process. The \nevent is often held at local parks or environmental sites, as well as \nat some schools. The age span varies from kindergarten to eighth \ngrade, depending on the local SWCD. However, fifth grade is the \nmost popular grade attending Carnivals. \n \nConservation grandparents \n \nThis program provides a series of activity sheet and conservation \nkits for an adult to work with one or more children using everyday \nmaterials to teach conservation awareness. Materials are available \nfrom SWCD offices or MSWCC. Workshops can be arranged \nthrough Gail Spears at the MSWCC office. \n \nFarm tours \n \nThe MSWCC works with a Soil & Water Conservation District \nand a local landowner to schedule a tour of an installed Best \nManagement Practice (BMP). This gives those observing the \nprocess a hands-on look at the results of using such a conservation \npractice. Touring these farms along with District personnel and \nCommissioners are other farmers, the general public, local media \nrepresentatives and local municipal or county officials. \n \nFood, land, and people \n \nFLP is a nonprofit, interdisciplinary, supplementary educational \nprogram emphasizing agriculture, the environment, people of the \nworld, and their relationships. This nationwide PreK-12 \nagricultural-environmental education curriculum project provides \nhundreds of high-quality, objective and easily-integrated \ncurriculum materials. The MSWCC participates and trains teachers \nand facilitators and is a co-sponsor of this program with \nUSDA/NRCS, MS Farm Bureau, and other state and federal \nagencies and organizations. Contact Susan Thompson at MSWCC. \n \n \nLicense tags for conservation education \n \n\n 31 \nDuring the 2000 Legislative Session, the Legislature passed the \nMSWCC’s proposal for a distinctive vehicle license tags, with the \nspecial tag fee to go into a fund for conservation education. The \ndesign on the license plate is a native Mississippi wildflower, the \nBlack-eyed Susan. These tags are available in local county Tax \nCollector offices for a $30 fee in addition to regular license fees. \n \nPoster and essay contest \n \nA conservation education poster/essay contest is held yearly. The \nposter contest is divided by grade levels, K-1, 2-3, 4-6, 7-9, 10-12. \nThe rules and topic (which is usually the Soil Stewardship topic \nfrom NACD) are sent to local districts in the fall with the entries \n(posters or essays) due in the local SWCD office in the spring. The \nposters are judged at the local, area and state level with the state \nwinners being entered in the national contest. The essay contest \nhas the same theme but is conducted in grades 7-12 and is only \njudged at the local, area and state level. The awards at the state \nlevel are US Savings Bonds. \n \nTeacher workshops \n \nThe Commission conducts teacher workshops on conservation \neducation in the classroom at local schools, state subject area \nconferences, environmental education conferences, and other \neducational meetings and summer workshops. These may be in \nsupport of the two curriculums the Commission distributes or \ndeveloped for the needs of the target audience. In addition, \nEducation Specialists can assist in scheduling workshops for \nProject Learning Tree and Project Wet. Contact Clay Burns at \nMSWCC. \n \nEnvirothon \n \nThe Mississippi Envirothon is a hands-on educational competition \nfor students in grades 9-12 who compete as five-member teams. \nThey prepare in the areas of soils, aquatics, forestry, wildlife, and a \ncurrent environmental issue that changes each year. They compete \nat the area level in March to earn the right to compete at the state \ncontest in May. The state champions advance to the international \ncontest, Canon Envirothon, in the summer as Mississippi’s \nrepresentative. The state program is funded by a grant from \nChevron Mississippi. Contact Jimmy Booth at MSWCC. \n \n \n\n 32 \nSoil and water conservation youth camp \n \nThe Warren A. Hood Soil & Water Conservation Youth Camp is \nheld at Hinds Community College in Raymond, Mississippi the \nfirst week of June, starting on Sunday evening and concluding at \nnoon on Thursday. The camp is designed to make learning about \nconserving our natural resources fun as well as educational. \nParticipants from high schools in each SWCD are exposed to all \naspects of soil and water conservation including cropland, \ngrassland, woodland, and wildlife. This is achieved through \nhands-on activities conducted by local and state resource \nprofessionals, field trips, and planned recreation. Contact your \nlocal SWCD. \n \nMississippi State University Cooperative Extension Service \n \nEducational and outreach activities of the Mississippi State University \nCooperative Extensions Service include newsletters, bulletins, information sheets, \nresearch reports, a website (msucares.com), conferences, workshops, seminars, \nenvironmental quality programs, and fish and wildlife programs. These activities \nare performed primarily by county extension agents. \n \nMDEQ \n \nNonpoint Source Education/Outreach is a statewide effort that focuses education \nof the public, students, land managers, road builders, communities, and public \nofficials, on cleaning up and preventing nonpoint source (NPS) pollution in a \nwatershed. One of the primary goals of MDEQ’s NPS pollution education \nprogram is to create awareness among school age children and adults of where \nand how polluted runoff is generated. How it affects Mississippian’s quality of \nlife, and how practices can be implemented to improve water quality or to \nmaintain a pristine water body. MDEQ reaches the general public with statewide \ndistribution campaigns of NPS literature, the Mississippi Environment newsletter, \nNPS/water lesson plans to libraries and schools, NPS public service \nannouncement for radio, exhibits at conferences and professional meetings.  \nSince the inception of the Basin Management Approach to Water Quality in 1998, \nNPS education activities are being coordinated, as appropriate, with the \nImplementation Phase activities of each basin group. NPS education activities are \ndescribed below. \n \nAqua Fair \n \nAqua Fair is an annual event to educate fifth grade students on water \nquality. Aqua Fair is presented in a different region of the state each year \nand reaches an audience of about 2000 fifth graders, 100 teachers and 250 \nresource people annually. The students participate in 5 different activities \n\n 33 \nranging from “building a watershed in a pan” to “running a relay race with \nbuckets of water”. Every session is interactive and teaches a concept about \nwater. The spring, 2004 Aqua Fair is scheduled to be held in the Basin \ngroup I geographical region.  \n \nAdopt-A-Stream Program \n \nThis program involves individual citizens and local community groups in \nwater quality monitoring and protection. Through participation in an \neducational 2-day workshop, citizens and teachers learn watershed and \nland use mapping and how to make water quality determinations by \nconducting water chemistry tests and macroinvertebrate counts on a \nperennial stream. Some participants attend for the educational benefits and \nothers commit to monitoring a stream for several years. Co-sponsors of \nthis program include the Mississippi Wildlife Federation, Mississippi \nNatural Science Museum and Mississippi State University’s Coastal \nResearch and Extension Service.  \n \nNonpoint Education for Municipal Officials (NEMO) \n \nNEMO is an education program that makes the link between land use and \nwater quality using geographic information systems (GIS) technology. \nNEMO focuses on the role of impervious surfaces in the transport and \nconcentration of pollutants. The core presentation of NEMO is divided \ninto three parts. First, GIS images of topography and drainage systems are \nused to emphasize the water cycle, the watershed concept and the need for \nwatershed management. Second, the land cover/land use data, interspersed \nwith ground and aerial photographs, show local participants the current \nland use patterns in their town and the common polluted runoff problems \nassociated with each major type of land use. After which, existing land use \nin critical watersheds is compared with “build-out” scenarios based on the \ntown’s zoning regulations. The emphasis is on the potential increases in \nthe amount of impervious surface and how it can reach a problem point \nwhere streams will be degraded. DRAFTly, NEMO outlines a three-tier \nstrategy of natural resource-based planning, site design and the use of \nstormwater best management practices that towns can use to address their \nland use and better plan for future growth while protecting their water \nresources.  \n \n \n \n \n \n \n \n\n 34 \nTeacher Education \n \nTeacher education is an important component of the NPS pollution \neducation program and a number of lesson plan packages are available for \ndifferent grades. The Unclear Future of Clear Creek, a lesson plan for \ngrades 7-12 is based on Clear Creek in the Big Black River Basin. This \nlesson Plan package was initially distributed to the County Soil and Water \nConservation Districts that placed them in the schools of each of \nMississippi’s eighty-two counties. The lesson plan package continues to \nbe distributed at teacher workshops and at Adopt-A-Stream workshops. \nOther educational activities and materials are described below in \nTable 4.1. \n \nTable 9.  MDEQ NPS Pollution Educational Activities and Materials. \nEducational Activity and Materials Recommended Audience Contact Information \nEnviroscape & Groundwater Model \n(Water Model) \n5-12 grades Cooperative Extension \nService County Agents \n& MS Dept. of Health \nEnvironmentalists \nStorm Drain Marking/Stenciling \nProject-involves both marking storm \ndrains with an anti-pollution message \nand a door-to-door awareness \ncampaign in the vicinity of the \nmarked storm drains. \nAll age groups MDEQ NPS Pollution \nProgram \n \nThe Backyard Conservation \nLiterature Campaign & \nDemonstration Projects-contains \ninformation on how to reduce \npesticide usage, how to create a water \ngarden that doubles as a retention \nbasin and how to attract wildlife to \nyour backyard. \nGarden clubs, Farmers, and \nother Individual \nLandowners  \nMDEQ NPS Pollution \nProgram \n \nMS Planning & Design Manual for \nControl of Erosion, Sediment, and \nStormwater-contains detailed \ndescriptions of NPS Best \nManagement Practices. An \naccompanying Field Manual is also \navailable. \nHighway Construction \nFirms, Engineering Firms, \nLandscape Architects, \nHomebuilders and \nDevelopers \nMDEQ NPS Pollution \nProgram \n \n \n \n \n \n\n 35 \nEvaluation \n  \nMonitoring \n \nWater quality sampling was recommended in the Bear Creek TMDLs, however there are \ncurrently no known plans for studies of the Bear Creek system. \n \nAssessment of progress  \n \nProgress for this watershed implementation plan will be assessed and evaluated five (5) \nyears (2012) . Water quality data, as well as information on activities occurring in the \nwatershed and stakeholder concerns collected during the period from 2005 through 2007 \nwill be utilized. The following criteria will be used to determine progress toward plan \ngoals: \n \n• Reduction of sediment load by at least 2 tons/year, and  \n• Achievement of all Mississippi water quality criteria. \n \nPlan Evaluation Procedure \n \nThis watershed implementation plan will be evaluated and revised in 2012. The \nevaluation of this plan will be organized by the Bear Creek Implementation Team \nbeginning in January 2012. At this time the Implementation Team will develop a detailed \nschedule for review and revision of this watershed implementation plan. The \nImplementation Team members will be responsible for notifying their stakeholders of the \nopportunity to propose changes to the watershed implementation plan. One month will be \nallowed for notification of stakeholders. \n \nThe plan will be evaluated by the Team, or their designee, and any interested \nstakeholders. One month will be allowed for evaluation and submittal of comments. \nTherefore, comments will be due two months after the evaluation procedure is initiated. \nThe plan will be evaluated in two ways. First, to determine if the plan goals have been \nachieved. Second, to determine if it reflects the current condition of the watershed, state \nof science, and issues in the watershed.  \n \nPlan Revision Procedure \n \nAfter evaluation, MDEQ will prepare a revised watershed implementation plan \nincorporating the changes requested by the reviewers. At this point it may be necessary to \ncall a meeting to reconcile any conflicting comments or requests for change.  \n \nIf the evaluation criteria are all being met in Bear Creek surface waters, the watershed \nimplementation plan will be revised to address a different restoration issue or issues, or to \nprotect the quality of the watershed. If the evaluation criteria are not being met, the \napproach for restoring Bear Creek watershed quality will be revised based on knowledge \nthat has been gained since 2007.  \n\n 36 \n \nThe draft watershed implementation plan will be submitted to the Implementation Team, \nand all others who submitted comments. Within two weeks of receiving the draft \nwatershed implementation plan, the Implementation Team will notify their stakeholders \nof the availability of the revised watershed implementation plan for stakeholder review. \nOne month will be allowed for review of the draft. Comments will be due at the end of \nthis review period. \n \nWithin a month after the comments on the draft watershed implementation plan are \nreceived, MDEQ will prepare a final watershed implementation plan. The final watershed \nimplementation plan will be submitted to the Implementation Team for review and \napproval. After the final watershed implementation plan has been approved, the \nImplementation Team will notify their stakeholders of the completion and availability of \nthe final plan for use as a guide to watershed restoration and protection activities. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 37 \nReferences \n \nDeLorme. 1998. Mississippi Atlas and Gazette. Yarmouth, Maine. \n \nFreedman, P.L., W.M. Larson, D.W. Dilks, D. Schechter, A. Nemura, T. Naperala, J.V. \nDePinto, M.G. Prothro, G. W. Boese, A. Dettelbach, L. Nothman, K. Thornton, D. Ford, \nP. Massirer, T. Soerens, K. B. Stevens, J.A.H. Sobrinho. 2003. Navigating the TMDL \nProcess: Evaluation and Improvements. 00-WSM-1. Water Environment Research \nFoundation. \n \nKlapproth, J.C., J.E. Johnson. 2000. Understanding the Science Behind Riparian Forest \nBuffers: Effects on Water Quality. Publication Number 420-151. Virginia Cooperative \nExtension. www.ext.vt.edu/pubs/forestry/420-151/420-151.html \n \nMDEQ 2004a. Mississippi 2002 Section 303(d) List of Water Bodies. Mississippi \nDepartment of Environmental Quality. Jackson, Mississippi. \n \nMDEQ. 2000. Yazoo Basin Status Report. Mississippi Department of Environmental \nQuality. Jackson, Mississippi. \n \nMDEQ. 2001. Mississippi’s Fish Tissue Advisories and Commercial Fishing Bans, \nAugust 2002. www.deq.state.ms.us/MDEQ.nsf/page/FS_Fish_Tissue?OpenDocument\n, \naccessed 7/15/04.  \n \nMDEQ. 2002. State of Mississippi Water Quality Criteria for Intrastate, Interstate and \nCoastal Waters. Mississippi Department of Environmental Quality. Jackson, Mississippi. \n \nMDEQ. 2003a. Phase 1 Total Maximum Daily Load for Organic Enrichment/Low DO \nand Nutrients; The Bear Creek Watershed Including Blue, Four Mile, Three Mile, Six \nMile, Wasp, Macon, Mossy, and Sky Lakes; Yazoo River Basin; Leflore, Humphreys, \nand Sunflower Counties, Mississippi. Mississippi Department of Environmental Quality. \nJackson, Mississippi. \n \nMDEQ. 2003b. Sediment TMDL for the Bear Creek Watershed, Yazoo River Basin. \nMississippi Department of Environmental Quality. Jackson, Mississippi. \n \nMDEQ. 2003c. Yazoo River Basin Compendium of Water Quality Information. \nMississippi Department of Environmental Quality. Jackson, Mississippi. \n \nMDEQ. 2003d. Total Maximum Daily Loads for the Legacy Pesticides DDT and \nToxaphene in the Yazoo River Basin. Mississippi Department of Environmental Quality. \nJackson, Mississippi. \n\n 38 \n \nMDEQ. 2004b. Watershed Prioritization, Targeting, and Implementation Planning in the \nYazoo River Basin. Mississippi Department of Environmental Quality. Jackson, \nMississippi. \n \nPennington, J.C., B.W. Bunch, C.E. Ruiz, D.L. Brandon, T.C. Sturgis, C.B. Price, J.M. \nBrannon. 1991. Water Quality Studies in the Upper Yazoo Project Area. Miscellaneous \nPaper EL-91-22. Waterways Experiment Station. Corps of Engineers. Vicksburg, \nMississippi. \n \nSCS (USDA Soil Conservation Service). 1978. Soil Survey of Hinds County, \nMississippi. \n \nSCS. Soil Survey of Humphreys County, Mississippi. \n \nSCS. Soil Survey of Sunflower County, Mississippi. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 39 \nAppendix \n \nAPPENDIX A – Stressors \n \nStatus Description \nStressor: \nJustification: \nLocation: \nExtent: \nSedimentation/Turbidity \nNonpoint source agricultural runoff due to erosion \nImpairment occurs in Mossy, Six Mile, Wasp, and Sky Lakes \nEntire watershed \nStressor: \nJustification: \nLocation: \nExtent: \nLow DO/Organic Enrichment \nNonpoint source agricultural runoff and/or failing septic systems \nImpairment occurs in Bear Creek, Blue, Mossy, Three Mile, and Wasp Lakes \nApproximately 52 miles of surface water \nStressor: \nJustification: \nLocation: \n \nExtent: \nHigh Nutrient Levels \nNonpoint source agricultural runoff \nImpairment occurs in Bear Creek, Blue, Four Mile, Mossy, Six Mile, Sky, Six \nMile, Three Mile, and Wasp Lakes \nApproximately 52 miles of surface water \nStressor: \nJustification: \nLocation: \nExtent: \nFish Advisories \nSoil persistence of legacy pesticides (DDT & Toxophene) \nAll water bodies containing gar, buffalo, carp, and catfish longer than 22” \nEntire watershed \nStressor: \nJustification: \nLocation: \n \nExtent: \nNoxious Aquatic Vegetation \nNatural dispersal and boat hull transfer \nImpairment occurs in Bear Creek and all oxbows connected by Bear Creek \nduring normal water level conditions. \nEntire watershed \nStressor: \nJustification: \nLocation: \nExtent: \nFisheries Management \nDecline of game fish populations \nAssociated oxbow lakes able to sustain fisheries during low water \nEntire watershed \nStressor: \nJustification: \nLocation: \nExtent: \nAccess to Public Waters  \nLack of sufficient public access to larger oxbow lakes in watershed \nAssociated oxbow lakes able to sustain fisheries during low water \nEntire watershed \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 40 \nAPPENDIX B – Checklist of WIP Elements \n \nRequired Watershed Elements Located Reference \n1a. Sediment/Siltation is the primary concern of both \nregulatory agencies and stakeholders.  Sediment, erosion, \nand all other contributors to sediment loading must be \nstopped through the used of BMPs.  Primary contributor is \nnon-point source agricultural runoff. \n1b. Low DO/Organic Enrichment.  Specific lakes and \nstream segments in the Bear Creek Watershed are listed for \nOrganic Enrichment although all the causes are not known.  \nMDEQ will continue to monitor Organic Enrichment and \nattempt to identify all causes before any action is taken. \n1c.  High Nutrients.  Specific lakes and stream segments in \nthe Bear Creek Watershed are listed for High Nutrients.  The \ncause is unknown.  However, ag BMPs should address most \nnutrient loading. \n1d.  Fish Advisories/Legacy Pesticides.  DDT can be found \nin fish tissue and soils within the watershed.  The only \ncourse of action is to further reduce sedimentation by using \nag BMPs. \n1e.  Noxious Aquatic Vegetation.  Alligator Weed threatens \nboth recreational access and water quality through organic \nenrichment and DO demand during the fall and winter.  \nAlligator Weed will be treated by a biological means and \nfunded by the USACE and MDWFP.   \n1f. Fisheries Management.  MDWFP will continue to \nmonitor the fishery and place more strict creel and/or slot \nlimits on pressured lakes in the watershed, as needed. \n1g. Lake Access.  Fishermen want additional access to the \nlake.   \nTable 1 \nRemove lakes and stream segments from 303(d) list Page 15 \nStructures for Water Control (100 units minimum) \nOverfall Pipes (40 units minimum) \nRiparian Buffers (100 acres minimum) \nGrass Filter Strips (included in riparian buffer estimate) \nGrass Waterways (25 acres minimum) \nStiff Grass Hedges (+100 sites) \nField Borders (40 acres) \nReforestation (1000 acres) \nWetland Construction (100 acres) \nHydrology Restoration (included in wetland construction \nestimate) \nLand Forming (1000 acres) \nBank Stabilization (as needed, minimum 25 sites) \nNo-Till (1000 acres) \nPage 16 \n\n 41 \nCover/Double Cropping (1000 acres) \n \nAg BMP $1,609,874.00 \nLow DO $850,000.00 \nNoxious Aquatics $96,000.00 \nFisheries Management $17,698.00 \nTOTAL $2,573,572.00 \nTables 5, 6, 7, 8 \nThe overall objective of the education strategy in the Bear \nCreek watershed is to develop an atmosphere that promotes \nsustained, long-term protection and improvement of aquatic \nresources in the watershed. \nPage 23 \nImplementation will be dependent on the cooperation of the \nprivate landowners. \nPage 16 \nThere are no current plans for water quality monitoring in \nBear Creek Watershed. \nPage 33 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n ",
  "metadata": {
    "id": "bear-creek-watershed-plan-2007",
    "originalName": "Bear_Creek_Watershed_Plan_2007.pdf",
    "size": 772752,
    "uploadedAt": "2025-10-03T00:47:30.014Z",
    "pageCount": 41,
    "info": {}
  }
}