{
  "id": "bell-creek-muddy-creek-watershed-plan-2012-3",
  "rawText": "\n\n \n BELL CREEK-WEST PRONG MUDDY \nCREEK WATERSHED IMPLEMENTATION \nPLAN \n \n \n \n \n \n \n \n \n \n\n \n2 \nBell Creek-West Prong Muddy Creek  \n Watershed Implementation Plan \n \n \n \nPrepared for: \n \nTennessee-Tombigbee River Basin Team \nMississippi Department of Environmental Quality \n \n \n \n \n \n \n \n \n \nDeveloped by:  \n \nBell Creek-West Prong Muddy Creek Watershed Implementation Team \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n \n \n \n \n \n\n \n3 \nTable of Contents \n \nI. Executive Summary          6 \n \nII. Vision Statement          8 \n \nIII. Mission Statement          8 \n \nIV. Watershed Implementation Team        9 \n \n V. Watershed Description         10 \n  \nVI. Stakeholder Interests         14 \n \nVII. Water Resources          15 \n     A.  History of Activity in the Watershed          15 \n     B. Wildlife and Fisheries           15 \n     C. Designated Use Classifications and Water Quality Standards    16 \n     D.  Current Status of Waterbodies in the Watershed     17 \n     E. TMDLs            17 \n \nVIII. Watershed Management Actions       18 \n       Agricultural Best Management Practices       \nA. Nutrient and Sediment BMPs       18 \n    1. Stakeholders Interests        18 \n    2. Goals/Objectives         18 \n    3. Management Actions        18 \n   4.  Project Tracking/Assessment of Progress      19 \n    5. Desired Results/Benefits        20 \n    6. Roles/Responsibilities        21 \n    7. Budget          21 \n \nIX. Education/Outreach Activities        22 \n       A. Educational Activities to be implemented      22 \n 1. Signage          22 \n     a. Indicators          22 \n     b. Schedule           23 \n     c. Budget          23 \n 2. Landowner Meeting and Field Days      23 \n     a. Indicators          23 \n     b. Schedule           23 \n     c. Budget          24 \n 3. Fact Sheets           24 \n     a. Indicators          24 \n     b. Schedule           24 \n     c. Budget          24 \n\n \n4 \n 4. Watershed Harmony Puppet Show       25 \n     a. Indicators          25 \n     b. Schedule           25 \n     c. Budget          25 \n 5. Tippah County Fair         25 \n     a. Indicators          25 \n     b. Schedule           26 \n     c. Budget          26 \n 6.\n Water Bill Mailers          26 \n     a. Indicators          26 \n     b. Schedule           26 \n     c. Budget          27 \n 7. Presentations         27 \n     a. Indicators          27 \n     b. Schedule           27 \n     c. Budget          27 \n 8. Radio Advertisements        28 \n      a. Indicators          28 \n     b. Schedule           28 \n     c. Budget          28 \n 9. Adopt-A-Stream         29 \n     a. Indicators          28 \n     b. Schedule           29 \n     c. Budget          29 \n10. Total Projected Cost of Education/Outreach Activities      29 \n 11. Total Budget for Bell Creek-West Prong Muddy Creek  \n     Watershed Implementation Plan       30 \n \nX. Evaluation           31 \n     A. Plan Evaluation Procedure        31 \n     B. Implementation Evaluation Strategy       31 \n 1. MSWCC          31 \n 2. MDEQ          32 \n \nXI. Plan Revision          32 \n    A. Plan Revision Procedure        32 \n \nXII. Resources          33 \n \nList of Figures \n \nFigure 5.1 Land use in Muddy Creek Watershed      11 \n \nFigure 5.2 Land Use in Bell Creek-West Prong Muddy Creek Watershed     12 \n \nFigure 5.3 Bell Creek-West Prong Muddy Creek Watershed    13 \n\n \n5 \nList of Tables \n \nTable 1.1 Bell Creek-West Prong Muddy Creek Management Action Plan        7 \n  \nTable 7.1 Water Quality Standards        16 \n \nTable 8.1 Funded 319 Project Budget for BMPs      21 \n \nTable 8.2 Technical Assistance        21 \n \nTable 9.1 Projected Costs for Signage       23 \n \nTable 9.2 Projected Costs for Landowner Meeting and Field Days     24 \n \nTable 9.3 Projected Costs for Fact Sheets       24 \n \nTable 9.4 Projected Costs for Watershed Harmony Puppet Show    25 \n \nTable 9.5 Projected Costs for Tippah County Fair      26 \n \nTable 9.6 Projected Costs for Water Bill Mailers      27 \n \nTable 9.7 Projected Costs for Presentations         27 \n \nTable 9.8 Projected Costs for Radio Advertisements      28 \n \nTable 9.9 Projected Costs for Adopt-A-Stream      29 \n       \nTable 9.10 Total Projected Education Budget      29 \n \nTable 9.11 Bell Creek-West Prong Muddy Creek Watershed   \n     Implementation Plan Total Budget       30 \n \n \n \nList of Appendices \n \nAppendix A- Plant and Animal Species of Special Concern \n \nAppendix B- Funded 319 Project Proposal \n \nAppendix C- Stressors \n \nAppendix D- Checklist of Watershed Implementation Elements \n\n \n6 \nI. EXECUTIVE SUMMARY \n \n Bell Creek-West Prong Muddy Creek Watershed was identified as a priority watershed \nby the Mississippi Department of Environmental Quality.  Muddy Creek has 2 Total Maximum \nDaily Load (TMDL) documents written to address reductions needed to meet water quality \nstandards, one for biological impairment due to Nutrients, and Low Dissolved Oxygen \n(DO)/Organic Enrichment and one for Fecal Coliform.  West Prong Muddy Creek is on the 2012 \n303(d) List of Impaired Waters for Biological Impairment.  The Mississippi Soil and Water \nConservation Commission, Tippah County Soil and Water Conservation District and USDA \nNatural Resources Conservation Service felt a great impact on water quality could be made in \nthis watershed. MSWCC submitted a proposal to apply best management practices to address the \nnutrient loading and sedimentation issue on agricultural lands because of nutrients attaching to \nsediment particles. That proposal was selected for funding by MDEQ and a contract was \nawarded to MSWCC.  Under that contract, MSWCC is required to assemble a Watershed \nImplementation Team to address other issues and concerns within the watershed and write a \nWatershed Implementation Plan.   \n The key natural resource problems in this watershed are nutrient loading and \nsedimentation.  The Watershed Implementation Plan has the goals of reducing the nutrients and \nsediment entering the streams and creeks in the watershed, and meeting TMDL load allocations \nin the Bell Creek-West Prong Muddy Creek Watershed.  To help solve this problem, one of the \nmanagement actions is to implement a 319 water quality project on the agricultural lands within \nthe watershed.  The targeted area for this project is the cropland and pastureland in Tippah \nCounty that lie within the watershed boundaries.  This is a three year project that began in 2011 \nand will end in September 2014.  The groups that will be implementing the management action \nof reducing the nutrient and sediment loading are the Tippah County Soil and Water \nConservation District, Natural Resources Conservation Service, and the Mississippi Soil and \nWater Conservation Commission.  The Tippah County Soil and Water Conservation District and \nthe Natural Resources Conservation Service can be contacted at 662-837-4464 ext. 3 for \ninformation and assistance about this management action.  \n \n\n \nTable 1.1 Bell Creek-West Prong Muddy Creek Watershed Canal Management Action Plan \n \n \n \n \n7 \nGoal Who What  Where When Contacts \nReduce nutrient and sediment   \nloading, achieve standards for Low \nDO/Organic enrichment ands \nnarrative standards for nutrient \nloading, and Fish and Wildlife \nSupport designated use  \nMSWCC,  \nUSDA NRCS, Tippah \nCounty Soil and Water \nConservation District \nContinue existing programs and projects \nrelated to farmer education, BMP \nimplementation, and habitat conservation \nEntire \nwatershed \n2012-2014 Mark Gilbert, MSWCC  \n601-354-7645 \nNRCS \n662-837-4464 ext. 3 \nTippah Co. SWCD \n662-837-4464 ext. 3 \nLocal Landowners and \noperators \nGrade Stabilization Structures \n Pasture and Hay Land Planting \n Water and Sediment Control Basins \nStreambank and Shoreline Protection \nCritical Area Planting \n  Heavy Use Area Protection \nNutrient Management \nStream Crossings \nTank/Trough \nDiversions \n  Fencing \n \n \nEntire \nWatershed \n2012-2014 Local landowners \n\n \n8 \nII. VISION STATEMENT \n \n The vision of the Bell Creek-West Prong Muddy Creek Watershed Implementation Team is to \nimprove and/or protect the quality of water in streams and creeks. \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \nIII. MISSION STATEMENT \n \n \nThe mission of the Bell Creek-West Prong Muddy Creek Watershed Implementation Team is to \neducate landowners on new and innovative best management practices, land use planning methods and \nimplementing the appropriate Best Management Practices that will result in the enhancement and \nconservation of all the natural resources in the watershed\n. \n \n \n \n \n \n \n\n \n9 \nIV. WATERSHED IMPLEMENTATION TEAM \n \nMembers of the Watershed Implementation Team for the Bell Creek-West Prong Muddy Creek \nWatershed include as follows: \n \nJoe Cross- Landowner \n \nTony McBride- Landowner \n \nDale Robertson- Muddy Creek Drainage District Commissioner/Landowner \n \nLarry Wilbanks- Tippah Co Soil and Water District Commissioner/Landowner \n \nTroy Shaw- Tippah Co Soil and Water Conservation District Commissioner \n \nNick Simmons- Tippah County Cooperative Extension Service (Extension) \n \nDanny Braddock- Tippah County Soil and Water Conservation District (SWCD) \n \nLiz Cockrell- Tippah County Soil and Water Conservation District (SWCD) \n \nMark Gilbert- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nPatrick Vowell- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nGail Spears- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nAndy Whittington- Mississippi Farm Bureau Federation (MFBF) \n \nDaniel Stuart- Mississippi Department of Environmental Quality (MDEQ) \n \nPaul Lowry- Natural Resources Conservation Service (NRCS) \n \nShane Stocks- United States Geological Survey (USGS) \n \nDr. John Ramirez-Avila- Mississippi State University (MSU) \n \nJanet Chapman- Mississippi Department of Environmental Quality (MDEQ) \n \n \n \n \n \n \n \n\n \n10 \nV. WATERSHED DESCRIPTION \n The Muddy Creek watershed is approximately 63,682 acres.  The land uses for the Muddy Creek \nWatershed include 12,692 acres of pastureland (19.9%), 24,982 acres of forestlands (39.2%), 7,724 \nacres of cropland (12.1%), and 18,284 acres of urban, wetlands and other (all together 28.7%).   Figure \n5.1 shows the land uses in the Muddy Creek watershed. The targeted area of this watershed is the Bell \nCreek-West Prong Muddy Creek Subwatershed (Figure 5.2).  \n Bell Creek-West Prong Muddy Creek is located in the northwestern portion of Tippah County, \nMississippi (Figure 5.3).  There are 19,277 acres located within the watershed boundaries.  This \nwatershed is located in a rural area with a population of about 2,380.  Therefore, people live throughout \nthe watershed.  The town of Falkner is located in this watershed.  Economic conditions that influence \nthis watershed include the loss of jobs due to industry closings and low timber prices.  There have been \nno significant changes in land use in this watershed in the last 20 years.   \n The soils associations in the watershed include Wilcox-Dulac-Falkner, Ruston-Cutbert-Ora and \nFalaya-Urbo-Waverly soils. The geology of the watershed is Ackerman Formation of the Eocene Epoch \nin the Cenozoic era.  Bell Creek-West Prong Muddy Creek watershed is located in the Northern Hilly \nGulf Coastal Plains and Flatwoods/Blackland Prairie Margins ecoregions.  The wetland areas in the \nwatershed are typically the areas that have backwater from the watershed structures.   \n Named water bodies in the watershed include Fourmile Branch, Bell Creek, West Prong and \nNorth Prong creeks.  The Holly Springs National Forest and Tippah Lake are the environmental \nmanagement areas located within this watershed.   \n  \n \n \n \n \n\n \n11 \n  \n \n \n \nFigure 5.1 Land Use in Muddy Creek Watershed. \n\n \n12 \n \nFigure 5.2 Land Use in Bell Creek-West Prong Muddy Watershed \n \n \n \n  \n\n \n13 \n \nFigure 5.3 Bell Creek-West Prong Muddy Creek Watershed. \n\n \n14 \nVI. STAKEHOLDER INTERESTS \n \n The stakeholders in this watershed want to conserve and preserve the soil, water, and wildlife \nhabitat.  Stakeholders in the watershed want to restore the watershed creeks and streams to a state of \ngood water quality.  This can be done by reducing runoff (stopping erosion and loss of topsoil) and \nimproving habitat for fish and wildlife. Stakeholders desire to use the natural resources wisely, eliminate \nsnags and debris, stop people from littering, and provide beaver control.  Also, there are issues where \npeople target practice from bridges endangering cattle and other livestock nearby.  The stakeholders \nbelieve all the interests are tied together.  The snags and debris are coming from two different issues.  \nStorm damage to woody areas cause log and brush debris to get into the streams.  Also, people toss \nhousehold trash and old appliances from bridges into the streams and creeks.  This debris causes large \nsnags that retard the flow causing flooding.  Once the flood waters recede the topsoil is washed away \ntaking nutrients and chemicals with it.  This helps increase the potential of starting head cuts and gullies \nwhile leaving debris in pastures and on cropland.  Therefore, the stakeholders think stopping the littering \nwould help resolve a lot of the snag and debris issues in the streams and creeks.  This would, in turn, \nhelp reduce the sediment and nutrients entering the streams.  A concern that has recently become a \nmajor concern is the landfill in the headwaters of the watershed.  It is the concern of the landowners that \nsediment and other contaminants will affect the water quality in the watershed.  The concern for beaver \ncontrol has always been an issue, but recently the beaver dams have started causing flooding of \ncroplands.  Due to this flooding, some of the farmers will lose parts of some fields that they farm.  \nLandowners want to make sure Best Management Practices are used to maintain and/or improve water \nquality while the Mississippi Department of Transportation four lanes Highway 15 through the \nwatershed.      \n   \n \n \n \n \n \n \n \n\n \n15 \nVII. Water Resources \n \nA. History of Activity in the Watershed \n \n The primary players in restoration and /or conservation efforts in the Bell Creek-West Prong \nMuddy Creek Watershed are the Natural Resources Conservation Service, Tippah County Soil and \nWater Conservation District and the Mississippi Soil and Water Conservation Commission.  Local \nlandowners and operators will play a major role in the restoration and conservation of the natural \nresources in this watershed by installing best management practices on their land.  There have been \nseveral programs that have been utilized by landowners in the watershed in past years.  These programs \ninclude Environmental Quality Incentive Program (EQIP), Conservation Reserve Program (CRP), \nEmergency Watershed Program (EWP), Hold Our Topsoil (HOT), a 319 demonstration project (1996-\n1998) and the Agricultural Conservation Program (ACP).  These programs have helped many \nlandowners apply conservation on the ground while reducing soil loss, enhancing wildlife habitat, \nenhancing water quality, increasing water quantity, increasing tree production and promoting \nconservation education.    \n The Bell Creek-West Prong Muddy Creek Watershed was selected as a priority watershed by the \nMississippi Department of Environmental Quality.  As the management agency for Agricultural \nNonpoint Source Pollution in Mississippi, the Mississippi Soil and Water Conservation Commission \n(MSWCC) determined that the Bell Creek-West Prong Muddy Creek Watershed would be a good \ncandidate for restoration.  After meetings with local landowners, Tippah County Soil and Water \nConservation District (SWCD) commissioners and staff and Natural Resources Conservation Service \n(NRCS) employees that work in this area, MSWCC felt there was enough interest in the watershed that a \nmeasurable difference could be shown, and submitted a proposal to the Mississippi Department of \nEnvironmental Quality (MDEQ).  Through a collaborative effort between Tippah County SWCD, \nNRCS, MDEQ and MSWCC, the team members for the Watershed Implementation Team were \nassembled.  At this point in time, there has been no process discussed to modify this team. \n  \nB. Wildlife and Fisheries \n There are important recreational species located throughout the watershed.  These species \ninclude deer, turkey, bass, catfish, bream, rabbits, squirrel, and raccoon.   The list of plants and animals \n\n \n16 \nof special concern are included as Appendix A.  There are no animals and plants that are threatened or \nendangered in this watershed. \n \n \nC. Designated Use Classifications and Water Quality                 \n     Standards \n \n \nThe designated beneficial uses for the Bell Creek and West Prong Muddy Creek and the \nwaterbodies included in the watershed are aquatic life support and secondary contact.  The water use \nclassification for the listed segments of Bell Creek and West Prong Muddy Creek is fish and wildlife \nsupport according to the 2002 Water Quality Criteria for Intrastate, Interstate and Coastal Waters.   \n \nTable 7.1 Water Quality Standards.\n \nParameter Beneficial Use Water Quality Standards \nFecal Coliform Secondary Contact May-October: Fecal coliform colony counts not to exceed a geometric \nmean of 200 per 100ml based on a minimum of 5 samples taken over a \n30-\nday period with no less than 12 hours between individual samples, nor \nshall the samples examined during a 30-day period exceed 400 per 100 \nml more than 10% of the time. \nNovember-April: Fecal coliform colony counts not to exceed a \ngeometric mean of 2,000 per 100ml based on a minimum of 5 samples \ntaken over a 30-day period with no less than 12 hours between individual \nsamples, nor shall the samples examined during a 30-day period exceed \n4,000 per 100 ml more than 10% of the time. \n \nParameter Beneficial Use Water Quality Standards \nDissolve Oxygen Aquatic Life Support DO concentrations shall be maintained at a daily average of not less than \n5.0mg/l with an instantaneous minimum of not less than 4.0mg/l.  \nNatural conditions are defined as background water quality conditions \ndue only to non-anthropogenic sources.  The criteria herein apply \nspecifically with regard to substances attributed to sources (discharges, \nnonpoint sources, or instream activities) as opposed to natural \nphenomena.  Waters may naturally have characteristics outside the limits \nestablished by these criteria.  Therefore, naturally occurring conditions \nthat fail to meet criteria should not be interpreted as violations of these \ncriteria. \n \nParameter Beneficial Use Narrative Water Quality Standards \nNutrients Aquatic Life Support Waters shall be free from materials attributable to municipal, industrial, \nagricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions, in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to \naquatic life and wildlife, or adversely affect the palatability of fish, \naesthetic quality, or impair the waters for any designated uses. \n\n \n17 \nD. Current Status of Water Bodies in the Watershed \n \n \nWaterbodies in the Muddy Creek watershed that have TMDLs written for them and require reductions \nto meet Water Quality Standards are as follows: \nMuddy Creek- Low DO/Organic Enrichment, and Nutrients, \nMuddy Creek-Fecal Coliform. \n  \nE. TMDLs \n \nThere have been two TMDLs developed for Muddy Creek, one for Fecal Coliform and the \nsecond for biological impairment due to Nutrients and Low DO/Organic Enrichment.   The Bell Creek-\nWest Prong Muddy Creek Watershed is located within the Muddy Creek Watershed and is located in \nTippah County, Mississippi.   The watershed ID number is 0601, and the Hydrologic Unit Code (HUC) \ncode for the watershed is 08010207.  \nA fecal coliform TMDL has been developed for an evaluated water body segment of Muddy \nCreek, MS206E, on the Mississippi 2002 Section 303(d) List of Impaired Water Bodies.  The segment \nwas originally listed for pathogens on anecdotal information.  No data were collected for this water \nbody.  MDEQ selected fecal coliform as an indicator organism for pathogenic bacteria for TMDL \ndevelopment.   \nMuddy Creek flows in a northern direction from its headwaters in central Tippah county across \nthe Tennessee state line to the confluence with the Hatchie River.  Although fecal coliform loadings \nfrom point and nonpoint sources in the watershed were not explicitly represented with a model, a source \nassessment was conducted for the Muddy Creek Watershed.  Nonpoint sources of fecal coliform include \nwildlife, livestock and urban development.  Also considered were the nonpoint sources such as failing \nseptic systems and other direct inputs to Muddy Creek.  The recommendation of the TMDL was an \neducational project that teaches best management practices for reducing nonpoint source pollution  be \nimplemented. \nThe recommended load reduction from the nutrients, low DO and organic enrichment TMDL \nincludes a 45 to 70% reduction of the nutrient loads entering Muddy Creek from nonpoint sources.   \n \n \n\n \n18 \nVIII. WATERSHED MANAGEMENT  \nACTIONS \n \nAgricultural Best Management Practices \n \nNutrient and Sediment BMPs  \n \n1. Stakeholder Interests \n \n \nThe major interests of the stakeholders are the nutrient and sediment loadings to Bell Creek and \nMuddy Creek in the watershed.  Sediment is an issue because nutrients attach to sediment particles.  \nNutrients are one of the reasons a TMDL was developed for this watershed.  \n \n2. Goals/Objectives \n \n The goal and objective is to reduce the nutrient and sediment loading coming from agricultural \nlands and bring the creeks back from unstable stream levels to stable stream levels.  By accomplishing \nthis task, the above named creeks could meet Water Quality Standards. \n \n3. Management Actions \n \n The management action that will be taken to address nutrient and sediment loading is the \ninstallation of agricultural BMPs that pertain to nutrients and sediment.  These BMPs include but are not \nlimited to:  \n• Streambank and Shoreline Protection,  \n• Grade Stabilization Structures,  \n• Pasture and Hay Land Planting,  \n• Nutrient Management, \n• Water and Sediment Control Basins,  \n• Fencing,  \n• Critical Area Planting, \n• Diversions, \n• Heavy Use Area Protection, and  \n• Tank/Troughs. \n\n \n19 \n  These BMPs will be installed by cooperating landowners in the watershed.  The program that \nthese BMPS will be installed under is the MSWCC cost-share program.  The Natural Resources \nConservation Service (NRCS) will provide the technical/planning assistance for this project.  Most of \nthe BMPs that will be installed are permanent structures and must be maintained by the landowner for a \nperiod of 10 years.  NRCS and Tippah County Soil and Water District employees identified landowners \nin the watershed that had agricultural land using maps provided by the Mississippi Department of \nEnvironmental Quality.   \n \n \n \n4. Project Tracking/Assessment of Progress \n \n \nThe Bell Creek- West Prong Muddy Creek 319 project began in 2011 and is scheduled to end \nSeptember 2014.  The milestones for the Bell Creek-West Prong Muddy Creek Watershed 319 project \nare listed below:  \n \n1. Assist Natural Resources Conservation Service (NRCS), United States Geological Survey \n(USGS), and the Tippah County Soil and Water Conservation District (SWCD), with \nassistance from Mississippi Department of Environmental Quality (MDEQ), in the \ndevelopment of a Watershed Implementation Team (WIT).  \n \n2. Develop a Watershed Implementation Plan (WIP) consistent with MDEQ guidance and         \nassistance from the WIT. \n \n3. Assist in the development and implementation of a watershed monitoring plan for the project.    \n \n4. Present a draft WIP to MDEQ and the Muddy Creek Watershed Implementation Team for review and \ncomments. \n \n5. Determine through intensive surveys, priority areas that are contributing significant pollutant \nloads in the watershed. \n \n6. Inform the public, landowners, and other stakeholders within the project area about the project \nand secure commitments from priority landowners and others willing to participate in the \nproject.  \n \n7. Notify MDEQ project officer, in a timely manner, of all project visits/ inspections/ field days/ \nand any other public meetings so that the project officer may have an opportunity to attend. \n \n8. Develop plans for Best Management Practices (BMPs) in accordance with approved WIP.  \n \n\n \n20 \n9. Assist landowners and operators in the installation of appropriate BMPs and collect       \nbefore and after soil loss and GPS coordinates each installed  BMP and incorporate into a GIS \nformat.   \n \n10. Establish at least two (2) demonstration farms to inform the public about BMPs. \n \n11. Provide a least two (2) informational field days/tours to inform the public about the     \nbenefits of the project. \n \n12. Develop and distribute no fewer than 1,000 informational fact sheets highlighting the      \nbenefits derived from the project.  \n \n13. Publish no fewer than 4 articles about the project in newsletters and local newspapers. \n \n14.  Erect no fewer than 20 project roadside signs where water quality practices are installed     \nin the project.  \n \n15.  Document pre-existing site conditions and improvements by conducting before and after     \nphoto documentation. \n \n16. Assist the MDEQ project officer in conducting inspections during construction. \n \n17. Make project presentations as requested by MDEQ. \n \n18. Secure maintenance agreements from cooperators/landowners in accordance with      \nMSWCC state cost-share guidelines.  \n \n19. Submit bi-annual reports by every September 25\nth\n and March 25\nth\n of each year showing    \nstatus of tasks and start/completion dates of each task. \n \n20. Submit a final report to MDEQ.                                                        \n \n \n5. Desired Results/Benefits \n \n The desired benefit of this project will be the reduction of nutrient loading to levels that are \nconsidered to be acceptable and remove the impaired segments of Muddy Creek from Mississippi’s \n303(d) list. \n \n \n \n\n \n21 \n6. Roles/Responsibilities \n \n There are several different groups with responsibilities in this watershed.  MSWCC has the \nresponsibility and role of administering the 319 project.  The Tippah County Soil and Water \nConservation District and the local NRCS staff have the role of technical assistance.  The landowners \nhave the responsibility of implementation of BMPs in the project area.  The Muddy Creek Watershed \nImplementation Team has the role of helping gather all the information needed to write the Watershed \nImplementation Plan.  MSWCC also has the responsibility of compiling all the information and writing \nthe initial plan for the watershed.  Other programs that are available to landowners in the watershed \ninclude EQIP, CRP, and WHIP.  Under these three programs, there has been $375,506.20 spent over the \nlast three years with another $150,000 projected to be spent over the next three years in Tippah County. \n \n7. Budget \n \nThe table below shows a list of potential Best Management Practices to be installed with the 319 \ngrant.   \n \nTable 8.1 Funded 319 Project Budget for BMPs. \nPractice Area Affected BMP Cost BMP Total \nStreambank and Shoreline Protection 2,500 feet $69.17/ft $172,904 \nGrade Stabilization Structure 12 structures $6,500 /ea $78,000 \nPasture and Hay Land Planting 100 acres $200/ac $20,000 \nWater and Sediment Control Basin 4 structures $10,000/ ea $40,000 \nNutrient Management 700 acres $103.80/ac $72,156 \nTank/Trough 5 each $2,500/ea $12,500 \nDiversions 1,200 feet $1.20/ft $1,440 \nHeavy Use Area Protection 4 each $2,500/ea $10,000 \nFencing 10,000 feet $1.30/ft $13,000 \nCritical Area Planting 100 acres $300/ac $30,000 \nTotal \n  \n$450,000 \n \n \nTable 8.2 Technical Assistance \nItem Cost \nTechnical Assistance $41,667 \nTotal $41,667 \n \n \n\n \n22 \nIX. EDUCATION/OUTREACH ACTIVITIES \n \nA. Educational Activities to be Implemented \n \n The overall objective of community education in the Bell Creek-West Prong Muddy Creek \nwatershed is to develop an atmosphere that promotes sustained, long-term protection and \nimprovement of aquatic resources in the watershed. Specific objectives of education efforts in the \nwatershed include the following: \n \n• Increase public awareness of the value of clean water. \n• Increase public awareness of agricultural runoff and encourage behaviors that will reduce \nlevels of nutrients and sediments in the watershed by education, watershed \ncharacterization and stewardship opportunities. \n• Increase public awareness of how BMPs can be used to reduce negative water quality and \nhabitat effects. \n• Increase public awareness of the long term environmental and economic advantages of \nprotecting and improving water quality and habitat in the Bell Creek-West Prong Muddy \nCreek watershed. \n \n \n \n1. Signage \nSigns identifying the BMPs that have been installed will be erected throughout the \nwatershed upon permission of landowners. \n \n \n  Primary partners- Mississippi Soil and Water Conservation Commission,  Mississippi \nDepartment of Environmental Quality, Tippah County Soil and Water Conservation District, \nNatural Resources Conservation Service, and Environmental Protection Agency. \n \n a. Indicators   \n  There will be field days held to show other landowners and the interested public the \nBMPs installed.  Participants will be counted at these field days.  Traffic through the watershed \ncannot be documented, but some areas are along a heavily traveled state highway.\n  \n\n \n23 \n b. Schedule \n  \nThe BMP signs will be erected as practices are completed and/or requested by the \nlandowners throughout the life of the project. \n \n c. Budget  \n \nTable 9.1 Projected Costs for Signage. \nItem Unit Cost Total Cost \nSigns 20 $100.00 $2,000.00 \nTotal   $2,000.00 \n \n2.   Landowner Meeting and Field Days \n There will be a landowner meeting held to inform landowners in the watershed about the project \nand what BMPs will be available for implementation on their land.  Also, there will be at least two \nfield days held to highlight the BMPs that have been installed during the project period.  This will \nallow other landowners and the interested public to view some of the practices that are being \ninstalled to benefit water quality in the watershed. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, Tippah County Soil and Water Conservation District, \nNatural Resources Conservation Service, and Environmental Protection Agency \n \n a. Indicators \n  \nAttendance at these field days will be documented and reported to MDEQ.  The number \nof individuals who install BMPs as a result of the field days will also be documented. \n b. Schedule \n  \nField days in the watershed will take place in 2012-2014. \n \n \n \n \n\n \n24 \n c. Budget \n \nTable 9.2 Projected Costs for Landowner Meeting and Field Days. \nItem Units Cost Total Cost \nEvent Flyers 300 .60/each $180.00 \nMailing/Delivery 300 .44/each $135.00 \nMiscellaneous (Landowner \nMeetings, Field Days, supplies) \n3 $2,240.67/each $6,722.01 \nTotal   $7,037.01 \n  \n \n3. Fact Sheets \n  A fact sheet will be developed at the end of the project.  This fact sheet will contain \ninformation about the watershed, the number and type of BMPs that were installed, the number of \ntons of soil being saved, and the number of acres impacted by the BMPs. \n \n Primary Partners- Mississippi Soil and Water Conservation Commission, Tippah County Soil \nand Water Conservation District, and Natural Resources Conservation Service. \n \n a. Indicators\n \n  1,000 fact sheets will be designed and distributed.  These fact sheets will be handed out at \nthe final field day and will also be available in the district offices.   \n b. Schedule \n  \nThe fact sheet will be developed once all BMPs are in place to get a total tons of soil \nsaved and the correct number of BMPs installed. \n c. Budget \n \nTable 9.3 Projected Costs for Fact Sheets. \nItem Unit Cost Total Cost \nPrinting 1,000 1.00/each $1,000.00 \nTotal   $1,000.00 \n \n\n \n25 \n4.  Watershed Harmony Puppet Show \n Watershed Harmony is a musical puppet performance aligning with the fourth and fifth grade \nMississippi Framework and National Science Standards.  Audiences of all ages will delight in \nenvironmental stewardship through this toe tapping musical.  Performances are not only enjoyed by \nschool groups, but also by adults attending teacher workshops, civic clubs, and conferences.  This \nprogram serves to inform, excite, and enlist the help of citizens in an ongoing effort to promote \nwater quality in their communities. \n \n Primary Partners- Mississippi Department of Environmental Quality and Bayou Town \nProductions. \n \n a. Indicators \n The number of participants will be documented and submitted to MDEQ.   \n b. Schedule \n  \nWatershed Harmony will be presented before August 2014. \n c. Budget \n \nTable 9.4 Projected Costs for Watershed Harmony Puppet Show \nItem Unit Cost Total Cost \nWatershed Harmony Puppet Show 1 show $1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n5. Tippah County Fair \n \nA booth will be set up at the fair with information about the project with pictures of BMPs within \nthe watershed and other educational materials about nonpoint source pollution and the Bell/Muddy \n319 project.  The booth will be set up for the entire fair with information available to the patrons of \nthe fair.  Coloring books and crayons will be given to the children on family night.  Also, Sam E Soil \nwill be making special appearances throughout the night on family night. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, and Tippah County Soil and Water Conservation District. \n \n a. Indicators \n  \nThe number of brochures that are handed out to adults will be documented.  The number \nof children who receive Sam E. Soil coloring books on family night will be documented.  \n\n \n26 \nb. Schedule \n  \nThe exhibit will be at the fair for 3 consecutive years. \n  \nc. Budget \n \nTable 9.5 Projected Costs for Fair Exhibit. \nItem Units Cost Total Cost \nBrochures 3,000 .65/each $1,950.00 \nColoring Books 6,000 .38/each $2,280.00 \nLitter Bags 2,500 .42/each $1,050.00 \nTotal   $5,280.00 \n \n \n6. Water Bill Mailers \n \nA flyer will be designed and mailed out to the homes in the Bell/Muddy watershed.  This flyer \nwill inform homeowners of ways they can help improve water quality in the watershed.  This will be \nmailed with their monthly water bill. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, and Tippah County Soil and Water Conservation District. \n \na. Indicators \nThe number of flyers sent out will be documented. \n \nb. Schedule \nThe flyers will be mailed before August 2014. \n \n \n \n \n \n \n\n \n27 \nc. Budget \nTable 9.6 Projected Costs for Water Bill Mailers. \nItem Units Cost Total Cost \nMailing 500 .44/each $225.00 \nEnvelopes 500 .10/each $50.00 \nFlyer 500 .65/each $325.00 \nTotal   $600.00 \n \n \n7. Presentations \n \nPresentations relating to water quality will be made to civic organizations.  These presentations \nwill inform individuals about ways they can improve water quality and nonpoint source pollution. \n \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, and Tippah County Soil and Water Conservation District. \na. Indicators \nThe number of people in attendance will be documented. \n \nb. Schedule \nThese presentations will be made before August 2014. \n \nc. Budget \nTable 9.7 Projected Budget for Presentations. \nItem Units Cost Total Cost \nMiscellaneous 3 $50.00/each $150.00 \nTotal   $150.00 \n \n \n \n \n\n \n28 \n8. Radio Advertisements \n \n \nRadio advertisements will be run on the local radio station to inform people about water quality \nand nonpoint source pollution.  Each spot will run 5 times a days for 2 weeks. \n \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, and Tippah County Soil and Water Conservation District. \n \na. Indicators \nThe number of radio ads run and produced will be recorded. \n \nb. Schedule \nThe ads will run before August 2014. \n \nc. Budget \nTable 9.8 Projected Costs for Radio Advertisements. \nItem \nUnits \nCost Total Cost \nAds 3 $200.00/each $600.00 \nTotal   $600.00 \n \n9.   Adopt-A-Stream \n Adopt-A-Stream is a program that promotes environmental stewardship through training \nworkshops, outdoor field activities, and by introducing participants to watershed action projects.  \nOne and two-day workshops inform participants about watershed topics such as stream health, \nstream ecology, aquatic life and water chemistry.  \n \n Primary Partners- Mississippi Department of Environmental Quality and Mississippi Wildlife \nFederation. \n a. Indicators \n  \nThe number of participants and the number of participants that carry on the adoption \nactivities will be documented. \n \n\n \n29 \n b. Schedule \n  \nAt least one event will take place before September 30, 2014.     \n \n c. Budget \n \nTable 9.9 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total \nCost \nAdopt A Stream \nWorkshop \n1 day workshop $1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n \n \n 10. Total Projected Cost of Education/Outreach Activities \n \nTable 9.10 Total Projected Education Budget  \nItem Unit Cost Total Cost \nSignage 20 $100.00 $2,000.00 \nLandowner Meeting and Field Days 3 $2,435.67 $7,037.01 \nFact Sheets 1,000 $1.00 $1,000.00 \nWatershed Harmony Puppet Show 1 $1000.00 $1,000.00 \nTippah County Fair 3 $1,760.00 $5,280.00 \nWater Bill Mailers 1 $600.00 $600.00 \nPresentations 3 $50.00 $150.00 \nRadio Ads 3 $200.00 $600.00 \nAdopt-A-Stream 1 $1,000.00 $1,000.00 \nTotal \n  \n$18,667.01 \n \n \n \n \n\n \n30 \n11. Total Budget for Bell Creek-West Prong Muddy Creek Watershed  \n Implementation Plan \n \n Table 9.11 Bell Creek-West Prong Muddy Creek Watershed Implementation Plan Total Budget \nItem Cost \nBMPs $450,000 \nTechnical Assistance $41,667 \nEducation/Outreach $18,667.01 \nTotal $510,334.01 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n31 \nX. EVALUATION \n \nA. Plan Evaluation Procedure \n \n \nThis watershed implementation plan will be evaluated and revised every three to five years or on \nan as needed basis.  The evaluation of this plan will be organized by the Muddy Creek Watershed \nImplementation Team.  At that time, the WIT will develop a detailed schedule for review and \nrevision of this watershed implementation plan. The WIT members will be responsible for notifying \ntheir stakeholders of the opportunity to propose changes to the watershed implementation plan. One \nmonth will be allowed for notification of stakeholders. \n The plan will be evaluated by the team, or their designee, and any interested stakeholders. One \nmonth will be allowed for evaluation and submittal of comments. Therefore, comments will be due \ntwo months after the evaluation procedure is initiated. The plan will be evaluated in two ways. First, \nto determine if the plan goals have been achieved, and second, to determine if it reflects the current \ncondition of the watershed, state of science, and issues in the watershed. \n \n \nB. Implementation Evaluation Strategy \n \n1. The following measures and indicators of progress will be utilized to track the              \nsuccess of this plan by MSWCC:  \n \n• Before and after photo documentation on a representative sample of the BMPs                    \n      installed, \n•    Before and after soil loss collection on each BMP installed, and \n•  An R5 Load estimation Model Field Data Entry Sheet completed on each BMP  \n       installed, \n• Establishment of two demonstration farms that will be used to inform the public  \n      about best management practice systems, and \n• Informational fact sheets will be distributed that highlight the benefits derived  \n      through the installation of Best Management Practices. \n \n \n\n \n32 \n 2.  MDEQ will be responsible for any monitoring at the conclusion of the project to \ndetermine the pollutant reductions achieved by the application of Best Management Practices in the \nwatershed.   \n \nXI. PLAN REVISION \n \nA. Plan Revision Procedure \n \n \n After evaluation, MDEQ will prepare a revised watershed implementation plan incorporating \nthe changes requested by the reviewers. At this point it may be necessary to call a meeting to \nreconcile any conflicting comments or requests for change.  \n If the evaluation criteria are all being met in Bell Creek-West Prong Muddy surface waters, the \nwatershed implementation plan will be revised to address a different restoration issue or issues, or to \nprotect the water quality of the watershed. If the evaluation criteria for the watershed are not being \nmet, the approach for restoring Bell Creek-West Prong Muddy watershed will be revised based on \nthe knowledge that has been gained since 2011.  \n The draft watershed implementation plan will be submitted to the Implementation Team, and all \nothers who submitted comments. Within two weeks of receiving the draft watershed implementation \nplan, the Implementation Team will notify their stakeholders of the availability of the revised \nwatershed implementation plan for stakeholder review. One month will be allowed for review of the \ndraft. Comments will be due at the end of this review period. \n Within a month after the comments on the draft watershed implementation plan are received, the \nDRAFT watershed implementation plan will be submitted to the Implementation Team for review \nand approval. After the DRAFT watershed implementation plan has been approved, the \nImplementation Team will notify their stakeholders of the completion and availability of the plan for \nuse as a guide to watershed restoration and protection activities. \n \n \n\n \n33 \nXII. RESOURCES \n \nMDEQ 2005. Phase One Fecal Coliform TMDL for Muddy Creek. North Independent Streams \nBasin Tippah County, Mississippi.  Mississippi Department of Environmental Quality. Jackson, \nMississippi. \n \nMDEQ 2006.  Total Maximum Daily Load Biological Impairment Due to Organic Enrichment/Low \nDO and Nutrients Muddy Creek, North Independent Basin Mississippi Department of Environmental \nQuality. Jackson, Mississippi. \n \n\"Natural Heritage Inventory: Search Animal Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_animals.asp\n> \n \n\"Natural Heritage Inventory: Search Plant Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_plants.asp> \n  \nUSDA. SCS. 1966. Soil Survey of Tippah County, Mississippi. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n34 \n \n \n \n \nAppendix A \n \n \n \nPlant and Animal Species of Special \nConcern \n \n \n \n \n\n \n35 \n \n \n \n \nAnimals of Special Concern in Tippah County \nScientific Name Common Name \nCYPRINELLA WHIPPLEI STEELCOLOR SHINER \nNOTURUS STIGMOSUS NORTHERN MADTOM \nPROCAMBARUS ABLUSUS A CRAYFISH \n \n \n \nPlant Species of Special Concern in Tippah County \nScientific Name Common Name \nCHELONE GLABRA WHITE TURTLEHEAD \nADIANTUM CAPILLUSVENERIS SOUTHERN MAIDENHAIR-FERN \nPLATANTHERA PERAMOENA PURPLE FRINGELESS ORCHID \nAGALINIS PSEUDAPHYLIA SHINERS’ FALSE-FOXGLOVE \nSILENE OVATA OVATE CATCHFLY \nASARUM CANADENSE CANADA WILD-GINGER \nASPELENIUM RHIZOPHYLLUM WALKING-FERN SPLEENWORT \nATHYRIUM PYCNOCARPON GLADE FERN \nCAREX PICTA PAINTED SEDGE \nCYPRIPEDIUM PUBESCENS YELLOW LADY’S-SLIPPER \nGOODYERA PUBESCENS DOWNY RATTLESNAKE-PLANTAIN \nHYBANTHUS CONCOLOR GREEN VIOLET \nJUGLANS CINEREA WHITE WALNUT \nLIGUSTICUM CANADENSE NONDO LOVAGE \nORCHIS SPECTABILIS SHOWY ORCHID \n\n \n36 \nPANAX QUINQUEFOLIUS AMERICAN GINSENG \nPHILADELPHUS INODORUS ODORLESS MOCK-ORANGE \nTRIOSTEUM ANGUSTIFOLIUM NARROW-LEAF FEVER ROOT \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAppendix B \n \n \n \nFunded 319 Project Proposal \n \n \n \n\n \n37 \n \n \n \nPROJECT TITLE: \nBell Creek- West Prong Muddy Creek Watershed Nonpoint Source Pollution Project \n \nPROJECT ABSTRACT: \nThis project will be located in the north central portion of Tippah County in Mississippi. \nThe objectives of this project will be: \n \nTo improve water quality and protect high quality waters through the implementation of selected \nBMPs in targeted areas. \n \nTo apply Best Management Practices (BMPs) to agricultural lands in the project area so as to \nreach the desired outcome of reduced nutrient loads entering streams in the watershed. \n \nTo inform and educate the public about Best Management Practices that benefit water quality. \n \nThe project cost is $508,333.   Of this amount, $305,000 in 319 funds are requested with the balance of \n$203,333 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nMark Gilbert, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES AND ORGANIZATIONS: \n \nTippah County Soil and Water Conservation District; USDA Natural Resources Conservation Service; \nMississippi Department of Environmental Quality \n \n\n \n38 \nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone: (601) 354-7645 \n (601) 540-4210  (cell) \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nMuddy Creek Watershed (08010207-0601) \n(see attachment 1 for a maps depicting the location and land use for the watershed) \n \nPROJECT OBJECTIVE: \n \nThe water quality impairment to be addressed by this project is nutrient loading.  A Stressor \nIdentification Report was developed due to Muddy Creeks failure to meet minimum water quality \ncriteria for biological use support based on biological sampling conducted in 2001.  The Stressor \nIdentification report indicated the biological impairment most likely being due to organic \nenrichment/low dissolved oxygen and nutrients.  The designated beneficial use for Muddy Creek is fish \nand wildlife support.  Therefore, due to Muddy Creek not meeting the water quality standards, a TMDL \nhas been developed.  The TMDL recommends a 45 to 70% reduction in the amount of nutrients from \nnonpoint sources entering Muddy Creek to attain the preliminary target range of 0.6mg/l to 0.11mg/l.  (a \ncopy of the TMDL is attached)   \nAnother objective of this project will be to reduce soil loss on pasture land in the watershed.  BMPs \nlisted on the following page will not only reduce nutrients and pathogens but will also reduce the \namount of sediment entering Muddy Creek from pasture land in the watershed. \n \nPROJECT DESCRIPTION: \n \nThis project will implement selected Best Management Practices (BMPs) on targeted areas in the \nMuddy Creek Watershed that will result in reduced pollutant loadings from agricultural nonpoint \nsources. The targeted area within this watershed will be an area in the Bell Creek-West Prong Muddy \nCreek Watershed.  The main water quality problem to be addressed by this project is nutrients from \nagricultural nonpoint sources.  Of primary concern are animal waste runoff and the animal access to \nstreams from cattle operations in the watershed. Also, soils in the watershed are very erosive, with sheet \nand gully erosion occurring on sloping hay land and pastureland. Erosion is occurring from pasture and \nhay land in the project area at the rate of 8-10 tons per acre per year.  Nutrients and pathogens from \nanimal waste as well as sediment contained in runoff is entering Muddy Creek and its tributaries causing \ndegradation of the resource base.    \n\n \n39 \nThe erosion of the soil resource base removes nutrients, reduces water holding capacity, undermines \nplant rooting systems, reduces the soil’s organic matter content, reduces soil tilth and degrades water \nquality within the project area.   \nThe Muddy Creek Watershed is approximately 63,682 acres.  The watershed is predominately rural. The \ncurrent land uses in the Muddy Creek Watershed include 7,724 acres of cropland, 12,692 acres of \npasture land, 24,982 acres of timber land, 3,974 acres of urban land, 10,097 aces of barren land, 3,362 \nacres of wetlands and 851 acres of water.  This project will target an area in the Bell Creek-West Prong \nMuddy Creek Subwatershed which is approximately 3,940 acres within the watershed that contains \nabout 2,167 acres of pasture land.  The  Bell Creek-West Prong Muddy Creek Subwatershed is an \n19,277 acre subwatershed. \n  \nThis project will be implemented in three phases.  Phase 1 will consist of analyzing existing \nassessment data, determining target areas within the watershed where the stressors are causing the \ngreatest damage and if the application of needed Best Management Practices will yield a beneficial \nreduction in pollutant loadings.  Education and outreach activities will also be conducted during this \nphase to inform landowners in the watershed about the objectives of the project. The Mississippi Soil \nand Water Conservation Commission (MSWCC) will cooperate with the Tippah County Soil and Water \nConservation Districts in identifying the appropriate Best Management Practices for targeted areas in the \nwatershed and educating landowners as to the need for their participation. \n \nPhase 2 will consist of (based upon the finding of phase 1) the application of best management practices \non targeted areas in the watershed that will result in desired pollutant load reductions.  The Mississippi \nSoil and Water Conservation Commission will accomplish this through its water quality cost share \nprogram. In this project, records will be kept at both the state level and local level so as to determine the \nprogress being made in carrying the project out and the benefits that are being received as related to the \nimprovement of water quality within the project.  During the planning process with participants, the \namount of soil loss from the area to be treated with a particular BMP will be determined and recorded.  \nThe amount of soil saved as a result of applying the BMP will also be determined and recorded.  \nAdditional information will be collected on each BMP installed in the project that will be provided to \nMDEQ and used to calculate the pollutant load reduction for each BMP installed.  This information will \nindicate the project effectiveness in reducing pollutant loadings.  Participants in the project will be \nrequired to maintain BMPs for a period of up to ten years after installation. \n \nAdditional education and outreach efforts will be conducting during this phase to inform and educate the \npublic about Best Management Practices that benefit water quality.  This will be accomplished by the \nfollowing: \nEstablish at least 2 demonstration farms to inform the public about best management systems. \nConduct at least 2 field day/tours during the life of the project. \nPrepare and distribute at least 1,000 fact sheets highlighting the benefits derived from the project. \nPublish at least 4 articles about the project in newsletters and local newspapers. \nErect at least 20 project roadside signs that designate where water quality practices are in progress or \nhave been completed. \n \n \n\n \n40 \nTo address the above stated water quality problems, Best Management Practices (BMPs) will be \ninstalled on agricultural lands in the project area.  Potential BMPs to be installed include but are not \nlimited to: \n \n12 grade stabilization structures \n100 acres of Pasture & Hay land Planting \n4 Water and Sediment Control Basins \n700 acres of Nutrient Management \n5 Tank/Troughs \n2,500 feet Streambank and Shoreline protection \n4 Heavy Use Area Protection \n100 acres Critical Area Planting \n1,200 feet of Diversions \n10,000 feet of Fencing \n \n \nPhase 3 will consist of post BMP monitoring to determine the pollutant load reductions achieved by the \napplication of Best Management Practices.  The MSWCC will coordinate with the MDEQ in conducting \nthese activities. \n \n  \n\n \n41 \nMILESTONES: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n2. Determine priority areas that are contributing significant loads in the watershed.  (Month 1) \n3. Issue policies and procedures for implementing the project to the SWCD office. (Month 1) \n4. Meet with the board of SWCD commissioners to get their understanding of their responsibilities \nand participation. (Month 2) \n5. Provide training to district staff. (Month 2-3) \n6. Assist in establishing an evaluation system in conjunction with the MS Department of \nEnvironmental Quality to indicate the benefits of the project. (Month 2-3) \n7. Conduct a landowner meeting to inform potential participants about the project.     (Month 3) \n8. Secure commitments from several landowners and operators who are willing to participate in the \nproject. (Month 3-4) \n9. Assist participants in developing a conservation plan and applying best management practices \n(Month 4-12) \n10. Establish at least demonstration farm (Month 4-12) \n11. Document pre-existing site conditions. (Month 2-12) (Before and after photo documentation will \nbe conducted). \n12. Accelerate conservation planning and application assistance.  Special effort will be made to \ncomplete conservation plans during this time frame. (Month 13-24) \n13. Conduct at least 1 informational field day/tour to inform the public about the project. (Month 13-\n24) \n14. Establish at least 1 demonstration farm. (Month 13-24) \n15. As requested, assist DEQ with evaluations. (Month 0-36) \n16. Collect GPS coordinates and other data required by MDEQ on all BMPs installed in the project. \n(Month 0-36) \n17. Assemble data on the amount of soil saved. (Month 0-36) \n18. Erect project roadside signs which designate where water quality practices are in progress or \nhave been completed. (Month 4-36) \n19. Provide continued conservation planning and application assistance to participants. (Month 25-\n36) \n20. Review the status of applying best management practices to reach the objectives of the project.  \n(Month 25) \n21. Based upon the needs and finding of milestone 18, assistance in planning and/or application will \nbe redirected and/or accelerated. (Month 25-36) \n22. Publish at least 4 articles about the project. (Month 0-36) \n23. Publicity of the project will be increased; at least 1 field day/tour will be conducted and at least \n1,000 fact sheets will be developed and distributed. (Month 25-36) \n24. Bi-annual reports will be made to MSDEQ. (Month 0-36) \n25. Make Final report to MSDEQ. (Month 36) \n  \n\n \n42 \nCRITERIA FOR EVALUATION \n(also see Phase 1 and 3 information under Project Description) \nThe following measures and indicators of progress will be utilized to track the success of this project: \n \nNPS Pollutant Load Reduction – the amount of soil saved as a result of the installation of best \nmanagement practices (BMPs) in this project will be a direct indicator of sediment load reduction to \nMuddy Creek along with its tributaries.  Since nutrients and animal waste are transported to the waters \nby over land flow along with sediment, any reduction in sediment loadings will result in a reduction of \nnutrient loadings thereby enhancing the effectiveness and success of the project.  Other data collected \nfor MDEQ will be used to calculate pollutant load reductions for each BMP installed in the project. \n \nImplementation of NPS Controls – this project will involve the installation of Best Management \nSystems.  Best Management Systems are defined as a combination of BMPs, both structural and \nvegetative, which are the most practical, effective and economical means of preventing or reducing \npollution from nonpoint sources to a level compatible with water quality goals.  The estimated types \nand numbers of BMPs to be installed as part of Best Management Systems are listed in the project \ndescription of this proposal.  The application of best management systems in the project will be the \nresponsibility of the landowners and operators participating in the project as cooperators of the local soil \nand water conservation district. \n \nPublic Education, Awareness, and Action - this project will include the establishment of at least 2 \ndemonstration farms that will be used to inform the public about best management systems.  These will \nbe utilized during the 2 field day/tours that will be conducted in the project.  Also, at least 1,000 \ninformational fact sheets highlighting the benefits derived from the project will be developed and \ndistributed as well as the publishing of at least 4 articles about the project in newsletters and local \nnewspapers.  At least 20 project roadside sign will be erected where water quality practices are installed \nin the project.    Other educational actions will be conducted to measure the success of the project.  \nThese include such things as increased public awareness; before and after photo documentation; \nincreased cooperation among agencies, associations, public bodies and educational institutions; and the \neconomic benefits of applying best management practices.  The Mississippi Soil and Water \nConservation Commission will request information through the local soil and water conservation district \nthat will assist in measuring the success of the project in the demonstration area. \n \nMONITORING \n \nAt a selected site or sites on the main tributaries of the watershed, water samples will be taken and \nanalyzed for organic enrichment/low dissolved oxygen and nutrient content.  After BMPs are installed at \nthe site or sites, additional samples will be taken and analyzed to determine the actual load reduction \nresulting from the implementation of the BMPs.  A plan for the monitoring will be developed by the \nUSGS to determine the exact procedures and details of the monitoring regime.  Funding for this portion \nof the project is included in the project budget. \n \n \nPROJECT PERIOD \n \nThe length of this project will be 3 years. \n\n \n43 \nPROJECT BUDGET \n \nBUDGET   FEDERAL NON-FEDERAL   TOTAL \nCATEGORY   FUNDS FUNDS \n \nTechnical Assistance/  $   25,000 $    16,667 *    $   41,667 \nTravel \n \nInstallation of BMPs    $ 170,000 $ 113,333 **    $ 283,333 \n \nContractual   $ 100,000 $    66,667  **    $ 166,667 \n \nInformation/Education $   10,000 $     6,667 *      $   16,667___ \n \nTOTAL   $ 305,000 $ 203,334    $ 508,333  \n \n*   Non-federal match for technical assistance/travel and information/education will be provided the \nlocal soil and water conservation district commissioners, soil and water conservation district staff and \nMississippi Soil and Water Conservation Commission staff time spent on the project. \n \n** Non-federal match for installation of BMPs and contractual will be provided by out of pocket \nexpenses of the landowners and operators participating in the project. \n\n \n44 \nAttachment 1 \n \n \n\n \n45 \n\n \n46 \n\n \n47 \n \n\n \n48 \n \n\n \n49 \n \n \n \n \n \n \n \nAppendix C \n \n \n \nStressors \n \n\n \n50 \nTable 2 \nStressor Summary Table \n \nConcern Link/Immediate \nCause \nStressor Description of \nStressor \nLocation/Extent \nSediment Loading \nFrom Agricultural \nLands \nLanduse runoff and \n in-channel sediment processes \nSediment A stressor identification study was \ncompleted for Muddy Creek Watershed.  \nThis analysis identified sediment as the \na probable stressor of the water body.  \nCertain contaminants may be associated \nwith sediment such as pesticides and \nnutrients.  However, these contaminants \nwould also be controlled by the same \nbest management practices (BMPs) that \ncontrol sediment coming from fields. \nSee figure 5.2 for the locations of \ncropland along streams. \nThere are approximately 20,416 \nacres of agriculture land in the \nwatershed.  The majority of this \nland is pastureland. \nAll the lands referred to above are \nin HUC 08010207. \n  \n \n \n \nConcern Link/Immediate \nCause \nStressor Description of Stressor Location/Extent \nLittering Increasing the number of snags \nand the amount of debris in the \ncreeks and streams \nLitter People dumping old appliances, old \nshingles and tires, household trash, old \nmattresses and other garbage into the \ncreeks and streams from bridges and \nletting it wash down the creeks and \nstreams when the flow is increased. \nThis occurs throughout the \nwatershed at most bridge sites in \nrural areas. \n \n\n \n51 \nConcern Link/Immediate \nCause \nStressor Description of Stressor Location/Extent \nNutrient Loading \nFrom Agricultural \nLands \nDegradation of in-stream \nbiological conditions \nNutrients A stressor identification study was \ncompleted for Muddy Creek Watershed.  \nThis analysis identified nutrients and \norganic enrichment as the most \nprobable primary stressor of the water \nbody.  Certain contaminants may be \nassociated with sediment such as \npesticides and sediment.  However, \nthese contaminants would also be \ncontrolled by the same best \nmanagement practices (BMPs) that \ncontrol nutrients coming from fields. \nSee figure 5.2 for the locations of \ncropland along streams. \nThere are approximately 20,416 \nacres of agriculture land in the \nwatershed.  The majority of this \nland is pastureland. \nAll the lands referred to above are \nin HUC 08010207. \n \n \nConcern Link/Immediate \nCause \nStressor Description of Stressor Location/Extent \nBeavers Increased  number of beaver dams \nin the creeks and streams \nBeavers Beaver dams causing flooding issues on \nlands within the watershed.  Valuable \ntopsoil is lost to erosion.  Nutrients and \nchemicals are washed into the streams \nand creeks.  Production of valuable \npastureland and cropland is lost. \nThis occurs throughout the \nwatershed in rural areas. \n\n \n52 \n \n \n \n \nAppendix D \n \n \n \n \n \n \n \n \n \nChecklist of Watershed \nImplementation Elements \n\n \n53 \n \nTable D. 9 Key Elements of a Watershed Plan for 319 Grant  \n \nRequired WIP Elements for 319 Grant \n \nLocation in Watershed Implementation Plan \n \n1. Watershed Description and Background \n \nChapter V, Chapter VII Section A \n \n2.  Implementation \n \nChapter VIII Section A Subsection 3 \n \n3. Project Goals \n \nChapter VIII Section A Subsections 2 and 5 \n \n4. Project Costs \nChapter VIII Section A Subsection 7 \nChapter IX Section A Subsection 7, 8 \n \n5. Education and Outreach \n \nChapter IX \n \n6. Implementation Schedule \n \nChapter VIII Section A Subsection 4 \n \n7. Milestones \n \nChapter VIII Section A Subsection 4 \n \n8. Adaptations and Revisions \n \nChapter X Section A, Chapter XI Section A \n \n9. Monitoring \n \nChapter X Section B Subsections 1 and 2 \n ",
  "metadata": {
    "id": "bell-creek-muddy-creek-watershed-plan-2012-3",
    "originalName": "Bell_Creek_Muddy_Creek_Watershed_Plan_2012.pdf",
    "size": 1884161,
    "uploadedAt": "2025-10-06T00:32:08.827Z",
    "pageCount": 53,
    "info": {}
  }
}