{
  "id": "dry-creek-9-key-element-plan-2017-4",
  "rawText": "\n\nDry Creek Watershed Plan GY 2016 \n1 \n \nDry Creek Watershed Plan \n9 Key Elements \nHUC 03170040603 \nMWS 4111 \nGY16 Proposed Project Area \nMay 08, 2017 – Revision 02 \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Dry Creek watershed is located in Covington County and covers 13,224 acres.  This \nwatershed contains many landuse types including agricultural land, pastureland, and forest areas; \nhowever, the dominant landuses identified in the 2011 National Land Cover Database (NLCD) \nwithin the watershed are forest (55.7%) and pasture/grass (31.7%) (Figure 1). \n \nIn order to make water quality assessments on wadeable streams outside of the Mississippi \nAlluvial Plain, MDEQ uses a calibrated and verified index of biological integrity (IBI) referred \nto as the Mississippi Benthic Index of Stream Quality (M-BISQ).   Using biological community \ndata and comparing it to the attainment thresholds from the M-BISQ, Dry Creek was assessed as \nimpaired (segment ID MS082E) and was placed on the Mississippi 2002 Section 303(d) List of \nWater Bodies for biological impairment.  MDEQ has a strong team of scientists and engineers \nfocused on evaluating water quality data and identifying stressors in water bodies that have been \nlisted as being biologically impaired using benthic macroinvertebrate community data.  If \nbiological community data indicate that a water body segment is impaired, an investigative, \nstressor identification analysis using a strength-of-evidence approach is conducted to determine \nthe cause(s) of the impairment.  Such causes may range from specific pollutants (e.g. Total \nNitrogen) to other causes of pollution such as sedimentation, habitat loss or hydrologic \nalteration.  In most cases, nonpoint sources contribute, or are the primary causes of impairment.  \nMDEQ relies upon all available monitoring and assessment data and conducts additional \nmonitoring to gather the necessary data and information to help determine both the causes and \nsources of impaired waters.  The U.S. Environmental Protection Agency (EPA) Stressor \nIdentification Process and Stressor Identification Guidance Document (USEPA, 2000), is used \nto identify most probable stressors causing biological impairment to provide the information \nnecessary to develop required TMDLs that will guide restoration activities.  A stressor \nidentification study was completed on Dry Creek.  Sediment was identified as the most likely \ncause of the impairment and a sediment TMDL was developed.   \n  \n\nDry Creek Watershed Plan GY 2016 \n2 \n \n \nFigure 1: Dry Creek Watershed Landuse Map, 2011 NLCD \n  \n\nDry Creek Watershed Plan GY 2016 \n3 \n \n \nThere are no facilities in the Dry Creek watershed with NPDES permits that include limits for \nTotal Suspended Solids (TSS) which is used as an indicator of sediment contributions from \npermitted activities. The pollutant of concern for the Dry Creek TMDL is sediment from land-\nuse runoff and in-channel processes and the TMDL was developed for clean sediment. Certain \ncontaminants may be associated with sediment such as pesticides and nutrients. These \ncontaminants were not addressed directly within this TMDL. However, these contaminants \nwould also be controlled by the same best management practices (BMPs) that control the \nsediment from nonpoint sources of pollution.  The target for the TMDL was based on reference \nsediment yields developed by the Channel and Watershed Processes Research Unit (CWPRU) at \nthe National Sedimentation Laboratory (NSL).  Based on the ranges of stable and unstable yield \nvalues, a reduction in sediment of 55% to 66% is recommended in the Dry Creek watershed. \n \nNonpoint loading of sediment in a water body results from the transport of material into \nreceiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion.  Sources of sediment include: Agriculture, Silviculture, Rangeland, Construction sites, \nRoads, Urban areas, Mass wasting areas, Gullies, Surface mining, in-channel and instream \nsources, Historical landuse activities and channel alterations.   \n \nThe most recent landuse data (NLCD 2011) attributes the landuse in the Dry Creek Watershed to \nbe predominantly forest at 55.7%.  Since 2011, much of the forest in this watershed was \nharvested and the land has been converted to pasture to support grazing operations. Figure 2 \nshows aerial imagery depicting the change in forest coverage from 2010 to 2014.  It is estimated \nthat more than 1,400 acres have been converted from forest to pasture.  Because of this recent \nlanduse change, the BMPs installed in this project will focus on managing these newly converted \npastures to mitigate the potential of increased sedimentation.  Examples of potential BMPs \ninclude: fencing, watering facilities, heavy use areas, stream crossings, ponds, forage and \nbiomass planting, establishment of permanent vegetation, sediment basins, and nutrient \nmanagement practices.   \n \nElement b: Expected Load Reduction \n \nThe sediment TMDL for Dry Creek (MS082E) concluded that sediment yields would need to be \nreduced by 55%-66% in the watershed in order to reflect stable conditions.  The NRCS has a list \nof approved BMPs to address sedimentation and this list will be used to identify candidate BMPs \nin Dry Creek.   \n \n  \n\nDry Creek Watershed Plan GY 2016 \n4 \n \n \nFigure 2: Landuse Change in Dry Creek Watershed from 2010 to 2014  \n\nDry Creek Watershed Plan GY 2016 \n5 \n \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Association of Conservation Districts \n(MACD), the Mississippi Soil and Water Conservation Commission (MSWCC), the Natural \nResource Conservation Service (NRCS), and the local Soil and Water Conservation Districts \n(SWCDs) throughout the state.  These SWCDs are typically housed within USDA Service \nCenters co-located with NRCS offices.  These USDA Service Centers handle federal assistance \nprograms offered through the Farm Bill.  As part of these services, SWCD staff communicate \nregularly with the local landowners and operators within the watershed as they work to support \nsign-ups for Farm Bill initiatives   Staff from MSWCC and the SWCD depend upon assistance \nfrom their NRCS partners in determining landowner interest in the watershed because they are \non the farms and in the fields with the landowners, understand the needs at the local level, and \nhave knowledge of the amount of unfunded applications for federal program assistance which \nmeet Section 319 eligibility requirements.  Based on their analysis, installation of the following \nBMPs would mitigate sediment issues in the Dry Creek watershed helping the stream recover: \nfencing, watering facilities, heavy use areas, stream crossings, ponds, sediment basins, \nestablishment of permanent vegetation, forage and biomass planting, and nutrient management \npractices (lime and fertilizer).  As stated above in Element a, much of the forest has recently \nbeen converted to pasture in this watershed.  As such, BMPs will be prioritized for \nimplementation in the newly converted pasture areas.  Factors considered for determining \nspecific locations for the placement of BMPs included the following attributes based upon best \nprofessional judgement: \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDL (i.e., “It is recommended that \nwater bodies within [the watershed] be considered a priority for streambank and \nriparian buffer zone restoration and any sediment reduction BMPs, especially for road \ncrossings, agricultural activities, and construction activities); \n4. Ease of showing effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the grant period); \n \nUpon receipt of funding, MDEQ will coordinate with Project Management staff to target \nimplementation on recently converted land and then move to other pasture areas.  A map \ndepicting the landuse change from 2010 (the basis for the 2011 NLCD landuse calculations) to \n2014 can be found in Figure 2.  It can be seen that a large portion of forest was harvested and is \nbeing used as pasture for grazing purposes.  Additional considerations for prioritization of BMPs \nincluded the positioning of BMPs with willing landowners; the increased likelihood for \nleveraging of in-kind services; and proximity to pollutant sources to Dry Creek.  The priority \nareas for BMP implementation are shown in Figure 3.  \n \n  \n\nDry Creek Watershed Plan GY 2016 \n6 \n \n \nFigure 3: Dry Creek Watershed Priority Areas for BMP Implementation   \n\nDry Creek Watershed Plan GY 2016 \n7 \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project that may contribute match include MACD, MSWCC, Covington County \nSoil and Water Conservation District, NRCS, USGS (monitoring), and/or local landowners.  For \nproject implementation, administration, management, and watershed plan revision, as well as \nhosting and facilitating team meetings, MDEQ plans to work under a memorandum of agreement \n(MOA) with the MACD to implement this project.  Project partners provided the funding \namounts used to estimate costs for BMP installation.  Provided below is summary of estimated \nproject costs: \nActivity Size/Amount Estimated Cost Landowner Match \nBMPs    \n     Fencing 9,420 ft @ $2.75/ft $25,905  $10,362  \n     Water Facilities 12ea @ $1,304.86 $15,658  $8,000  \n     Heavy Use Areas 12ea @ $1,571.28 $18,855  $12,000  \n     Stream Crossings 7 ea @ $4,197.42 $29,382  $26,000  \n     Ponds 7 es @ $8,585.72 $60,100  $12,000  \n     Sediment Basins 6 ea @ $5,845.34 $35,072  $14,029  \n     Nutrient Management 200 ac @ $425 $85,000  $34,000  \n     Critical Area Planting 9 ac @ $773.83 $6,964  $2,786  \nEstablishment of Permanent Vegetation 200 ac @ $425 $85,000  $34,000  \n    Forage and Biomass Planting 42.5 ac @ $422.34 $17,949  $7,180  \nEducation/Outreach  $24,900   \nMonitoring  $13,000   \nProject Management, Implementation, \nCoordination, Plan Revision  $54,660   \n    \nTotal Estimated Project Cost  $472,447  $160,356  \n \n \nTo maximize education and outreach activities and monitoring efforts, MDEQ plans to leverage \nwith existing programs already allocated for funding where possible.  \nTotal estimated cost:  $472,447 \nTotal landowner match: $160,356 (40% of estimated cost) \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \n\nDry Creek Watershed Plan GY 2016 \n8 \n \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Dry Creek watershed project by tailoring them to address the \nsedimentation.  A positive approach is used to reach the full diversity of people in the \ncommunity with projects that foster a “sense of place”, a “sense of pride in community”, and a \nsense of the native plants, animals, and general ecology of their region, as well as, the history of \nthe community and a sense of economics.  Stakeholders and coordinators join together to \nparticipate in problem-solving, brainstorming, plan development, training workshops, festival \nevent planning, soil and water conservation field days, tree boards, poster, art and writing \nprojects and other activities that promote collaboration and ownership of the watershed, as well \nas, solutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/ post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nDry Creek watershed are listed below: \n \n Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Dry Creek Watershed. \n  Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n Storm Drain Marking - projects for scouts, environmental clubs, and citizen groups. \n “Train the Trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n \nAs part of the education outreach efforts, the stakeholder group forming the Dry Creek \nWatershed Implementation Team (WIT) will participate in a minimum of 5 face-to-face \nmeetings.  The purpose of these meetings is to provide updates on implementation activities, \neducation events and review and modify the watershed plan.  In concert with these WIT \nmeetings, and to incentivize stakeholder participation, project funding will be used to purchase \nfood and other refreshments for the WIT along with providing support for renting facilities in \nwhich to host those events.  In accordance with 41 CFR § 301-74.11, light refreshments, meals, \nand/or beverages are an allowable expense under CWA Section 319, provided a description of \nthe agenda, purpose, location, costs, etc., are outlined in an approved 319 grant workplan. The \npurpose of the meetings will be for updating the watershed plan, and hosting field days to \nshowcase the implemented BMPs for the public. At this time the exact number of participants \nand locations are not known therefore costs have been estimated for the purposes of this plan and \nwill be updated. \n  \n\nDry Creek Watershed Plan GY 2016 \n9 \n \n \nElement f: Implementation Schedule \n \nIn the event of a Section 319 NPS funding award from MDEQ to support implementation of this \nwatershed-based plan for this HUC 12 sub-watershed, MDEQ, along with support from the \nWatershed Implementation Team and Project Manager (where applicable), will: \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the roles, \ntasks, requirements, and milestones for project implementation. (Month 1) \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n3. Work with the Covington County SWCD, MACD, MSWCC, NRCS, and MDEQ to \ninform landowners and operators within the watershed about the project and work to \nsecure commitments from priority area landowners and operators who are willing to \nparticipate in the project.  (Months 1-6) \n4. Work with the local SWCD, MACD, MSWCC, NRCS, and MDEQ to determine through \nGIS applications and intensive site surveys the priority areas within the sub-watershed \nthat are contributing significant pollutant loads.  All BMPs shall be installed in \naccordance with the guidelines developed in the latest edition of the NRCS Technical \nField Manual, or other approved guidelines.  (Months 1-36) \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion and \nimplementation of an effective and efficient plan to monitor baseline water quality \nconditions in the watershed and track changes in water quality over time resulting from \nthe BMPs implemented through this project.  (Plan Completion:  Months 1-2); \nImplementation:  Months 3-36) \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 13-42) \n7. Conduct inspections of BMPs during construction (Months 3-36) \n8. Coordinate with and support the local SWCD, MACD, MSWCC and NRCS in the \ncollection of relevant GPS coordinates of all installed BMPs and incorporate this \ninformation into a GIS format.  All geospatial data shall be collected in a manner \nconsistent with the Federal Geographic Data committee-endorsed standards.  (Months 3-\n36) \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs (Months 3-36) \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data (1-36) \n \nElement g: Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nMSWCC, USGS, MACD, and the \nCovington Co. Soil and Water District to \ndetermine priority areas that are \ncontributing significant pollutant loads to \nDry Creek \nTarget priority \nareas for BMPs \nMonths 1-2 \n\nDry Creek Watershed Plan GY 2016 \n10 \n \nEstablish Watershed Implementation \nTeam to begin refinement of Watershed \nBased Plan for Dry Creek watershed \nEstablish WIT \n \nMonths 1-2 \nInitiate watershed monitoring  Baseline condition \nmonitoring \nCompleted using historical \ndata \nMeet with landowners and cooperators to \nsecure commitments to install BMPs in \npriority areas \nLandowner \nCommitment \nMonths 1-6 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 6-36 \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection Months 3-36 \nBegin monitoring to collect data on post-\nBMP water quality \nPost-BMP \nMonitoring \nMonths 42-48 \nFinalize education and outreach plan Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nElement h: Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters do \nnot include a water quality standard applicable to aquatic life protection due to sediment. \nHowever, a narrative standard for the protection of aquatic life was interpreted to determine an \napplicable target for the Dry Creek TMDL. The narrative standard is that waters shall be free \nfrom materials attributable to municipal, industrial, agricultural, or other dischargers producing \ncolor, odor, taste, total suspended solids, or other conditions in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to aquatic life and wildlife, \nor adversely affect the palatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses.  In lieu of numeric criteria for sediment, the monitoring will be conducted to \ncollect data on parameters that are considered surrogates for sediment concentrations and may \ninclude measurements for Total Suspend Solids, Total Suspended Sediment, and turbidity along \nwith conventional parameters generally measured to determine aquatic health (e.g. Dissolved \nOxygen, pH, Temperature, Conductivity).  The following thresholds will be used to measure \ncompliance with water quality criteria:  \n \nParameter Threshold  \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of 4.0 mg/L \npH 6.0-9.0  \n \nTemperature Not to exceed 90°F  \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold less than 1500 \nmg/L \n \n\nDry Creek Watershed Plan GY 2016 \n11 \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements.  Mississippi use a calibrated and verified index of biotic integrity to make \nwater quality assessment decisions.  This index, the Mississippi Benthic Index of Stream Quality \n(M-BISQ) was originally developed in 2000 and has undergone three recalibration efforts to \nrefine the sensitivity of the index.  As part of the index development process, the state was \ndivided into unique bioregions.  Within each bioregion, the index has a defined attainment \nthreshold that is used to determine if the biological community measures collected at a site are \nrepresentative of good water quality that can support a balanced benthic macroinvertebrate \ncommunity.  If the score is above the attainment threshold for the bioregion, the site is assessed \nas attaining the aquatic life use designation.  Dry Creek is in the East bioregion and the \nattainment threshold is 71.6.  Along with overall MBISQ scores, the in-stream habitat surveys \nwill also be used to determine change over time.     \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Dry Creek.  In the event data \nindicate little or no positive change, a Stressor Analysis will be conducted to determine if any \nnew or additional stressors are preventing improvements to water quality.  If any new stressors \nare identified, the Watershed Implementation Team will identify future actions/activities to \naddress those stressors. \n \nElement i: Monitoring \n \nPrior to BMP installation, water quality chemical and biological monitoring was conducted and \nwill serve as baseline data for the project along with any historical data available on Dry Creek.  \nHistorical monitoring stations are shown in Figure 4. Post-BMP monitoring locations will be \nselected using best professional judgement and will be targeted to reflect water quality \ndownstream of BMP activity.  Once BMP installation is complete, and there has been sufficient \ntime for the stream to stabilize, post BMP monitoring will be initiated.  Post BMP monitoring \nwill be conducted in a way that allows for comparison with the pre-implementation data.  \nBecause recovery periods of streams can be dependent on type and amount of BMPs installed, \nmore than 1 year of post BMP data may be needed to observe a change in water quality.  In some \ncases, it may take 5 or more years to see full benefits of BMPs. All data collection efforts will be \nconducted using trained personnel following established Standard Operating Procedures and \nadhering to agency Quality Assurance protocols.   \n  \n\nDry Creek Watershed Plan GY 2016 \n12 \n \n \n- \nFigure 4: Dry Creek Watershed Historical Monitoring Stations ",
  "metadata": {
    "id": "dry-creek-9-key-element-plan-2017-4",
    "originalName": "Dry_Creek_9_Key_Element_Plan_2017.pdf",
    "size": 999996,
    "uploadedAt": "2025-10-03T23:17:34.979Z",
    "pageCount": 12,
    "info": {}
  }
}