{
  "id": "ellison-creek-9-key-element-plan-2021-5",
  "rawText": "\n\nEllison Creek Watershed  GY 2021 \n1 \n \nEllison Creek Watershed Plan \n9 Key Element Plan \nHUC 080602020404 \nMWS 1044 \nGY 21 Project Area \nSeptember 29, 2021 \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Ellison Creek Watershed is located just north of Mississippi’s capital in Jackson, MS, along \nthe banks of the Big Black River in Yazoo County and covers an area of 10,957 \nacres.  According to the 2019 National Land Cover Database (NLCD), the landuse within this \nwatershed is comprised of approximately 16% cropland, 22% pasture, 55% forestland, and 7% \nother (water, scrub/barren, wetland and urban) as depicted in Figure 1. \n \nThe water-use classification for all water bodies in this watershed, as established by Regulations \nfor Water Quality Criteria for Intrastate, Interstate, and Coastal Waters (MDEQ, 2021), is Fish \nand Wildlife. Waters with this classification are intended for fishing and propagation of fish, \naquatic life, and wildlife. Waters that are classified as Fish and Wildlife should also be suitable \nfor secondary contact recreation, which is defined as incidental contact with water including \nwading and occasional swimming.   \n \nEllison Creek (segment MS430E) was included as an “evaluated” assessment in Mississippi’s \nSection 303(d) List in 1998.  Assessments designated as “evaluated” were performed using \nanecdotal data and information from the watershed, but there was no actual monitoring data to \nsupport the determine.  Based on the evaluated information provided, Ellison Creek was listed \nfor a suite of causes: pesticides, nutrients, siltation, and organic enrichment/low dissolved \noxygen.  In 2001, MDEQ collected biological community data on Ellison Creek.  The biological \ncommunity data and resulting index of biological integrity score developed from those data \nindicated the stream was impaired.  Using biological community data along with habitat surveys, \nand physical/chemical data, a stressor identification analysis was performed.  The result of this \nstressor analysis indicated that sedimentation in the watershed was the primary pollutant \ncontributing to the impairment in Ellison Creek. Based on this information, MDEQ included \nEllison Creek (MS430E) in the Total Maximum Daily Load in the Big Black River Basin for \nDesignated Streams in HUC 08060202 for Impairment Due to Sediment (MDEQ, 2007)that was \ndeveloped by MDEQ in 2007.  This TMDL calls for a 99% reduction in sediment.   \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \nregulation does not include a numeric water quality standard for aquatic life protection due to \nsediment. The narrative standard for the protection of aquatic life is sufficient for justification of \nTMDL development but does not provide a quantifiable TMDL target. The target for this TMDL \nis based on reference sediment yields developed by the Channel and Watershed Processes \nResearch Unit (CWPRU) at the National Sedimentation Laboratory (NSL).  Ellison Creek is \nlocated within level III ecoregions (74) Mississippi Valley Loess Plains and level IV (74b) Loess \nPlains.   \n\nEllison Creek Watershed  GY 2021 \n2 \n \n \n \nFigure 1: Landuse Distribution in the Ellison Creek Watershed\n\nEllison Creek Watershed Plan GY2021 \n3 \n \nThere are no facilities in the Ellison Creek Watershed with NPDES permits that include limits \nfor Total Suspended Solids (TSS) which is used as an indicator of sediment contributions from \npermitted activities.  Certain contaminants may be associated with sediment such as pesticides \nand nutrients. These contaminants were not addressed directly within the TMDL. However, these \ncontaminants would also be controlled by the same best management practices (BMPs) that \ncontrol the sediment from nonpoint sources of pollution.  Non-point loading of nutrients and \norganic material in a water body results from the transport of the pollutants into receiving waters \nby overland surface runoff, groundwater infiltration, and atmospheric deposition. Unlike \nnitrogen, phosphorus is primarily transported in surface runoff when it has been sorbed by \neroding sediment. \n \nFigure 2 shows the location of the impaired segment along with the monitoring locations in the \nEllison Creek Watershed. \n\nEllison Creek Watershed Plan GY2021 \n4 \n \n \n \nFigure 2: Impaired Segment and Monitoring Sites in the Ellison Creek Watershed\n\nEllison Creek Watershed Plan GY2021 \n5 \n \nElement b: Expected Load Reduction \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2021) regulation does not include a numerical water quality standard for aquatic life \nprotection due to sediment; however, a narrative standard for the protection of aquatic life was \ninterpreted to determine an applicable target for the sediment TMDL in the Ellison Creek \nWatershed.  The narrative standard states waters shall be free from materials attributable to \nmunicipal, industrial, agricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions in such degree as to create a nuisance, render the waters \ninjurious to public health, recreation, or to aquatic life and wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or impair the waters for any designated uses. The sediment \nTMDL for Ellison Creek (MS430E) concluded that sediment yields would need to be reduced by \n99% in the watershed.  All sediment yield reductions were developed from suspended sediment \nconcentration data measured at stable streams in the same ecoregion(s).  The targets were \ndeveloped to reflect stable stream conditions using reference sediment yields.  These reference \nconditions were established by the USDA’s Channel and Watershed Processes Research Unit \n(CWPRU) at the National Sedimentation Laboratory (NSL). \n \nNonpoint loading of sediment in a water body results from the transport of material into \nreceiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion.  Sources of sediment include agriculture, silviculture, rangeland, construction sites, \nroads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream sources, \nand historical landuse activities and channel alterations.   \n \nThe MDEQ will work with agency resource partners to identify and implement BMPs to address \nsediment concerns in the Ellison Creek Watershed. The United States Department of Agriculture \n(USDA) Natural Resource Conservation Service (NRCS) has a list of approved BMPs to address \nsedimentation and this list will be used to identify candidate BMPs in the Ellison Creek \nwatershed.  While these are for sedimentation, there is an additional benefit in the reduction of \nnutrients as they attach to sediment particles in run-off.  Practices approved by NRCS will be \nused to identify candidate BMPs in the Ellison Creek watershed.   \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC), the Natural Resource Conservation Service (NRCS), and the local Soil \nand Water Conservation Districts (SWCDs) throughout the state.  These SWCDs are typically \nhoused within USDA Service Centers co-located with NRCS offices.  These USDA Service \nCenters handle federal assistance programs offered through the Farm Bill.  As part of these \nservices, SWCD staff communicate regularly with the local landowners and operators within the \nwatershed as they work to support sign-ups for Farm Bill initiatives   Staff from MSWCC and \nthe SWCD depend upon assistance from their NRCS partners in determining landowner interest \nin the watershed because they are on the farms and in the fields with the landowners, understand \nthe needs at the local level, and have knowledge of the amount of unfunded applications for \nfederal program assistance which meet Section 319 eligibility requirements.  Based on their \nanalysis, installation of the following BMPs would mitigate sediment issues in the Ellison Creek \n\nEllison Creek Watershed Plan GY2021 \n6 \n \nwatershed helping the stream recover: fencing, watering facilities, heavy use areas, stream \ncrossings, ponds, sediment basins, grade stabilization structures, streambank and shoreline \nprotection, stream crossings, forage and biomass planting.  Factors considered for determining \nspecific locations for the placement of BMPs included the following attributes based upon best \nprofessional judgement of trained NRCS, SWCD and MDEQ Staff: \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDL (i.e., “It is recommended that \nwater bodies within [the watershed] be considered a priority for streambank and \nriparian buffer zone restoration and any sediment reduction BMPs, especially for road \ncrossings, agricultural activities, and construction activities); \n4. Ease of showing effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the grant period); \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This  \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project who may contribute match include MSWCC, Yazoo County Soil and \nWater Conservation District, NRCS, and/or local landowners and operators.  For project \nimplementation, administration, management, and watershed plan revision, as well as hosting \nand facilitating team meetings, MDEQ plans to work under a memorandum of agreement (MOA) \nwith the MSWCC to implement this project.  Project partners provided the funding amounts used \nto estimate costs for BMP installation.  Provided below is summary of estimated costs for \npotential BMPs and overall project implementation: \n \n\nEllison Creek Watershed Plan GY2021 \n7 \n \nCost Estimate: Full Project Implementation \n \nBMPs* Size/Amount \nEstimated \nCost \nGrade Stabilization Structure 80 each @ $6,500 $520,000 \nSediment Basin 2 each @ $6,250 $12,500 \nGrassed Waterway 5 each @ $1,408 $7,040 \nHeavy Use Area Protection 9,000 sq.ft. @ $3.93 $35,370 \nStream Crossing 4 each @ $5,000 $20,000 \nTank/Trough 17 each @ $6,000 $102,000 \nCover Crops 800 ac @ $73 $58,400 \nFencing 7,500 ft. @ $4.50 $33,750 \nDikes 20,000 ft. @ $1.90 $38,000 \nDiversions 10,000 ft @ $2.50 $25,000 \nPond 5 @ $6,250 $31,250 \nTerraces 35,000 ft. @ $1.86 $65,100 \nForage and Biomass Planting 300 ac. @ $211 $63,300 \nStreambank and Shoreline Protection 4,000 ft. @ $183.55 $734,200 \nTechnical Assistance** N/A $45,000 \nEducation and Outreach** N/A $28,000 \nMonitoring**  N/A $20,000 \nProject Management, Implementation, \nCoordination, Plan Revision**   $135,000 \nTotal Estimated Cost   $1,973,910 \n*Conservation Best Management Practices provide a 40% match at a minimum \n** Denotes fields that are estimated upon three incremental funding cycles of the project  \n \nDue to the magnitude of BMP needs, this project will need to be funded incrementally using \nmultiply sources of funds. To fully address all suggested conservation needs in the watershed, \nthis plan recommends funding be provided in 3 increments. To maximize education and outreach \nactivities and monitoring efforts, MDEQ plans to leverage with existing programs already \nallocated for funding where possible. \n  \n\nEllison Creek Watershed Plan GY2021 \n8 \n \nBelow is the estimated budget for the first incremental funding (Phase 1) of this project: \n \nCost Estimate: Phase 1 Implementation: \n \nBMPs* Size/Amount \nEstimated \nCost \nGrade Stabilization Structure 20 each @ $6,500 $130,000 \nHeavy Use Area Protection 2,700 sq.ft. @ $3.93 $10,611 \nTank/Trough 5 each @ $6,000 $30,000 \nCover Crops 235 ac @ $73 $17,155 \nFencing 2,100 ft. @ $4.50 $9,450 \nPond 3 each @ $6,250 $18,750 \nTechnical Assistance N/A $15,000 \nEducation and Outreach N/A $14,000 \nMonitoring  N/A $10,000 \nProject Management, Implementation, \nCoordination, Plan Revision   $45,000 \nTotal Estimated Phase 1 Cost   $299,966 \n*Conservation Best Management Practices provide a 40% match at a minimum. \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of Nonpoint Source Pollution: agriculture, construction, forestry, on-\nsite waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Ellison Creek Watershed project by tailoring them to address \nnonpoint sources of sedimentation and nutrients.  A positive approach is used to reach the full \ndiversity of people in the community with projects that foster a “sense of place”, a “sense of \npride in community”, and a sense of the native plants, animals, and general ecology of their \nregion, as well as the history of the community and a sense of economics.  Stakeholders and \ncoordinators join together to participate in problem-solving, brainstorming, plan development, \ntraining workshops, festival event planning, soil and water conservation field days, tree boards, \nposter, art and writing projects and other activities that promote collaboration and ownership of \nthe watershed, as well as solutions to its problems.  The ultimate goal is to bring about behavior \nchanges and the use of “best management practices” that will improve water quality and the \noverall quality of life in the watershed.  Evaluation forms, pre-test/ post-test, surveys, and \nreporting of the number of people who attend workshops, trainings and events are among the \nmethods used to measure the success of education/information programs.  A partial list of \nMDEQ’s programs that could be used in the Ellison Creek watershed are listed below: \n \n\nEllison Creek Watershed Plan GY2021 \n9 \n \n•  Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n• Teacher workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n• Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Dry Creek Watershed. \n•  Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n•  “Train the trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n• “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Ellison Creek \nWatershed Implementation Team (WIT) will participate in a minimum of 3 face-to-face \nmeetings. The purpose of these meetings is to provide updates on implementation activities, \neducation events and review and modify the watershed plan. In concert with these WIT \nmeetings, and to incentivize stakeholder participation, project funding will be used to purchase \nfood and other refreshments for the WIT along with providing support for renting facilities in \nwhich to host those events. In accordance with 41 CFR § 301-74.11, light refreshments, meals, \nand/or beverages are an allowable expense under CWA Section 319, provided a description of \nthe agenda, purpose, location, costs, etc., are outlined in an approved 319 grant workplan. The \npurpose of the meetings will be for updating the watershed plan, and hosting field days to \nshowcase the implemented BMPs for the public. At this time the exact number of participants \nand locations are not known therefore costs have been estimated for the purposes of this plan and \nwill be updated. \n \nElement f: Implementation Schedule \n \nThe following schedule describes the approaches and tasks that the grantee shall collaboratively \nperform with project partners to advance and implement this watershed-based plan. During this \neffort, resource agency partners will work with the Watershed Implementation Team and MDEQ \nProject Manager (where applicable), to perform the tasks identified below: \n  \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the \nroles, tasks, requirements, and milestones for project implementation. (Month 1) \n \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n \n3. Work with the Yazoo County SWCD, MSWCC, NRCS, and MDEQ to inform \nlandowners and operators within the watershed about the project and work to secure \n\nEllison Creek Watershed Plan GY2021 \n10 \n \ncommitments from priority area landowners and operators who are willing to \nparticipate in the project.  (Months 1-6) \n \n4. Work with the local SWCD, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that \nare contributing significant pollutant loads.  All BMPs shall be installed in \naccordance with the guidelines developed in the latest edition of the NRCS Technical \nField Manual, or other approved guidelines.  (Months 1-36) \n \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion \nand implementation of an effective and efficient plan to monitor baseline water \nquality conditions in the watershed and track changes in water quality over time \nresulting from the BMPs implemented through this project.  (Plan Completion:  \nMonths 1-2); Implementation:  Months 3-36) \n \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 13-36) \n \n7. Conduct inspections of BMPs during construction (Months 3-36) \n \n8. Coordinate with and support the local SWCD, MSWCC and NRCS in the collection \nof relevant GPS coordinates of all installed BMPs and incorporate this information \ninto a GIS format.  All geospatial data shall be collected in a manner consistent with \nthe Federal Geographic Data committee-endorsed standards.  (Months 3-36) \n \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. (Months 3-36) \n \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data. (1-36) \n \nElement g:  Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nMSWCC, and the Yazoo Co. Soil and \nWater Conservation District to \ndetermine priority areas that are \ncontributing significant pollutant loads \nto Ellison Creek \nTarget priority areas \nfor BMPs \nMonth 1-36 \nEstablish Watershed Implementation \nTeam.  \nEstablish WIT \n \nMonth 1-2 \nInitiate watershed monitoring Baseline Condition \nMonitoring \nCompleted using historical \ndata \n\nEllison Creek Watershed Plan GY2021 \n11 \n \nMeet with landowners and cooperators \nto secure commitments to install BMPs \nin priority areas \nLandowner \nCommitment \nMonths 1-36 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT Meetings Months 1-36 \nImplement BMPs BMP Instillation Months 1-36 \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection Months 1-36 \nBegin monitoring to collect data on \npost-BMP water quality \nPost-BMP Monitoring Months 40-48 \nImplement education and outreach plan Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal: Reduce sediment loads entering waters in the Ellison Creek Watershed. \n \nElement h:  Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2021) do not include a water quality standard applicable to aquatic life protection due \nto sediment. However, a narrative standard for the protection of aquatic life was interpreted to \ndetermine an applicable target for the Ellison Creek TMDL. The narrative standard is that waters \nshall be free from materials attributable to municipal, industrial, agricultural, or other dischargers \nproducing color, odor, taste, total suspended solids, or other conditions in such degree as to \ncreate a nuisance, render the waters injurious to public health, recreation, or to aquatic life and \nwildlife, or adversely affect the palatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses.  In lieu of numeric criteria for sediment, monitoring will be conducted to collect \ndata on parameters that are considered surrogates for sediment concentrations and may include \nmeasurements for Total Suspend Solids, Total Suspended Sediment, and turbidity along with \nconventional parameters generally measured to determine aquatic health (e.g. Dissolved Oxygen, \npH, Temperature, Conductivity).  The following thresholds will be used to measure compliance \nwith water quality criteria and/or target thresholds:   \n\nEllison Creek Watershed Plan GY2021 \n12 \n \nSuccess Measurement Thresholds: \nParameter Threshold \nDissolved Oxygen \nDaily Average of 5.0 mg/L; Instantaneous \nthreshold of 4.0 mg/L \nDissolved Oxygen % Sat. > 70% - < 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; \ninstantaneous threshold less than 1500 \nmg/L \nChemical Oxygen Demand <50 mg/l \nTurbidity <100 NTU \nTotal Suspended Solids <80 mg/l \nM-BISQ West Bioregion \nAssessment threshold 43.7 (25th percentile \nof reference condition) \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements.  Mississippi uses a calibrated and verified index of biotic integrity to \nmake water quality assessment decisions.  This index, the Mississippi Benthic Index of Stream \nQuality (M-BISQ) was originally developed in 2000 and has undergone three recalibration \nefforts to refine the sensitivity of the index.  As part of the index development process, the state \nwas divided into unique bioregions.  Within each bioregion, the index has a defined attainment \nthreshold that is used to determine if the biological community measures collected at a site are \nrepresentative of good water quality that can support a balanced benthic macroinvertebrate \ncommunity.  If the score is above the attainment threshold for the bioregion, the site is assessed \nas attaining the aquatic life use designation.  Ellison Creek is in the West bioregion and the \nattainment threshold is 43.7.  Along with overall MBISQ scores, the in-stream habitat surveys \nwill also be used to determine change over time.     \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Ellison Creek.  In the event data \nindicate little or no positive change, a Stressor Analysis will be conducted to determine if any \nnew or additional stressors are preventing improvements to water quality.  If any new stressors \nare identified, the Watershed Implementation Team will identify future actions/activities to \naddress those stressors. \n \n\nEllison Creek Watershed Plan GY2021 \n13 \n \nElement i: Monitoring  \n \nPrior to BMP installation, pre-implementation water quality chemical and biological monitoring \nwill be collected to serve as baseline data for the project along with any historical data available \nin Ellison Creek. Water quality monitoring will include water chemistry data (nutrients, \nsuspended solids, oxygen demand, chlorides, etc.), in-situ field measurements for such \nparameters as dissolved oxygen, pH, temperature, specific conductance, and turbidity, datalogger \n(sonde) deployment for continuous in-situ field measurement data as well as biological \ncommunity monitoring for benthic macroinvertebrates.  A list of this historical water quality \nmonitoring in the Ellison Creek Watershed is provided in the table below and their sample \nlocations are shown in Figures 1 and 2. \n \nStation \nID \nWater \nSample \nYear(s) \nCollecting \nAgency \nProject \nWater \nChem \nIn-\nSitu \nSonde Benthics \nBody \nBB071 \nEllison \nCreek \n2001 MDEQ M-BISQ X X \n  \nX \n \nMonitoring locations will be selected using best professional judgment and will be targeted to \nreflect water quality downstream of BMP activity.  Once BMP installation is complete, and there \nhas been sufficient time for the stream to stabilize, post BMP monitoring will be initiated.  Post \nBMP monitoring will be conducted in a way that allows for comparison with the pre-\nimplementation data.  Because recovery periods of streams can be dependent on type and amount \nof BMPs installed, more than 1 year of post BMP data may be needed to observe a change in \nwater quality.  In some cases, it may take 5 or more years to see full benefits of BMPs. All data \ncollection efforts will be conducted using trained personnel following established Standard \nOperating Procedures and adhering to agency Quality Assurance protocols.   \n \n ",
  "metadata": {
    "id": "ellison-creek-9-key-element-plan-2021-5",
    "originalName": "Ellison_Creek_9_Key_Element_Plan_2021.pdf",
    "size": 711186,
    "uploadedAt": "2025-10-05T01:47:15.081Z",
    "pageCount": 13,
    "info": {}
  }
}