{
  "id": "magees-creek-watershed-plan-2007",
  "rawText": "\n\nMagees Creek \nWatershed \nImplementation Plan \n \n \nFinal Draft \n\n 2 \nMagee’s Creek Watershed \n Implementation Plan \n \n \n \n \n \n \nPrepared for: \n \nPearl River/South Independent Streams Basin Team \nMississippi Department of Environmental Quality \n \n \n \n \n \n \n \n \n \n \nDeveloped by:  \n \nMagees Creek Watershed Implementation Team \n \n \n \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n\n 3 \nTable of Contents \n \n \nI. Executive Summary        6 \n \nII. Vision Statement         8 \n \nIII. Mission Statement        8 \n \nIV. Watershed Implementation Team      9 \n \nV. Watershed Description         10 \n \nVI. Stakeholder Interests           14 \n \nVII. Water Resources        15                          \n       A. History of Activity in the Watershed     15 \n       B. Wildlife and Fisheries       15 \n       C. Designated Use classifications and Water Quality Standards  16 \n       D. Current Status of Waterbodies in the Watershed   16 \n       E. TMDLs         16 \n \nVIII. Watershed Management Actions      17 \n        A. Stakeholders Interests       17 \n        B. Goals/Objectives           17 \n        C. Management Actions       17 \n        D. Project Tracking/Assessment of Progress    18 \n        E. Desired Results/Benefits        19 \n        F. Roles/Responsibilities       20 \n        G. Budget         20 \n \nIX. Education/Outreach Activities        22 \n      A. Educational Activities to be Implemented     22 \n 1. Signage         22 \n     a. Indicators        22 \n     b. Schedule        23 \n     c. Budget          23 \n 2. Field Days         23 \n     a. Indicators        23 \n     b. Schedule        23 \n     c. Budget          24 \n 3. Fact Sheets        24 \n     a. Indicators        24 \n     b. Schedule        24 \n     c. Budget          24 \n\n 4 \n 4. Adopt-A-Stream          25 \n     a. Indicators        25 \n     b. Schedule        25 \n     c. Budget          25 \n 5. Project Learning Tree       25 \n     a. Indicators        26 \n     b. Schedule        26 \n     c. Budget          26 \n 6. Watershed Harmony Puppet Show     26 \n     a. Indicators        26 \n     b. Schedule        27 \n     c. Budget          27 \n 7. Total Projected Cost of Education/Outreach Activities  27 \n 8. Total Budget for Magees Creek Watershed Implementation Plan  28 \n \nX. Evaluation          29 \n     A. Plan Evaluation Procedure        29 \n     B. Implementation Evaluation Strategy     29 \n \nXI. Plan Revision         31 \n     A. Plan Revision Procedure       31 \n \nXII. Resources         32 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nList of Tables \n \nTable 1.1 Magees Creek Management Action Plan    7 \n\n 5 \nTable 7.1 Water Quality Standards      16 \nTable 8.1 Funded 319 Project Budget      20 \nTable 8.2 Contractual Services for BMP Design     21 \nTable 8.3 Technical Assistance       21 \nTable 9.1 Projected Costs of Signage      23 \nTable 9.2 Projected Costs of Field Days       24 \nTable 9.3 Projected Costs for Fact Sheets     24 \nTable 9.4 Projected Costs for Adopt-A-Stream Workshop   25 \nTable 9.5 Projected Costs for Project Learning Tree    26 \nTable 9.6 Projected Costs for Watershed Harmony Puppet Show  27 \nTable 9.7 Total Projected Education Budget     28 \nTable 9.8 Total Budget for Magees Creek Watershed Implementation \n       Plan         28 \n \n \n \n \nList of Figures \n \nFigure 5.1 Magees Creek watershed      11 \nFigure 5.2 Land use in Magees Creek Watershed    12 \nFigure 5.3 Impaired Segment of Magees Creek     13 \n \n \n \nList of Appendices \n \nAppendix A- Plant and Animal Species of Special Concern \nAppendix B- Funded 319 Project Proposal \nAppendix C- Stressors   \nAppendix D- Checklist of Watershed Implementation Elements \n \n \n \n \n \n \n \n \n \n \n \n \nI. Executive Summary \n\n 6 \n \n Magees Creek Watershed was identified as a priority watershed by the \nPearl River- South Independent Streams Basin Team due to its listing on \nMississippi’s 303(d) list of impaired waters.  The impairment in this watershed is \nfecal coliform.  The Mississippi Soil and Water Conservation Commission \n(MSWCC) and USDA Natural Resources Conservation Service (NRCS) thought \na great impact on water quality could be made in this watershed. MSWCC \nsubmitted a proposal to apply best management practices to address the fecal \ncoliform issue.  That proposal was selected for funding by MDEQ and a contract \nwas awarded to MSWCC.  MSWCC has taken the lead to assemble a Watershed \nImplementation Team to address the fecal coliform issue along with any other \nissues and concerns within the watershed and write a Watershed Implementation \nPlan.  \n  \n The key natural resource issue in this watershed is fecal coliform loading \nto the streams.  This Watershed Implementation Plan has the goals of reducing  \nfecal coliform entering streams and creeks in the watershed, and removing the \nimpaired segments of the streams and creeks in the Magees Creek watershed \nfrom the state’s 303(d) list of impaired waterbodies.  MSWCC plans to implement \na 319 water quality project on agricultural lands within the watershed.  The \ntargeted area for this project is land within Walthall County that is located in the \nMagees Creek watershed.  This project is a three year project that began in 2005 \nand will end in August 2008.  The organizations and agencies that will be \nimplementing the project to reduce fecal coliform loading will be the Walthall \nCounty Soil and Water Conservation District, Natural Resources Conservation \nService, and the Mississippi Soil and Water Conservation Commission.  The \nWalthall County Soil and Water Conservation District and the Natural Resources \nConservation Service can be contacted at 601-876-0962 ext. 3 for information \nand assistance about this project.  \n\nTable 1.1 Magees Creek Management Action Plan \nGoal Who What Where When Contact \nReduce fecal \ncoliform loading \nto achieve water \nquality standards \nand both \ndesignated uses: \nprimary contact \nand aquatic life \nsupport \nMSWCC, USDA \nNRCS, MSU \nExtension, \nMississippi Farm \nBureau \nContinue existing programs and \nprojects related to farmer \neducation, BMP Implementation \nand habitat conservation \nEntire \nWatershed \n2005-2008 Mark Gilbert, MSWCC \n601-354-7645 \n, USDA NRCS \n601-876-0962 \nBrook Stuart, \nMississippi Farm \nBureau \n601-977-4243 \nLocal Landowners \nand Operators \n- Critical Area Planting \n- Grade Stabilization Structures \n- Pasture and Hayland Planting \n- Water and Sediment Control \nBasins \n-Nutrient Management \n- Livestock Water Ponds \n- Tank/Trough \n- Stream Crossings \n- Fencing \n- Lagoons \n- Waste Storage Facilities \n- Composting Facilities \n- Grassed Waterways \n- Prescribed Grazing \n- Incinerators \n- Tree Planting \n- Alum Treatment of Poultry \nHouses \n- Conservation Cover \n- Chiseling and Subsoiling  \n   \n7\n\nII. VISION STATEMENT \n \n The vision of the Magees Creek Watershed Implementation Team is to \nimprove and/or protect the quality of water in Magees Creek Watershed by \nreducing sediment transport, improving drainage, and reducing fecal coliform \nloading from agricultural lands in the watershed.\n \n \n III. MISSION STATEMENT \n \n  \n \n The mission of the Magees Creek Watershed Implementation Team is to \neducate landowners on new and innovative best management practices and land \nuse planning methods and implement the appropriate best management \npractices that will result in the enhancement and conservation of all the natural \nresources in the watershed. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n8 \n\n 9 \nIV. Watershed Implementation Team  \n \n Members of the Watershed Implementation Team for the Magees Creek \nWatershed include as follows: \n \nMelvin Holiday- Producer \n \nBrent Bracey- Walthall Co. SWCD Commissioner/ Producer (WCSWCD) \n \nLarry Martin- Walthall Co. SWCD Commissioner (WCSWCD) \n \nSteven Williams- Mississippi Forestry Commission (MFC) \n \nJennifer Stringer- Natural Resources Conservation Service (NRCS) \n \nMark Gilbert- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nBilly Davis- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nPatrick Vowell- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nBrook Stuart-Mississippi Farm Bureau Federation (MFBF) \n \nJanet Chapman- Mississippi Department of Environmental Quality (MDEQ) \n \nKenneth LaFleur- Mississippi Department of Environmental Quality (MDEQ) \n \nAnn Porter- Mississippi Department of Environmental Quality (MDEQ) \n \nLamar Adams- Walthall Co. Extension Service (MSU-Ext) \n \nNathan Graves- Walthall Co. SWCD Commissioner (WCSWCD) \n \nMike Davis- Pearl River Basin Development District (PRBDD) \n \nKen Ainsworth- Natural Resources Conservation Service (NRCS) \n \nJimmy Armstrong- Pearl River Basin Development District (PRBDD) \n \n \n \n \n \n\n 10 \nV. WATERSHED DESCRIPTION \n \n Magee’s Creek lies within Walthall, Marion and Lawrence Counties in the \nSouthwest portion of Mississippi (Figure 5.1) (MDEQ 2004).  There are 143,266 \nacres located within the watershed boundaries.  This rural watershed is sparsely \npopulated.  The city of Tylertown is located in this watershed, and there are \nseveral communities including Kioto, Dillon, Simonds, Lehr, Kirklin, Davo, Carto, \nMesa, Lexie, China Grove, Melis, Salem, Darbun, and Sartinville.  Economic \nconditions that influence this watershed include lumber mills, timber producers, \npoultry farms, dairy farms, and a very limited amount of row crop farms.  Several \nunmarked Indian mounds are located in the watershed. \n The land uses in the watershed include agriculture lands (62%), \nforestlands (32%), barren, urban and water (all together less than 1%).  Cotton \nwas the major crop in the watershed until the 1950’s when dairy farming became \nthe major type of farming.  Due to economics in the 1970’s, soybean production \nbecame the major land use due to increased profitability.  The 1990’s brought \nalong poultry production as the major land use in the Magees Creek watershed.  \nAlso, an increase in timber production has caused a decrease in the number of \nacres of row crops grown throughout this cycle.  Since Hurricane Katrina hit in \n2005, there has been an increase in the amount of urbanizaton in the watershed.  \nA large number of five to ten acre homesite communities are being developed \nwithin the watershed.  \n The soils in the watershed are primarily of the Ora-Ruston association.  \nThe other soil associations in the watershed include Brookhaven-Providence-\nOra, Ora-Savannah-Ruston, Ruston-Ora, Cascilla-Collins-Falaya, and \nMantachie-Ochlockone-Wehadkee.   The geology of the watershed is Citronelle \nof the Pliocene epoch and the Hattiesburg and Catahoula of the Miocene epoch.  \nMagees Creek watershed is located in the Southern Pine Plains and Hills \necoregion.  About 4%, or 6,424 acres, of the watershed are wetlands.  \n Collins Creek, Varnell Creek and two unnamed tributaries all have point \nsource discharges on them.  There are no state or federal parks, wildlife \nmanagement areas, national forests or other significant management areas \nlocated within this watershed.   \n \n \n \n \n \n\n 11 \n \n \n \nFigure 5.1 Magees Creek Watershed \n \n \n \n \n\n 12 \n \n \n \n \n \n \nFigure 5.2 Land Use in Magees Creek Watershed \n \n \n \n \n \n\n 13 \n \n \n \n \nFigure 5.3 Impaired Segment of Magees Creek  \n \n \n \n \n \n \n \n\n 14 \nVI. STAKEHOLDER INTERESTS \n \n The major interests and concerns of the stakeholders in the Magees \nCreek watershed are as follows: \n \n Interest \n• to maintain an agricultural/silvacultural base in the watershed \n•  \n Concerns \n - decline in profit for dairy producers due to decreasing milk prices and   \n    rising costs to stay in environmental compliance \n \n - kudzu, cogongrass, and smutgrass- invasive weed species in the state \n \n - decrease in natural regeneration of native hardwoods due to the       \n   abundance and rapid growth of privet hedge and wild hogs eating the   \n   acorns and other nuts before they are able to sprout \n  \n Interest \n• the water quality of streams and creeks in the watershed \n \n Concerns \n - beavers damming up streams and creeks in the watershed causing   \n   flooding, also no help with trapping (funding) \n  \n - sedimentation from agricultural lands \n \n - the disposal of litter and trespassing on private lands of recreational   \n   tubers along the creek \n \n Interest \n• the overall quality of life in the Magees Creek watershed \n \n Concerns \n - DNA source tracking to identify the sources of pollution entering the   \n   streams \n \n - the odors produced by dairy and poultry operations \n \n - the overall impacts that urban development might have on the     \n   watershed    \n \n \n\n 15 \nVII. Water Resources \n \nA. History of Activity in the Watershed \n \n The primary players in restoration and /or conservation efforts in the Magees \nCreek Watershed are the Natural Resources Conservation Service (NRCS), Walthall \nCounty Soil and Water Conservation District, the Mississippi Soil and Water \nConservation Commission (MSWCC), and the local landowners.  Local landowners \nand operators will play a major role in the restoration and conservation of the natural \nresources in this watershed by installing needed BMPs on their land.   \n \n Conservation activities in this watershed have been an ongoing activity for \nmany years.  There has been approximately $150,000 spent on Best Management \nPractices (BMPs) in the past three years under the NRCS’s Environmental Quality \nIncentives Program (EQIP).  It is projected that over the next three years another \n$120,000 will be spent in this watershed under EQIP.  Other conservation activities \ntaking place in the watershed include tree planting using the FSA’s    Conservation \nReserve Program (CRP) and the Mississippi Forestry Commissions state cost share \nprograms.  These practices are resulting in better water quality for the Magees \nCreek watershed. \n  \n The Magees Creek Watershed was selected as a priority watershed by the \nPearl River/ South Independent Streams Basin Team.  As the management agency \nfor agricultural nonpoint source pollution in the state of Mississippi, the Mississippi \nSoil and Water Conservation Commission (MSWCC) determined that Magees Creek \nWatershed would be a good candidate for restoration.  After meetings with local \nlandowners and NRCS employees that work in this area, MSWCC determined there \nwas enough interest in the watershed to make a measurable difference and \nconsequently submitted a 319 proposal to the Mississippi Department of \nEnvironmental Quality (MDEQ).  Through a collaborative effort between NRCS, \nMDEQ and MSWCC, the team members for the Watershed Implementation Team \nwere assembled.  \n \n \nB. Wildlife and Fisheries \n \n There is an abundance of wildlife and fisheries located throughout the \nwatershed.  The recreational species in the watershed include whitetail deer, turkey, \nrabbit, ducks, dove, bass, bream, catfish and feral hogs.  Wildlife is very important to \nthis watershed.  In addition to hunting and fishing on private lands, there are fee-\nbased operations located in the watershed.  One of these operations is a quail \nhunting enterprise. \n \n\n 16 \nC. Designated Use Classification and Water Quality \nStandards \n The designated beneficial uses of the waterbodies in the Magee’s Creek \nWatershed are primary contact and aquatic life support.   The water quality \nstandards for Magees Creek Watershed are listed below in Table 7.1. \n \nTable 7.1 Water Quality Standard \nParameter Beneficial Use Water Quality Criteria to Meet \nUse \nFecal Coliform Contact Recreation Fecal coliform colony counts not to \nexceed a mean of 200 per 100ml \nbased on a minimum of 5 samples \ntaken over a 30-day period with no \nless than 12 hours between \nindividual samples, nor shall the \nsamples examined during a 30-day \nperiod exceed 400 per 100ml more \nthan 10 percent of the time. \n   \n \nD. Current Status of Water Bodies in the Magees \nCreek Watershed \n \n Magees Creek is listed on the states 303d list for segment MS190E with the \nimpairment being fecal coliform. (See map 5.3 Impaired Segment of Magees Creek.) \n \nE. TMDLs \n \n \nThere has been a TMDL approved by EPA for Magees Creek in Walthall \nCounty, Mississippi Watershed ID-MS190E, HUC-03180005.  The impairment for \nthis waterbody is fecal coliform.  The sources of the impairment are as follows: \nwildlife, failing septic systems, land application of poultry litter and cattle manure, \nurban development, and permitted facilities discharging into the water source.  There \nis a 45% reduction recommended in the TMDL.  Education projects that teach best \nmanagement practices regarding urban bacteria loads, manure management, and \nseptic tank management should be used as tools for reducing the nonpoint source \ncontributions.  There will be no NPDES permit applications approved that do not \nplan to meet the water quality standards for disinfection. \n \n \n \n\n 17 \nVIII. WATERSHED MANAGEMENT  \nACTIONS \n \nFECAL COLIFORM \n \nA. Stakeholder Interests \n \n \nOne of the major interests of the stakeholders is the fecal coliform loading into \nMagees Creek.  This is the reason for Magees Creek being listed on Mississippi’s \n303(d) list of impaired waters.  \n \nB. Goals/Objectives \n \n The goal and objective of this management action is to reduce the fecal \ncoliform loading coming from agricultural lands.  Reducing this ag contribution may \nbe sufficient enough to remove Magees Creek from the state’s 303(d) list. \n \nC. Management Actions \n \n The management action that will be taken to address fecal coliform is the \ninstallation of agricultural BMPs.  These BMPs include but are not limited to:  \n• Critical Area Planting,  \n• Grade Stabilization Structures,  \n• Pasture and Hayland Planting, \n• Nutrient Management,  \n• Fencing,  \n• Stream Crossings,  \n• Grassed Waterways,  \n• Water and Sediment Control Basins,  \n• Livestock Watering Ponds,  \n• Tank or Troughs as Alternative Water Sources, \n•  Lagoons,  \n• Animal Waste Control Facilities,  \n• Prescribed Grazing, \n•  Tree Planting,  \n• Chiseling and Subsoiling, and  \n• Alum Treatment of Poultry Houses.  \n \n  These BMPs will be installed by cooperating landowners in the watershed.  \nThe program that these BMPS will be installed under is the MSWCC cost-share \n\n 18 \nprogram. The Natural Resources Conservation Service (NRCS) will provide the \ntechnical/planning assistance for this project.  Most of the BMPs that will be installed \nthat are permanent structures must be maintained by the landowner for a period of \n10 years.  NRCS identified landowners in the watershed that had agricultural land \nusing maps provided by the Mississippi Department of Environmental Quality \n(MDEQ).   \n \n \nD. Project Tracking/Assessment of Progress \n \n The Magees Creek 319 project began in October 2005 and is scheduled to \nend August 2008.  The milestones for the Magees Creek Watershed 319 project are \nlisted below:  \n \n1. Sign grant contract with MS Department of Environmental Quality.  (Month 0) \n \n2. Determine priority areas that are contributing significant pollutant loads in the \nwatershed. This will be carried out with assistance from the Magees Creek \nWIT.  (Month 1) \n \n3. Issue policies and procedures for implementing the project to the SWCD \noffice. (Month 1) \n \n4. Meet with the board of SWCD commissioners to get their understanding of \ntheir responsibilities and participation. (Month 2) \n \n5. Provide training to district staff. (Month 2-3) \n \n6. Assist in establishing an evaluation system in conjunction with the MS \nDepartment of Environmental Quality to indicate the benefits of the project. \n(Month 2-3) \n \n7. Conduct a landowner meeting to inform potential participants about the \nproject. (Month 3)     \n \n8. Secure commitments from several landowners and operators who are willing \nto participate in the project. (Month 3-4)  \n \n9. Assist participants in developing a conservation plan and applying best \nmanagement practices. (Month 4-12) \n \n10. Establish at least one demonstration farm. (Month 4-12)  \n \n11. Document pre-existing site conditions. (Before and after photo documentation \nwill be conducted). (Month 2-12) \n\n 19 \n \n12. Accelerate conservation planning and application assistance.  Special effort \nwill be made to complete conservation plans during this time frame.  \n (Month 13-24) \n \n13. Conduct at least one informational field day/tour to inform the public about the \nproject. (Month 13-24) \n \n14. Establish at least one demonstration farm. (Month 13-24) \n \n15. As requested, assist MDEQ with evaluations. (Month 0-36) \n \n16. Collect GPS coordinates and other data required by MDEQ on all BMPs \ninstalled in the project. (Month 0-36) \n \n17. Assemble data on the amount of soil saved. (Month 0-36)  \n \n18. Erect project roadside signs which designate where water quality practices \nare in progress or have been completed. (Month 4-36) \n \n19. Provide continued conservation planning and application assistance to \nparticipants. (Month 25-36) \n \n20. Review the status of applying best management practices to reach the \nobjectives of the project. (Month 25)  \n \n21. Based upon the needs and finding of milestone 18, assistance in planning \nand/or application will be redirected and/or accelerated. (Month 25-36) \n \n22. Publish at least four articles about the project. (Month 0-36) \n \n23. Publicity of the project will be increased; at least one field day/tour will be \nconducted and at least 1,000 fact sheets will be developed and distributed. \n(Month 25-36)  \n \n24. Bi-annual reports will be made to MDEQ. (Month 0-36) \n \n25. Make final report to MDEQ. (Month 36) \n \n \n \n \n \n \n\n 20 \nE. Desired Results/Benefits \n The desired benefit of this project will be to reduce the fecal coliform loading \nby 45% to implement the TMDL.  Hopefully, this will reduce the pathogen loadings \nsufficiently enough to  remove Magees Creek from the state’s 303(d) list. \n \nF. Roles/Responsibilities \n There are several different groups with responsibilities in this watershed.  \nMSWCC has the responsibility and role of handling all payments and recordkeeping \nthat goes along with the 319 project.  The Walthall County Soil and Water \nConservation District and the local NRCS staff have the role of technical assistance \non the project.  Landowners have the responsibility of implementation of BMPs in the \nproject area.  The Magees Creek Watershed Implementation Team has the role of \nhelping compile all the information needed to write the Watershed Implementation \nPlan.  MSWCC also has the responsibility of compiling all the information and writing \nthe initial plan for the watershed. \n \nG. Budget \n The table below shows a list of potential Best Management Practices to be \ninstalled with the 319 grant.   \nTable 8.1 Funded 319 Project Budget for BMPs \nPractice Area \nAffected \nBMP \nCost \nBMP Total \nCritical Area Planting 25 acres $200/ac $5,000 \nGrade Stabilization Structure 5 structures $1,500/ea $7,500 \nPasture & Hayland Planting 75 acres $100/ac $7,500 \nWater and Sediment Control \nBasin \n3 basins $2,500/ea $7,500 \nNutrient Management 500 acres $154/ac $77,000 \nLivestock Watering Pond 10 ponds $3,000/ea $30,000 \nTank/Trough 10 tanks $2,000/ea $20,000 \nStream Crossing 5 crossings $3,000/ea $15,000 \nFencing 40,000 feet $1.10/ft $44,000 \nWaste Treatment Lagoon 2 lagoons $17,000/ea $34,000 \nWaste Storage Facility 2 facilities $17,000/ea $34,000 \nComposting Facilities 4 facilities $17,000/ea $68,000 \nGrassed Waterways 5 acres $500/ac $2,500 \nPrescribed Grazing 200 acres $11/ac $6,600 \nIncinerator 5 units $5,500 $27,500 \nTree Planting 100 acres $94/ac $9,400 \nAlum Treatment in Poultry Houses 36 houses $2000/ea $72,000 \nConservation Cover 200 acres $176/ac $35,200 \nChiseling and Subsoiling 200 acres $10/ac $2,000 \nTotal   $504,700 \n\n 21 \nTable 8.2 Contractual Services for BMP Design \nItem Cost \nContractual Services for BMP Design $8,333 \nTotal $8,333 \n \nTable 8.3 Technical Assistance \nItem Cost \nTechnical Assistance $25,000 \nTotal $25,000 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 22 \nIX. EDUCATION/OUTREACH ACTIVITIES \n \nA. Educational Activities to be Implemented \n \n The overall objective of community education in the Magees Creek watershed \nis to develop an atmosphere that promotes sustained, long-term protection and \nimprovement of aquatic resources in the watershed. Specific objectives of \neducation efforts in the watershed include the following. \n \n• Increase public awareness of the value of clean water. \n• Increase public awareness of how common activities affect water \nquality and critical flora and fauna. \n• Increase public awareness of how BMPs can be used to reduce \nnegative water quality and habitat effects. \n• Increase public awareness of the long term environmental and \neconomic advantages of protecting and improving water quality and \nhabitat in the Magees Creek watershed. \n \n1. Signage \n  Signs identifying the BMPs that have been installed will be erected in \nareas where they will be visible and landowners will allow the signs to be \nerected. \n \n  Primary partners- Mississippi Soil and Water Conservation \n Commission, Mississippi Department of Environmental Quality, Walthall \n County Soil and Water Conservation District, Natural Resources \n Conservation Service, and Environmental Protection Agency. \n \n a. Indicators   \n  \nThere will be field days held to show other landowners and the  \n interested public these BMPs.  Participants will be counted at these field  \n days.  Also, these signs will be seen by individuals riding through the \n watershed.  We have no way of documenting the number of people who will \n actually see these BMP signs while traveling.  \n \n \n\n 23 \n b. Schedule \n  \nThe BMP signs will be erected as practices are completed and  \n  landowners agree to placing the signs on their property. \n \n c. Budget  \nTable 9.1 Projected Costs for Signage. \nItem Unit Cost Total Cost \nSigns 20 $100.00 $2,000.00 \nTotal   $2,000.00 \n \n \n2. Field Days \n There will be at least two field days held to highlight the BMPs that have been \ninstalled during the project period.  This will allow other landowners and the \ninterested public to view some of the practices that are being installed to benefit \nwater quality in the watershed. \n \n \n Primary partners- Mississippi Soil and Water Conservation Commission, \nMississippi Department of Environmental Quality, Walthall County Soil and Water \nConservation District, Natural Resources Conservation Service ,and  \nEnvironmental Protection Agency \n \n a.    Indicators \n  \nAttendance at these field days will be documented and reported to \n MDEQ. The number of BMPs implemented as a result of that landowner  \n attending the field day will also be documented. \n \n b. Schedule \n  \nField days in the watershed will take place in 2007-2008. \n  \n  \n \n\n 24 \nc. Budget \nTable 9.2 Projected Costs for Field Days. \nItem Units Cost Total Cost \nEvent Flyers 375 .80/each $300.00 \nMailing/Delivery 375 .39/each $146.25 \nMiscellaneous \n(facilities, supplies) \n2 $6,6110.37 $13,220.74 \nTotal   $13,667.00 \n  \n3. Fact Sheets \n  A fact sheet will be developed at the end of the project.  This fact sheet \nwill contain information about the watershed, the number  and type of BMPs that \nwere installed, the number of tons of soil being saved, and the number of acres \nimpacted by the BMPs. \n \n Primary Partners- Mississippi Soil and Water Conservation Commission, \nWalthall County Soil and Water Conservation District, and Natural Resources \nConservation Service. \n \n a.    Indicators \n  Fact sheets will be handed out at the final field day and will also be \n available in the district office.   \n \n b. Schedule \n  \nThe fact sheet will be developed once all BMPs are in place to get a \n total on all tons of soil saved, the correct number of BMPs installed, and the \n total number of acres affected by the project. \n \n c. Budget    \nTable 9.3 Projected Costs for Fact Sheets. \nItem Unit Cost Total Cost \nPrinting 1,000 1.00/each $1,000.00 \nTotal   $1,000.00 \n\n 25 \n4. Adopt-A-Stream \n  There will be at least one Adopt-A-Stream workshop conducted for the \nwatershed.  Adopt-A-Stream is a program that promotes environmental \nstewardship through training workshops, outdoor field activities, and by \nintroducing participants to watershed action projects.  One and two-day \nworkshops inform participants about watershed topics such as stream health, \nstream ecology, aquatic life and water chemistry.  \n \n Primary Partners- Mississippi Department of Environmental Quality and \nMississippi Wildlife Federation. \n a. Indicators \n  \nThe number of participants for the workshop will be documented.           \n Also, the number of participants that move forward with the stream stewardship \n project will be documented. \n \n b. Schedule \n  \nThis workshop will take place before August 2008. \n   \n c. Budget \nTable 9.4 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total \nCost \nAdopt A Stream \nWorkshop \n1 day \nworkshop \n$1,500.00 $1,500.00 \nTotal   $1,500.00 \n \n \n5. Project Learning Tree \n  At least one Project Learning Tree (PLT) workshop will be held for the \nwatershed.  PLT is an award winning education program designed for teachers \nand other educators, parents, and community leaders working with youth from \npre-K to 8\nth\n grade. PLT activity guides and modules are not sold, but are earned \nby educators who attend a six-hour workshop.  The PLT activity guide is a 400 \npage book containing 96 activities written in the form of lesson plans.  PLT’s goal \nis to “teach students HOW to think, not WHAT to think about environmental \nissues.” \n\n 26 \n  Primary Partners- Mississippi Department of Environmental Quality and \nMississippi Forestry Commission. \n \n a.    Indicators \n  The number of participants for the workshop will be documented. \n \n b. Schedule \n  \nThis workshop will take place before August 2008. \n \n c.   Budget \nTable 9.5 Projected Costs for Project Learning Tree. \nItem Unit Cost Total \nCost \nPLT Workshop 1 workshop $1,350.00 $1,350.00 \nTotal   $1,350.00 \n \n \n6.    Watershed Harmony Puppet Show \n  At least one Watershed Harmony puppet show will be held in the \nwatershed.  Watershed Harmony is a musical puppet performance aligning with \nthe fourth and fifth grade Mississippi Framework and National Science \nStandards.  Audiences of all ages will delight in environmental stewardship \nthrough this toe tapping musical.  Performances are not only enjoyed by school \ngroups, but also by adults attending teacher workshops, civic clubs, and \nconferences.  This program serves to inform, excite, and enlist the help of \ncitizens in an ongoing effort to promote water quality in their communities. \n \n Primary Partners- Mississippi Department of Environmental Quality and \nBayou Town Productions. \n \n a.    Indicators \n The number of participants will be documented and submitted to \nMDEQ.   \n \n\n 27 \n  \n b. Schedule \n  \nWatershed Harmony will be presented before August 2008. \n \n c. Budget \nTable 9.6 Projected Costs for Watershed Harmony Puppet Show \n Item Unit Cost Total \nCost \nWatershed Harmony Puppet Show 1 show $500.00 $500.00 \nTotal   $500.00 \n \n \n \n7. Total Projected Cost of Education/Outreach Activities \n  \nTable 9.7 Total Projected Education Budget  \nItem Unit Cost Total Cost \nSignage   $2,000.00 \nField Days   $13,667.00 \nFact Sheets   $1,000.00 \nAdopt-A-Stream   $1,500.00 \nProject Learning Tree   $1,350.00 \nWatershed Harmony Puppet Show   $500.00 \nTotal   $20,017.00 \n \n \n \n \n \n \n\n 28 \n8. Total Budget for Magees Creek Watershed   \n  Implementation Plan \n \n Table 9.8 Magees Creek Watershed Implementation Plan Total Budget \nItem Total Cost \nBMPs $504,767.00 \nContractual Services $8,333.00 \nTechnical Assistance $25,000.00 \nEducation $20,017.00 \nTotal $558,117.00 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 29 \nX. EVALUATION \n \nA. Plan Evaluation Procedure \n \nThis watershed implementation plan will be evaluated and revised every five \nyears or on an as needed basis.  The evaluation of this plan will be organized by \nthe Magees Creek Implementation Team (see Chapter II)  .   At this time, the \nImplementation Team will develop a detailed schedule for review and revision of \nthis watershed implementation plan. The Implementation Team members will be \nresponsible for notifying their stakeholders of the opportunity to propose changes \nto the watershed implementation plan. One month will be allowed for notification of \nstakeholders. \n The plan will be evaluated by the Team, or their designee, and any  interested \nstakeholders. One month will be allowed for evaluation and submittal of comments. \nTherefore, comments will be due two months after the evaluation  procedure is \ninitiated. The plan will be evaluated in two ways. First, to determine if the plan \ngoals have been achieved, and second, to determine if it reflects the current \ncondition of the watershed, state of science, and issues in the watershed. \n \n \n \nB. Implementation Evaluation Strategy \n \n  The monitoring that will take place on this project will include the \nfollowing: \n• Before and after photo documentation on a representative \n sample of the BMPs installed, \n• Before and after soil loss collection on each BMP installed, and \n•  An R5 Load Estimation Model Field Data Entry Sheet \n completed on each BMP installed.  \n Agencies responsible for implementing management activities will track \nimplementation and provide annual reports to the Basin Group III Coordinator. \nProgress will be assessed based on meeting the scheduled management activity \nmilestones outlined in Chapter VIII. Success of Section 319 funded projects in \nthe watershed will be evaluated based on the criteria specified in the project \nproposals (Appendix B). \n During 2009, the Assessment year of the Basin Group III Basin Management \nCycle, progress towards the goals of this watershed implementation plan will be \nassessed. Water quality data, as well as information on activities occurring in the \n\n 30 \nwatershed and stakeholder concerns collected during the period from 2005 \nthrough 2008, will be utilized. The criterion that will be used to determine \nprogress toward plan goals is achievement of all state water quality criteria in \npreviously impaired stream segments. Not meeting this criterion warrants \ninvestigation of the effectiveness of implementation of management practices, \nand/or the effectiveness of the management practices. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 31 \nXI. PLAN REVISION \n \nA. Plan Revision Procedure \n \n After evaluation, the watershed implementation team  will prepare a revised \nwatershed implementation plan incorporating the changes requested by the \nreviewersafter five years. At this point it may be necessary to call a meeting to \nreconcile any conflicting comments or requests for change.  \n If the evaluation criteria are all being met in Magees Creek surface waters, \nthe watershed implementation plan will be revised to address a different \nrestoration issue or issues, or to protect the water quality of the watershed. If the \nevaluation criteria for the watershed are not being met, the approach for restoring \nMagees Creek watershed will be revised based on the knowledge that has been \ngained since 2005.  \n The draft watershed implementation plan will be submitted to the \nImplementation Team, and all others who submitted comments. Within two \nweeks of receiving the draft watershed implementation plan, the Implementation \nTeam will notify their stakeholders of the availability of the revised watershed \nimplementation plan for stakeholder review. One month will be allowed for review \nof the draft. Comments will be due at the end of this review period. \n Within a month after the comments on the draft watershed implementation \nplan are received, MDEQ will prepare a DRAFT watershed implementation plan. \nThe DRAFT watershed implementation plan will be submitted to the \nImplementation Team for review and approval. After the DRAFT watershed \nimplementation plan has been approved, the Implementation Team will notify \ntheir stakeholders of the completion and availability of the DRAFT plan for use as \na guide to watershed restoration and protection activities. \n \n \n \n \n \n \n \n \n \n \n\n 32 \nXII. RESOURCES \n \nMDEQ. 2000.  Pearl River Basin Status Report 2000. Mississippi \n Department of Environmental Quality. Jackson, Mississippi. \n \nMDEQ. 2003.  Phase One Fecal Coliform TMDL for Magees  Creek, \nPearl River Basin, Walthall County, Mississippi.   Mississippi \nDeaprtment of Environmental Quality.  Jackson,   Mississippi. \n \nSCS. 1968. Soil Survey Walthall County, Mississippi. \n \n\"Natural Heritage Inventory: Search Animal Database.\" Mississippi \nMuseum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_animals.asp\n> \n \n\"Natural Heritage Inventory: Search Plant Database.\" Mississippi \nMuseum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_plants.asp\n> \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 33 \n \n \n \nAppendix A \n \n \n \nPlant and Animal Species of \nSpecial Concern \n \n \n \n \n \n \n \n \n \n\n 34 \nAnimals of Special Concern in Walthall County \nScientific Name Common Name Threatened Endangered \nACIPENSER OXYRINCHUS \nDESOTOI \nGULF STURGEON X  \nGOPHERUS POLYPHEMUS GOPHER TORTOISE X  \nMICRURUS FULVIUS EASTERN CORAL \nSNAKE \n  \nNOTURUS MUNITUS FRECKLEBELLY \nMADTOM \n  \nPROCAMBARUS PENNI PEARL BLACKWATER \nCRAYFISH \n  \n \nAt this time, there are no Plants of Special Concern in Walthall \nCounty. \n \nAnimals of Special Concern in Lawrence County \nScientific Name Common Name Threatened Endangered \nALOSA ALABAMAE ALABAMA SHAD   \nCRYSTALLARIA \nASPRELLA \nCRYSTAL DARTER   \nELANOIDES FORFICATUS SWALLOW-TAILED KITE   \nGRAPTEMYS OCULIFERA RINGED MAP TURTLE X  \nNOTURUS MUNITUS FRECKLEBELLY MADTOM   \nOBOVARIA UNICOLOR ALABAMA HICKORYNUT   \n \nPlants of Special Concern in Lawrence County \nScientific Name Common Name Threatened Endangered \nNYMPHAEA MEXICANA BANANA WATER-LILY   \nPOTAMOGETON \nEPIHYDRUS \nCREEKGRASS   \nPOTAMOGETON \nPUSILLUS VAR \nTENUISSIMUS \nSMALL PONDWEED   \n \n\n 35 \nAnimals of Special Concern in Marion County \nScientific Name Common Name Threatened Endangered \nAIMOPHILA \nAESTIVALIS \nBACHMAN'S \nSPARROW \n  \nALOSA ALABAMAE ALABAMA SHAD   \nCRYSTALLARIA \nASPRELLA \nCRYSTAL DARTER   \nGOPHERUS \nPOLYPHEMUS \nGOPHER TORTOISE X  \nGRAPTEMYS \nOCULIFERA \nRINGED MAP \nTURTLE \nX  \nMICRURUS FULVIUS EASTERN CORAL \nSNAKE \n  \nNOTROPIS \nCHALYBAEUS \nIRONCOLOR SHINER   \nNOTURUS MUNITUS FRECKLEBELLY \nMADTOM \n  \nONTHOPHAGUS \nPOLYPHEMI \nONTHOPHAGUS \nTORTOISE \nCOMMENSAL \nSCARAB BEETL \n  \nPICOIDES \nBOREALIS \nRED-COCKADED \nWOODPECKER \n X \nPITUOPHIS \nMELANOLEUCUS \nLODINGI \nBLACK PINE SNAKE   \nPROCAMBARUS \nPENNI \nPEARL \nBLACKWATER \nCRAYFISH \n  \nPSEUDOTRITON \nRUBER \nRED SALAMANDER   \nPTERONOTROPIS \nWELAKA \nBLUENOSE SHINER   \nPUMA CONCOLOR \nCORYI \nFLORIDA PANTHER  X \nURSUS \nAMERICANUS \nLUTEOLUS \nLOUISIANA BLACK \nBEAR \nX  \n \n\n 36 \nPlants of Special Concern in Marion County \nScientific Name Common Name Threatened Endangered \nALOPHIA DRUMMONDII PINEWOODS-LILY   \nCAREX BALTZELLII BALTZELL'S SEDGE   \nCAREX IMPRESSINERVIA SOUTHERN FEW-FRUITED \nSEDGE \n  \nCAREX PICTA PAINTED SEDGE   \nCORNUS ALTERNIFOLIA ALTERNATE-LEAF \nDOGWOOD \n  \nDIRCA PALUSTRIS EASTERN LEATHERWOOD   \nEULOPHIA ECRISTATA SMOOTH-LIPPED \nEULOPHIA \n  \nLILIUM SUPERBUM TURK'S-CAP LILY   \nLOBELIA \nAPPENDICULATA \nAPPENDAGED LOBELIA   \nMACRANTHERA \nFLAMMEA \nFLAME FLOWER   \nRUELLIA PEDUNCULATA \nSSP PINETORUM \nPINE BARREN RUELLIA   \nSABATIA CAMPESTRIS PRAIRIE PINK   \nSORGHASTRUM \nAPALACHICOLENSE \nOPEN INDIAN GRASS   \nSTEWARTIA \nMALACODENDRON \nSILKY CAMELLIA   \n \n \n \n \n \n \n \n \n\n 37 \n \n \n \nAppendix B \n \n \n \nFunded 319 Project Proposal \n \n \n \n \n \n \n \n\n 38 \nPROJECT TITLE: \nMagees Creek Watershed Nonpoint Source Pollution Project \n \nPROJECT ABSTRACT: \nThis project will be located in the central portion of Walthall County in Mississippi. \nThe objectives of this project will be: \n \nTo improve water quality and protect high quality waters through the \nimplementation of selected BMPs in targeted areas. \n \nTo apply Best Management Practices (BMPs) to pasture and hay lands in the \nproject area so as to reach the desired outcome of reduced cattle access to \nstreams and to reduce the amount of sediment entering streams in the \nwatershed. \n \nTo properly manage animals and animal waste. \n \nTo inform and educate the public about Best Management Practices that \nbenefit water quality. \n \nThe project cost is $ 554,767 Of this amount, $ 332,860 in 319 funds are requested \nwith the balance of   $221,907 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nMark Gilbert, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax:    (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES AND ORGANIZATIONS: \n \nWalthall County Soil and Water Conservation District; USDA Natural Resources \nConservation Service; Mississippi Department of Environmental Quality; United \nStates Geological Survey; Ms Cooperative extension Service \n \n\n 39 \nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone: (601) 354-7645 \n (601) 540-4210  (cell) \nFax:    (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nMagees Creek Watershed (031800050401, 031800050402, 031800050403, \n031800050404) \n(see attachment 1 for a maps depicting the location, 303(d) listed segment and land \nuse for the watershed) \n \nPROJECT OBJECTIVE: \n \nThe water quality impairments to be addressed by this project are fecal coliform \nbacteria and sediment.  Fecal coliform bacteria  are used as indicator organisms.  \nThey are readily identifiable and indicate the possible presence of other pathogenic \norganisms in the water body.  The Mississippi Department of Environmental Quality \n(MDEQ) has placed segment MS190E of Magees Creek River on the 1998 Section \n303(d) List of Waterbodies as an evaluated water body segment, due to pathogens. \nThe State’s 1998 303(d) list of evaluated water bodies lists the designated used of \nMagees Creek as primary contact and aquatic life support.   MDEQ has developed a \nTMDL for the listed segment of Magees Creek MDEQ and it has been targeted for \nimplementation by the Pearl River/South Independent Streams Basins Group \nmanagement team. The TMDL model indicates violation of the percent of time that \ntranscends the fecal coliform standards.  The existing condition load was based on \nthe load for the 30-days during which the critical violation occurred and resulted in \nan overall 45% reduction in sources of fecal coliform to the water body to meet the \nTMDL as determined by a thirty day sample data set that meets both portions of the \nstandards and is indicative of possible water quality conditions. (a copy of the TMDL \nis attached)   \nAnother objective of this project will be to reduce soil loss on pasture land in the \nwatershed.  BMPs listed on the following page will not only reduce nutrients and \npathogens but will also reduce the amount of sediment entering Magees Creek from \npasture land in the watershed. \n \nPROJECT DESCRIPTION: \n \n\n 40 \nThis project will implement selected Best Management Practices  (BMPs) on \ntargeted areas in the Magees Creek Watershed that will result in reduced pollutant \nloadings from agricultural nonpoint sources. The main water quality problem to be \naddressed by this project is animal waste nutrients from agricultural nonpoint \nsources.  Of primary concern are animal waste runoff and the disposing of animal \nwaste from cattle and poultry operations in the watershed. Also, soils in the \nwatershed are very erosive, with sheet and gully erosion occurring on sloping \nhayland and pastureland. Erosion is occurring from pasture and hay land in the \nproject area at the rate of 8-10 tons per acre per year.  Nutrients and pathogens \nfrom animal waste as well as sediment contained in runoff is entering  Magees \nCreek and its tributaries causing degradation of the resource base.    \nThe erosion of the soil resource base removes nutrients, reduces water holding \ncapacity, undermines plant rooting systems, reduces the soil’s organic matter \ncontent, reduces soil tilth and degrades water quality within the project area.   \nThe Magees Creek Watershed is approximately 140,000 acres.  The watershed is \npredominately rural. The current land uses in the Magees Creek Watershed include \n7,136 acres of cropland, 82,182 acres of pasture land, 46,461 acres of timber land, \n483 acres of urban land, 349 aces of barren land, 6,424 acres of wetlands and 231 \nacres of water. \n  \nThis project will be implemented in three phases.  Phase 1 will consist of \nanalyzing existing assessment data, determining target areas within the watershed \nwhere the stressors are causing the greatest damage and if the application of \nneeded Best Management Practices will yield a beneficial reduction in pollutant \nloadings.  Education and outreach activities will also be conducted during this phase \nto inform landowners in the watershed about the objectives of the project. The \nMississippi Soil and Water Conservation Commission (MSWCC) will cooperate with \nthe Mississippi Cooperative Extension Service, United States Geological Survey  \nand the Walthall County Soil and Water Conservation Districts in identifying the \nappropriate Best Management Practices for targeted areas in the watershed and \neducating landowners as to the need for their participation. \n \nPhase 2 will consist of (based upon the finding of phase 1) the application of best \nmanagement practices on targeted areas in the watershed that will result in desired \npollutant load reductions.  The Mississippi Soil and Water Conservation Commission \nwill accomplish this trough it’s water quality cost share program. In this project, \nrecords will be kept at both the state level and local level so as to determine the \nprogress being made in carrying the project out and the benefits that are being \nreceived as related to the improvement of water quality within the project.  During \nthe planning process with participants, the amount of soil loss from the area to be \ntreated with a particular BMP will be determined and recorded.  The amount of soil \nsaved as a result of applying the BMP will also be determined and recorded.  \nAdditional information will be collected on each BMP installed in the project that will \nbe provided to MDEQ and used to calculate the pollutant load reduction for each \nBMP installed.  This information will indicate the project effectiveness in reducing \n\n 41 \npollutant loadings.  Participants in the project will be required to maintain BMPs for a \nperiod of up to ten years after installation. \n \nAdditional education and outreach efforts will be conducting during this phase to \ninform and educate the public about Best Management Practices that benefit water \nquality.  This will be accomplished by the following: \nEstablishing at least 2 demonstration farms to inform the public about best \nmanagement systems. \nConduct at least 2 field day/tours during the life of the project. \nPrepare and distribute at least 1,000 fact sheets highlighting the benefits derived \nfrom the project. \nPublish at least 4 articles about the project in newsletters and local newspapers. \nErect at least 20 project roadside signs that designate where water quality practices \nare in progress or have been completed. \n \nTo address the above stated water quality problems, Best Management Practices \n(BMPs) will be installed on agricultural lands in the project area.  Potential BMPs to \nbe installed include but are not limited to: \n25 acres of critical area planting \n5 grade stabilization structures \n75 acres of pasture & hayland planting \n3water and sediment control basins \n500 acres of nutrient management/grazingland improvement \n10 livestock watering ponds \n10 watering troughs or tanks \n40,000 feet of fencing \n5 stream crossings \n2 waste treatment lagoon \n2 waste storage facility \n200 acres chiseling and subsoiling \n4 composting facilities \n5 acres of grassed waterways \n10 acres of heavy use area protection \n200 acres of prescribed grazing \n5 incinerators \n100 acres tree planting \n36 alum treatment of poultry houses \n200 acres of conservation cover \n \n \nPhase 3 will consist of post BMP monitoring to determine the pollutant load \nreductions achieved by the application of Best Management Practices.  The \nMSWCC will coordinate with the MDEQ in conducting these activities. \n \n\n 42 \nMILESTONES: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n2. Determine priority areas that are contributing significant loads in the \nwatershed.  This will be carried out with assistance from the Lower Bogue \nChitto WIT. (Month 1) \n3. Issue policies and procedures for implementing the project to the SWCD \noffice.  \n(Month 1) \n4. Meet with the board of SWCD commissioners to get their understanding of \ntheir responsibilities and participation. (Month 2) \n5. Provide training to district staff. (Month 2-3) \n6. Assist in establishing an evaluation system in conjunction with the MS \nDepartment of Environmental Quality to indicate the benefits of the project. \n(Month 2-3) \n7. Conduct a landowner meeting to inform potential participants about the \nproject.     (Month 3) \n8. Secure commitments from several landowners and operators who are willing \nto participate in the project. (Month 3-4) \n9. Assist participants in developing a conservation plan and applying best \nmanagement practices (Month 4-12) \n10. Establish at least demonstration farm (Month 4-12) \n11. Document pre-existing site conditions. (Month 2-12) (Before and after photo \ndocumentation will be conducted). \n12. Accelerate conservation planning and application assistance.  Special effort \nwill be made to complete conservation plans during this time frame. (Month \n13-24) \n13. Conduct at least 1 informational field day/tour to inform the public about the \nproject . (Month 13-24) \n14. Establish at least 1 demonstration farm. (Month 13-24) \n15. As requested, assist DEQ with evaluations. (Month 0-36) \n16. Collect GPS coordinates and other data required by MDEQ on all BMPs \ninstalled in the project. (Month 0-36) \n17. Assemble data on the amount of soil saved. (Month 0-36) \n18. Erect project roadside signs which designate where water quality practices \nare in progress or have been completed. (Month 4-36) \n19. Provide continued conservation planning and application assistance to \nparticipants. (Month 25-36) \n20. Review the status of applying best management practices to reach the \nobjectives of the project.  (Month 25) \n21. Based upon the needs and finding of milestone 18, assistance in planning \nand/or application will be redirected and/or accelerated. (Month 25-36) \n22. Publish at least 4 articles about the project. (Month 0-36) \n23. Publicity of the project will be increased; at least 1 field day/tour will be \nconducted and at least 1,000 fact sheets will be developed and distributed. \n(Month 25-36) \n\n 43 \n24. Bi-annual reports will be made to MDEQ. (Month 0-36) \n25. Make Final report to MDEQ. (Month 36) \n\n 44 \n \nCRITERIA FOR EVALUATION \n(also see Phase 1 and 3 information under Project Description) \nThe following measures and indicators of progress will be utilized to track the \nsuccess of this project: \n \nNPS Pollutant Load Reduction – the amount of soil saved as a result of the \ninstallation of best management practices (BMPs) in this project will be a direct \nindicator of sediment load reduction to Magees Creek along with it’s tributaries.  \nSince nutrients and animal waste are transported to the waters by over land flow \nalong with sediment, any reduction in sediment loadings will result in a reduction of \nnutrient loadings thereby enhancing the effectiveness and success of the project.  \nOther data collected for MDEQ will be used to calculate pollutant load reductions for \neach BMP installed in the project. \n \nImplementation of NPS Controls – this project will involve the installation of Best \nManagement Systems.  Best Management Systems are defined as a combination of \nBMPs, both structural and vegetative, which are the most practical, effective and \neconomical means of preventing or reducing pollution from nonpoint sources to a \nlevel compatible with water quality goals.  The estimated types and numbers of \nBMPs to be installed as part of  Best Management Systems are listed in the \nproject description of this proposal.  The application of best management \nsystems in the project will be the responsibility of the landowners and operators \nparticipating in the project as cooperators of the local soil and water conservation \ndistrict. \n \nPublic Education, Awareness, and Action - this project will include the establishment \nof at least 2 demonstration farms that will be used to inform the public about best \nmanagement systems.  These will be utilized during the 2 field day/tours that will be \nconducted in the project.  Also, at least 1,000 informational fact sheets highlighting \nthe benefits derived from the project will be developed and distributed as well as the \npublishing of at least 4 articles about the project in newsletters and local \nnewspapers.  At least 20 project roadside sign will be erected where water quality \npractices are installed in the project.    Other educational actions will be conducted to \nmeasure the success of the project.  These include such things as increased public \nawareness; before and after photo documentation; increased cooperation among \nagencies, associations, public bodies and educational institutions; and the economic \nbenefits of applying best management practices.  The Mississippi Soil and Water \nConservation Commission will request information through the local soil and water \nconservation district that will assist in measuring the success of the project in the \ndemonstration area. \n \nPROJECT PERIOD \n \nThe length of this project will be 3 years. \n \n\n 45 \nAttachment 1 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 46 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 47 \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 48 \n \n \n \nAppendix C \n \n \n \n \nStressors \n \n \n\n 49 \nTable 2 \nStressor Summary Table \n \n \n \n \nConcern Link/Immediate \nCause \nStressor Description of \nStressor \nLocation/Extent \nFecal coliform \nloading  \nwildlife populations, \nagricultural animal \npopulations, failing septic \nsystems, and urban \ndevelopment \nFecal \nColiform \nPermitted facilities discharging \ninto water sources, failing \nseptic systems, land \napplication of poultry litter and \ncattle manure, and urban \ndevelopment \nLocated throughout the \nwatershed- see attached \nmap (Figure 2.1) \n     \n\n 50 \n \n \n \n \nAppendix D \n \n \n \n \n \nChecklist of Watershed \nImplementation Elements \n \n \n \n \n \n\n 51 \nTable D. 9 Key Elements of a Watershed Plan for 319 Grant  \n \nRequired WIP Elements for 319 Grant \n \nLocation in Watershed Implementation Plan \n \n1. Watershed Description and Background \n \nChapter V \n \n2.  Implementation \n \nChapter VIII Section A Subsection 3 \n \n3. Project Goals \n \nChapter VIII Section A Subsections 2 and 5 \n \n4. Project Costs \nChapter VIII Section A Subsection 7 \nChapter IX Section A Subsection 7 \n \n5. Education and Outreach \n \nChapter IX \n \n6. Implementation Schedule \n \nChapter VIII Section A Subsection 4 \n \n7. Milestones \n \nChapter VIII Section A Subsection 4 \n \n8. Adaptations and Revisions \n \nChapter X Section A, Chapter XI Section A \n \n9. Monitoring \n \nChapter X Section B Subsections 1 and 2 \n ",
  "metadata": {
    "id": "magees-creek-watershed-plan-2007",
    "originalName": "Magees_Creek_Watershed_Plan_2007.pdf",
    "size": 5037414,
    "uploadedAt": "2025-10-06T01:30:37.525Z",
    "pageCount": 51,
    "info": {}
  }
}