{
  "id": "old-fort-bayou-watershed-plan-2019-4",
  "rawText": "\n\n \n \nWatershed Implementation Plan \nOld Fort Bayou \nDecember 2018 \n \n \n \n \n \n \n \n                       \n \n\nPrepared For: \n \nLand Trust for the Mississippi Coastal Plain \nP.O. Box 245 \nBiloxi, Mississippi 39533 \n228.435.9191 \nwww.ltmpc.org \n \n \n \nPrepared By: \n \nGulf Coast Community Design Studio \nMississippi State University, College of Architecture, Art + Design \n769 Howard Avenue \nBiloxi, Mississippi 39530 \n228.436.4661 \nwww.gccds.org \n \n \n \n \n \nWith Acknowledgements for Contributions Made By: \n \nCity of Ocean Springs \n1018 Porter Avenue \nOcean Springs, Mississippi 39564 \n \nCity of Gautier \n3330 US-90  \nGautier, Mississippi 39553 \n \nJackson County \n2915 Canty Street \nPascagoula, Mississippi 39568 \n \n \nSteering, Technical, and Education and Outreach Committees \n  \n\nTable of Contents \nSection 1: Watershed Planning \n1.1 Development of a WIP 1 \n1 \n2 \n1.1.1 What is a WIP? \n1.1.2 Why create a WIP for Old Fort Bayou? \n1.1.3 Process and Acknowledgments          \n4 \n1.2 Looking Forward 5 \n1.2.1 Watershed Implementation Team 5 \n1.2.2 Assets, Concerns and Challenges 7 \n1.2.3 Vision 7 \n1.2.4 Goals and Objectives 8 \n1.3 Related Plans and Projects 9 \nSection 2: Watershed Assessment \n2.1 History and Land Use 11 \n2.1.2 Historical Context 11 \n2.1.3 Current and Future Land Use 15 \n2.2 Human Resources  17 \n2.2.1 Demographics 17 \n2.2.2 Municipal  17 \n2.2.3 Civic Infrastructure 18 \n2.3 Physical Setting 19 \n2.3.1 Soils and Geology  19 \n2.3.2 Ecoregion  22 \n2.3.3 Wetlands  22 \n2.3.4 Climate and Climate Change 24 \n2.3.5 Conservation Mapping 26 \n\n2.4 Water Resources        28 \n2.4.1 Groundwater       28 \n2.4.2 Access and Recreation      29 \n2.4.3 Wildlife and Fisheries      30 \n2.4.4 Designated Use Classifications and Water Quality Standards 31 \n2.4.5 Current Status of Water Bodies     31 \n  2.4.6 Sources of Pollutions      34 \n \nSection 3: Management and Monitoring Plans \n3.1 Watershed Management Actions      39 \n3.1.1 Current Management Actions      39 \n3.1.2 Planned Management Actions      42 \n3.1.3 Education and Outreach Activities     54 \n3.2 Plan Evaluation and Revision      57 \n3.2.1 Monitoring Plan        57 \n3.2.2 Adaptive Management and Plan Revisions    58 \n \nAppendices: \nA: Soil Survey \nB: Mississippi National Heritage Inventory \nC: Federally Endangered, Threatened, and Candidate Species in Mississippi \nD: Old Fort Bayou Fecal Coliform Bacteria Total Maximum Daily Load Reduction Plan \nE: B-WET Old Fort Bayou Watershed Education & Civic Engagement \nF: Management Actions \nG: Old Fort Bayou Blueway Guide \nH: Model Ordinance for Florida-Friendly Fertilizer Use on Urban Landscapes \nI: Sample Boy Scout Projects for Old Fort Bayou Watershed \nJ: Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint Source Pollution Demonstration Project \nFinal Report \nK: Jackson County and Ocean Springs MS4 2017 Annual Reports \nL: Case Study - The Preserve Golf Club \n \n\n1 \n \nSection 1: Watershed Planning \n \n1.1 Development of a WIP \n1.1.1 What is a WIP? \nState and federal agencies and organizations have been moving toward a watershed approach \nto water resource management since the late 1980’s.\n1\n  The watershed approach offers a flexible \nframework to address water quality and other issues within a specific drainage area.  \nManagement actions taken within a specific watershed are usually pursuant to an approved \nwatershed plan.  A watershed implementation plan is a strategy that provides assessment and \nmanagement information for a geographically defined watershed, including analyses, actions, \nparticipants and resources related to developing and implementing the plan.\n2\n   \n \nWatershed plans vary to a degree based on the specific water resource impairments identified \nfor the watershed and the concerns and goals of stakeholders involved in the planning process.  \nMost watershed plans, however, include a vision, goals, assessment of current pollutant loads, \nfuture load reductions expected from implementing best management practice, a strategy for \neducating the public, and expectations for monitoring and adapting the plan.  In addition, the \nU.S. Environmental Protection Agency (EPA) requires nine elements be included in any \nwatershed plan funded with incremental Clean Water Act Section 319 funds and strongly \nrecommends they be included in all watershed plans intended to address water quality \nimpairments (See Table 1).\n3\n \n \nTable 1: Cross Walk for Required 9 Key Elements for WIP \nRequired 9 Key Elements for 319 Grant Location in WIP \nCauses and Sources Section 2: Watershed Assessment \nExpected Load Reductions \nAppendix D: Old Fort Bayou Fecal Coliform Bacteria Total \nMaximum Daily Load Reduction Plan \nNPS Management Measures Appendix F: Management Actions \nProject Costs and Implementing Authorities Appendix F: Management Actions \nEducation and Outreach \nSection 3.1.2:  Education and Outreach Activities and \nAppendix F: Management Actions \nImplementation Schedule Appendix F: Management Actions \nMilestones Appendix F: Management Actions \nAdaptations and Revisions \nSection 3.2.2: Adaptive Management and Plan Revision \nand Appendix F: Management Actions \nMonitoring Section 3.2.1: Monitoring Plan  \n \n \nStates are encouraged to develop statewide watershed planning frameworks to guide \nwatershed plans in their jurisdictions.  In 2008 the Mississippi Department of Environmental \n\n2 \n \nQuality’s (MDEQ) Basin Management Branch published “Guidance for Developing A Watershed \nImplementation Plan.”  This guide, including the nine elements defined by the EPA for \nwatershed plans receiving Section 319 funding, provides the framework for developing the Old \nFort Bayou Watershed Implementation Plan. \n \n1.1.2 Why create a WIP for Old Fort Bayou? \nDeveloping a watershed plan for Old Fort Bayou Watershed is a key step in implementing the \nCoastal Nutrient Reduction Strategy and improving water quality in the watershed.\n4\n  The Old \nFort Bayou Watershed (HUC 031700090604) is 32,082 acres and includes parts of the City of \nOcean Springs, the City of Gautier and Jackson County.  See Figure 1.  Old Fort Bayou \n(Waterbody ID MS118M1) is a tributary of the Back Bay of Biloxi and Biloxi Bay and, as a result, \nwas listed on the EPA’s 1998 Section 303(d) list of impaired waterbodies for fecal coliform levels \nthat did not meet water quality standards.  Results were determined based on monitoring and \nmodeling.\n5\n  NPDES permitted sites were included in the modeling, but the results showed that \nover 97% of the allocated load was due to nonpoint sources and did not come from a single \nsource.\n6\n  Fecal coliform is an indicator of pathogenic bacteria and can come from a variety of \nnonpoint sources including livestock, pet waste and faulty septic systems.  Nutrients and \nsediment were not monitored in the study, but given the urban nature of the watershed and \ncontinuing residential and commercial development, they are likely environmental stressors in \nthe watershed. These nonpoint source pollutants can come from excess fertilizers, herbicides \nand insecticides from agricultural lands and residential areas; oil, grease and toxic chemicals \nfrom urban runoff; and sediment from improperly managed construction sites, crop and forest \nlands, and eroding streambanks.  Addressing causes of nonpoint source pollution in Old Fort \nBayou Watershed requires a holistic approach to develop solutions is a primary benefit of \ncreating a watershed plan. \n \nA watershed action plan was completed for the Old Fort Bayou Watershed in 2007.  The plan \nwas sponsored by the Land Trust for the Mississippi Coastal Plain with funding assistance from \nthe EPA and technical assistance from MDEQ’s Coastal Streams Basin Team.  The planning \nprocess included significant stakeholder participation, but there were limited resources \navailable at the time for mapping and analysis and the action plan did not have all nine elements \nof watershed planning required by the EPA for Section 319 funding and now recommended for \nall watershed plans intended to address water quality impairments.   This Watershed \nImplementation Plan for Old Fort Bayou Watershed serves to update the existing action plan to \ninclude these nine elements of watershed planning, re-engage stakeholders in the watershed, \ninclude significant mapping and analysis using best available data in GIS, and address the TMDL \nfor fecal coliform.   \n \n \n \n \n \n \n \n \n \n \n\n3 \n \nFigure 1: Old Fort Bayou Watershed \n \n\n4 \n \nA significant amount of resources have and will be directed to priority watersheds along the \nMississippi Gulf Coast to improve water quality and help coastal ecosystems recover following \nthe Deepwater Horizon Oil Spill.  Old Fort Bayou was designated as one of Mississippi’s priority \nwatershed in MDEQ’s Nonpoint Source Pollution Control Section 319(h) Grant Program Work \nPlan for Grant Years 2018 and 2019.\n7\n  An approved Watershed Implementation Plan and \norganized partnership for Old Fort Bayou Watershed will improve the chances of bringing \nfunding to the area. \n \nThe Old Fort Bayou Watershed Implementation Plan will also help coordinate and build \nmomentum around the many conservation activities already taking place in the watershed.  The \nNatural Resource Conservation Service (NRCS), Jackson County Soil and Water Conservation \nDistrict (SWCD), and Mississippi Soil and Water Conservation Commission (SWCC) are actively \nworking in the watershed.  The Land Trust for the Mississippi Coastal Plain (LTMCP), The Nature \nConservancy (TNC) and the U.S Fish and Wildlife Service protect and manage a significant \namount of acreage in the watershed.  The Director of Golf Operations at The Preserve Golf Club \ncontinues to implement Best Management Practices (BMP) that forward the Club’s designation \nas certified Audubon Signature Sanctuary and is a leader in developing the BMP manual for Golf \nCourse BMPs in Louisiana and Mississippi.  Current activities and related plans are further \ndiscussed in Section 1.3. \n \n1.1.3 Process and Acknowledgements \nIn May 2018, MDEQ enlisted the Land Trust for the Mississippi Coastal Plain (LTMCP), in \npartnership with Mississippi State University’s Gulf Coast Community Design Studio, to facilitate \nthe development of a Watershed Implementation Plan for Old Fort Bayou Watershed.  The \nWatershed Implementation Plan is an update to the 2007 Action Plan for Old Fort Bayou \nWatershed that was facilitated by LTMCP.  This Old Fort Bayou Watershed Implementation Plan \nis funded partly through a U.S. Environmental Protection Agency (EPA) FY2015 Nonpoint Source \nGrant (#C999486615), CFDA 66.460, Nonpoint Source Implementation, awarded on August 18, \n2015.   \n \nThe first step in the planning process was to assemble a Watershed Implementation Team \nrepresenting various stakeholders in Old Fort Bayou Watershed.  See Section 1.2.1.  This team \nincludes a Steering and Technical Advisory Committee made up primarily of local leadership, \nstaff from various public agencies and private firms with expertise related to the watershed \nplanning, and residents and an Education and Outreach Subcommittee to guide the education \nand public engagement strategy. \n \nThe Steering and Technical Advisory Committee first met on June 27, 2018 to revisit priorities \nand goals identified in the 2007 Action Plan based on current conditions.  Information from this \nworking meeting was used to identify current challenges and opportunities and develop a vision \nand goals for watershed planning in Old Fort Bayou to guide the committee and future work. \nSee Sections 1.2.2 – 1.2.4.  The Steering and Technical Advisory Committee then set to work \ncollecting and analyzing available data related to Old Fort Bayou Watershed and participated in \na day-long boat trip to explore and document current conditions from the water on August 24, \n2018.  This information is included in Section 2 and has informed the management and \nmonitoring plans included in Section 3.   \n \n\n5 \n \nBMI Environmental Services, LLC, in partnership with Nutter & Associates was hired as a project \nconsultant between August and December 2018 to analyze available water quality data for Old \nFort Bayou as compared to the TMDL and approved thresholds.  See Appendix D: Old Fort Bayou \nFecal Coliform Bacteria Total Maximum Daily Load Reduction Plan.   \n \nGCCDS also secured a grant through the National Oceanic and Atmospheric Administration’s \n(NOAA) Gulf of Mexico Bay Watershed Training and Education Program (B-WET) to work with \nstudents at St. Martin High School.  St. Martin High School is adjacent to Old Fort Bayou and was \nan ideal setting to start engaging students and the larger community around stormwater and \nwater quality issues and opportunities for improvement in the watershed.  Over the course of \nthe fall term, students did water quality testing at and learned about BMPs at two sites on Old \nFort Bayou.  Student work was presented at the final Watershed Advisory Team Meeting on \nDecember 17, 2018 and has been incorporated throughout the plan from the visioning and goal \nsetting to data collection and recommendations.  More information about the year-long project \nis included in Appendix E.  In addition to student involvement, several teachers and \nadministrators from St. Martin High School and Jackson County School District served on the \nEducation Subcommittee.  The Education Subcommittee was critical to reviewing the education \nand outreach-related strategies included in the 2007 Action Plan and providing \nrecommendations for future activities included in Section 3.1.3. \n \n1.2 Looking Forward \n1.2.1 Watershed Implementation Team \nSteering & Technical Advisory Committee \nAnkerson Scott City of Gautier \nBaker Jessica Jackson County \nBauman Kacie National Wild Turkey Federation \nBrown Donna Gulf Hills Hotel & Conference Center \nCatchot Marcus Jackson County \nChubb Patrick Mississippi Power \nCoats Michele Jackson County \nColeman Lindsey Jackson County Soil and Water Conservation District \nDickerson Cody City of Gautier \nFranklin Terry City of Ocean Springs \nFreiman Mike Mississippi Department of Environmental Quality \nGalle Edward Jackson County Soil & Water Conservation District \nGreco Tony Nutter & Associates \nHereford Scott Mississippi Sandhill Crane National Wildlife Refuge \nHolden Linda Landowner, Jackson County \nIvy Nick MS Soil and Water Conservation Commission \nKelly Jim 3Point Eco-Logical, LLC \nKnight Charles MS Department of Wildlife, Fisheries and Parks \nLewis Larry BMI Environmental Services \nLott John MS Natural Resources Conservation Service \nMartin Carolyn City of Ocean Springs \n\n6 \n \nMayson Frazer Nutter & Associates \nMcLeod Caitlin MSU Extension - Jackson County \nMiddleton Lance MS Soil and Water Conservation Commission \nMiles Stephen The Preserve Golf Club/ LA-MS Golf Course \nSuperintendents Association \nMiller Kimberly Allen Engineering (Gautier and Ocean Springs) \nMohrman Tom The Nature Conservancy of Mississippi \nMorgan Ramona City of Gautier \nMorgan Wade City of Ocean Springs \nParshotam Ajay Mississippi Department of Environmental Quality \nPerkins Adriene Mississippi Department of Environmental Quality \nPerrott Coen Mississippi Department of Environmental Quality \nPhillips Jereme Mississippi Sandhill Crane National Wildlife Refuge \nPrice Rhonda Mississippi Department of Marine Resources \nSegrest Natalie Mississippi Department of Environmental Quality \nSparks Eric MSU Coastal Research & Extension Center \nSteckler Judy Land Trust for the Mississippi Coastal Plain \nSmith-Incer Liz National Park Service \nStringfellow Darrell Jackson County \nThompson Charles Mississippi Department of Environmental Quality \nUpton Doug Mississippi Department of Environmental Quality \nWaldrup Chad MS Natural Resources Conservation Service \nWittmann Jennifer MS Department of Marine Resources \nWilliams Darryl EPA Region IV \n \n \nEducation and Outreach Subcommittee \n \nBanks Amber St. Martin High School \nBaker Jessica Jackson County \nColeman Lindsey Jackson County Soil and Water Conservation District \nCulver Michelle EPA Gulf of Mexico Program Fellow \nGoyette Nick Land Trust for the Mississippi Coastal Plain \nHeise Mike St. Martin High School \nHolland Dina St. Martin High School \nMiddleton Lance MS Soil and Water Conservation Commission \nMiles Stephen The Preserve Golf Club/ LA-MS Golf Course \nSuperintendents Association \nMorgan Wade City of Ocean Springs \nParton Yvonne Ocean Springs Library System \nRivers Chris St. Martin High School \nScarborough Shea St. Martin High School \nSchadler Cherie MDEQ Mobile Classroom \n\n7 \n \nSmith-Incer Liz National Park Service \nSteckler Judy Land Trust for the Mississippi Coastal Plain \nVeeder Debra Adopt-a-Stream/MS Department of Wildlife, Fisheries and \nParks \nWells Melissa Mississippi Department of Environmental Quality \nWestfall Penny Jackson County School District \nWyman Tracy Gulf Coast Community Design Studio, MSU \n \n \n1.2.2 Assets, Concerns and Challenges \nThe assets and challenges noted below were documented at the June 27, 2018 meeting of the \nOld Fort Bayou Steering and Technical Advisory Committee. For this exercise, committee \nmembers were asked to revisit and rank the priorities identified in the 2007 Action Plan and add \nany additional priorities. \nAssets to be Protected: \n• Marsh areas and streamside buffers \n• Vistas and intrinsic beauty \n• Public access to the bayou and status as blueway \n• Greenspace and land in conservation \n• Rural character of upper watershed \n \nConcerns/Challenges: \n• Lack of public awareness \n• Lack of water quality data and monitoring \n• Erosion/sedimentation from development \n• Lack of knowledge and infrequent use of Low Impact Development strategies \n• Protection of marsh and streamside buffers \n• Coordination of planning efforts (comprehensive planning, watershed planning, etc.) \n• Enforcement of ordinances intended to protect watershed and water quality \n• Lack of funding and/or prioritization of funding for watershed-related projects \n \n \n1.2.3 Vision \nThe vision statement for Old Fort Bayou Watershed as noted below is a compilation of input \ndocumented at the June 27, 2018 meeting of the Old Fort Bayou Steering and Technical \nAdvisory Committee and from the 80 students who participated in the NOAA Gulf of Mexico Bay \nWatershed Education and Training Program during the fall term at St. Martin High School.  \nThe community envisions a cleaner watershed for healthier humans and \necosystems; where residents and visitors have access to the bayou and \nwholesome recreational opportunities; and where stakeholders are educated \nand actively engaged in protecting the watershed. \n \n\n8 \n \n1.2.4 Goals and Objectives \nThis WIP will address the Total Maximum Daily Load (TMDL) for fecal coliform for listed \ntributaries to the Back Bay of Biloxi and Biloxi Bay including Old Fort Bayou as approved by \nMDEQ in 2002.  According to the TMDL, “under existing conditions Old Fort Bayou showed no \nimpairment based on the Secondary Contact standard”.\n8\n  Despite this, the TMDL recommends a \n35% reduction of the fecal loads from runoff from the watersheds surrounding the Back Bay of \nBiloxi and Biloxi Bay.\n9\n  While there is insufficient data to determine if Old Fort Bayou suffers \nfrom elevated levels of nutrients (phosphorus and nitrogen), problems with erosion and \nsedimentation, and/or other environmental stressors, it is likely that other water quality \nindicators need to be addressed given the urban/suburban nature of the lower watershed, new \ndevelopment, and existing golf courses.  See Section 2.4.5 Current Status of Water Bodies.  As \nsuch, this WIP also recommends taking measures to reduce nutrient loads and sediments \ncoming from nonpoint sources in the watershed.  The following goals were developed by the \nSteering and Technical Advisory Committee and Education Subcommittee for the Old Fort Bayou \nWIP along with input from the students who participated in the NOAA Gulf of Mexico Bay \nWatershed Education and Training Program during the fall term at St. Martin High School. \n1. Better understand and reduce pollutants entering the water system  \na. Update and continue to monitor water quality in Old Fort Bayou Watershed and add \nindicators including, but not limited to Total Nitrogen and Total Phosphorus \nb. Identify specific contributors of pathogens and target to reduce harmful bacteria \nentering the water system \nc. Promote and enforce litter prevention \n \n2. Reduce erosion and sedimentation to improve water quality and protect navigability \nof Old Fort Bayou \na. Identify and target key sources of erosion \nb. Encourage policies and practices to promote the use of Low Impact Development \nstrategies and reduce stormwater runoff in the watershed \nc. Protect and re-establish riparian buffers where possible \n \n3. Protect and improve quality access points and recreational opportunities on and \naround Old Fort Bayou  \na. Re-assess, update and promote Old Fort Bayou blueway and supporting \ninfrastructure \nb. Coordinate planning and development of future public access points, keeping in line \nwith current Best Management Practices \nc. Support environmentally-sensitive recreation and economic development \nopportunities that allow for preservation of marshes and riparian buffers \n \n4. Increase environmental awareness, stewardship and stakeholder participation in the \nwatershed \na. Build momentum of the Steering and Technical Advisory Committee for the Old Fort \nBayou WIP and establish an Old Fort Bayou Watershed Partnership \nb. Implement and continue to improve plan for education and outreach in the \nwatershed \nc. Create meaningful opportunities for schools, civic organizations and residents to \nparticipate in water quality monitoring and stewardship activities \n\n9 \n \n1.3 Related Plans and Projects  \nA significant amount of planning and plan implementation has and is being done that relates to \nwatershed planning in Old Fort Bayou watershed.  Relevant plans and projects are described below.  \nData and recommendations from these plans and projects have also been incorporated into Section 2: \nWatershed Assessment and Section 3: Management and Monitoring Plans. \n \nProject Title:  Old Fort Bayou Watershed Action Plan \nFunder: Environmental Protection Agency, Region IV \nAwardee: Land Trust for the Mississippi Coastal Plain \nGeographic Scope: Old Fort Bayou  \nDeliverables: Watershed partnership and action plan for Old Fort Bayou Watershed with two \nprimary objectives: 1) create a safe and beautiful blueway for residents and visitors and 2) \nrestore geomorphic stability thus decreasing bank erosion and sediment loading in \ndownstream inchannel environs. \nEnd Date: Spring 2007 \n \nProject Title:  Old Fort Bayou Watershed Education and Civic Engagement \nFunder: National Oceanic and Atmospheric Administration (NOAA) Gulf of Mexico Bay \nWatershed Education and Training Program (B-WET) \nAwardee: Mississippi State University’s Gulf Coast Community Design Studio \nProject Partners: Land Trust for the Mississippi Coastal Plain, Jackson County School District, \nJackson County staff and leadership, and NOAA National Centers for Environmental \nInformation’s Center for Coasts, Oceans and Geophysics \nGeographic Scope: Old Fort Bayou Watershed \nDeliverables: Educational programming and field experiences to introduce students to \nwatershed dynamics with a focus on Old Fort Bayou Watershed and concurrent planning \nefforts.  Several students will be selected to work with the Jackson County Planning \nDepartment, under the guidance of GCCDS staff, to increase the County’s capacity around Low \nImpact Development practices and reducing stormwater runoff. \nEnd Date: August 2019 \n \nProject Title: Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint Source Pollution \nDemonstration Project \nFunder: Mississippi Department of Environmental Quality \nProject Partners: Mississippi Soil and Waters Conservation Commission, Mississippi Department \nof Environmental Quality, United States Environmental Protection Agency, United States \nDepartment of Agriculture Natural Resources Conservation Service, and the Jackson County Soil \nand Water Conservation District \nGeographic Scope: Agricultural land in Rotten Bayou Watershed \nDeliverables: Installed Best Management Practices on agricultural land (fencing,  nutrient \nmanagement, water & sediment control basins, critical area planning, etc.) \nEnd Date: June 2006 \n \nPlan Title: Jackson County Bicycle, Pedestrian and Trails Master Plan \nFunder: Gulf Regional Planning Commission \nAwardee: Jackson County \nProject Partners: Cities of Gautier, Moss Point, Ocean Springs and Pascagoula \n\n10 \n \nGeographic Scope: Jackson County, Mississippi \nDeliverables: Master plan \nEnd Date: July 2018 \n \nPlan Title: Plan for Opportunity \nFunder: US Department of Housing and Urban Development \nAwardees: Gulf Regional Planning Commission, Gulf Coast Community Design Studio, South \nMississippi Planning and Development District, Ohio State University, Kirwin Institute, \nMississippi Center for Justice, Steps Coalition \nGeographic Scope: Hancock, Harrison and Jackson Counties \nDeliverables: Regional 20 year plan addressing water, land use, transportation, housing, food \nand resiliency \nEnd Date: Completed December 2013; 20 year Plan  \n \nPlan Title: Mississippi Gulf Region Water and Wastewater Plan \nFunder: US Department of Housing and Urban Development \nAwardee: Mississippi Department of Environmental Quality; planning assistance provided by \nMississippi Engineering Group, Inc. (MSEG) \nGeographic Scope: Lower 6 Counties, Mississippi \nDeliverables: Regional plan to identify the most critical water, wastewater, and stormwater \ninfrastructure needs within the Gulf Region and to prioritize those needs within the framework \nof an implementation plan for allocation of the funds designated by Governor Barbour. \nEnd Date: Completed April 2006; Plan through 2025 \n \nPlan Title: Mississippi Sandhill Crane National Wildlife Refuge Comprehensive Conservation \nPlan \nAuthor: U.S. Department of the Interior, Fish and Wildlife Service, Southeast Region \nGeographic Scope: Mississippi Sandhill Crane National Wildlife Refuge, Jackson County, MS \nDeliverables: 15-year plan to provide long-term guidance for management decisions; define \ngoals, objectives, and strategies needed to accomplish refuge purposes; and identify \nanticipated future need. \nEnd Date: Approved September 2007; Plan through 2023 \n \nIn addition to the aforementioned plans, the jurisdictions’ Small Municipal Separate Storm Sewer \nSystem (MS4) General Permit Reports are also relevant; particularly Section I: Summary of \nImplementation Activities by Minimum Measure and Best Management Practice which includes best \nmanagement practices related to stormwater.  The reports include strategies ranging from public \neducation and involvement to pre- and post-construction stormwater controls. Per ACT7, S-2 of the MS4 \nGeneral Permit, the “coverage recipient is to annually summarize the progress made in implementing \nthe conditions of the permit and the elements of the Storm Water Management Program (SWMP).”  The \nMS4 plans for Jackson County and the Cities of Gautier and Ocean Springs were reviewed and \nincorporated, where applicable, in Section 3: Management and Monitoring Plan.      \n\n11 \n \nSection 2: Watershed Assessment \n \n2.1 History and Land Use \n2.1.2 Historical Context \nOld Fort Bayou is a tidal creek navigable by canoe and Kayak from Old Fort Bayou Road to the \nBiloxi Bay.  The bayou has a maximum width of 1000 feet north of Ocean Springs, but generally \nranges between 250 and 350 feet from its mouth at Back Bay for a distance upstream of about \n2-3 miles.  At the ferry landing and bridge sites on the south shore, the bayou has a width of \nabout 300 feet and is not fordable.\n10\n  Because of this, development has been focused towards \nthe southwest portion of the watershed and has included residential settlements, lumber and \nfarming industries, ferries and watercraft construction, and tourist amenities.   \n \nOld Fort Bayou, Ocean Springs, MS. 1901  \nSource: Detroit Photographic Company. Library of Congress < https://www.loc.gov/item/2008678157/>. \nBayou Puerto is the ancestral name for the area that most of us refer to today as Gulf Hills.  The \nterrain in the Bayou Puerto region is relatively high considering its propinquity to the Gulf of \nMexico.  This small, isolated, primarily Roman Catholic settlement came into existence in the \nmid-19\nth\n Century.  The settlement was flanked by descendants of French and Spanish colonials \nand Americans. These early Spanish and Portuguese settlers were recent immigrants and not \ndescendants of the Spanish colonials who have anecdotally been linked with the Spanish Camp \nacross Old Fort Bayou on the Fort Point peninsula at Ocean Springs.\n11\n \nHistorical records and journals of the era indicate that Fort Bayou was an important inland \nwaterway in the \"lake trade\", the commerce between New Orleans and the Mississippi Gulf \nCoast. Locally, this exchange consisted primarily of charcoal and naval stores from Ocean Springs \nand other areas on the Mississippi Sound, often called \"The Lake\", via Lake Pontchartrain to \nNew Orleans. Returning vessels brought hardware, tools, cloth, medicine, and staple goods to \nthis region.\n 12\n \nAlthough not a primary boat building center, some watercraft construction did occur on Fort \nBayou and Bayou Puerto. Although most of the boats built here were probably small sailing \n\n12 \n \nvessels, i.e. catboats, and fishing skiffs, there was some schooner construction on Fort Bayou. \nBoat repair yards probably existed on both bayous.\n13\n  \nLumber \nThe Winter Park Lumber Company, was a co-partnership between Parker Earle (1831-1917), his \nsons, Franklin S. Earle (1856-1929) and Charles T. Earle (1861-1901), and V.R. Holladay.  The \nEarle family had relocated to Ocean Springs from southern Illinois, in the late 1880s. The Earle \nFarm property was situated just northeast of the Bayou Puerto community. It is very likely that \nboth men and women from this area found employment as day laborers in the tomato fields, \nvineyards, and fruit orchards of the Earles. This commercial agricultural venture consisted of \nnearly 840 contiguous acres.  Unfortunately, the Earle Farm went into bankruptcy.  The Earle \nFarm, became the Rose Farm in 1897, when it was sold to Joseph B. Rose (1841-1902).\n14\n \nFerries \nThe earliest recorded ferry operation across Old Fort Bayou was run by Captain Antonio M. \nFranco (1834-1891).  It was a flat boat large enough for “drayage animals and their burden and \noperated by a hand pulled rope”.\n15\n \nAntonio M. Franco was born on April 11, 1834 at Lisbon, Portugal.  He went to sea at the age of \neleven and ended his maritime commercial ventures after the Civil War.  Franco then began \nseveral land-based enterprises.  \nBy January 1874, Antonio and his wife, Jane Franco, had spent $850 for approximately two and a \nhalf acres on Washington Avenue and Old Fort Bayou.  Here they erected their home, which is \nnow part of the Aunt Jenny’s Catfish Restaurant on Washington Avenue.  After her husband \npassed away in 1891, Jane Franco continued in the business of transporting people, animals, and \nfreight across Old Fort Bayou at Ocean Springs.\n16\n \nIn the fall of 1891, Parker Earle (1831-1917), and his sons, Franklin S. Earle (1856-1929) and \nCharles T. Earle (1861-1901), started their own ferryboat service across Old Fort Bayou to \nimprove their business operations north of Ocean Springs.  The Earle ferry landing was located \nat Washington Avenue at the head of the main artery on Old Fort Bayou.\n17\n \n \nOld Fort Bayou Ferry (pre-1901) \nSource: Bellande, Ray L.  Ocean Springs Archives.  Old Fort Bayou: Ferries & Bridges (1875-2002).   \n\n13 \n \nIn June 1893, the Jackson County Board of Supervisors declared “that the ferry on Old Fort \nBayou Road, No. 61, in Beat No. 4, known and called “Franco Ferry” be and same is declared a \npublic ferry and that Mrs. A. Franco be granted a license to keep and maintain said ferry for a \nterm of one year.”   At the same time, Franklin S. Earle representing the Winter Park Land and \nLive Stock Improvement Company submitted an application requesting that the Board \nreconsider their licensing of Mrs. Franco as the public ferryman on Old Fort Bayou at Ocean \nSprings.  His request was “denied and refused” by the county officials.\n18\n   \n \n \nParker Earle & Sons Farm Plat \nSource: Bellande, Ray L.  Ocean Springs Archives.  Jackson County, Mississippi Natural Resources & Horn Island \n\n14 \n \nFarming \nH.D. Money (1869-1936), who was the proprietor of the Rose farm north of Fort bayou, was also \na proponent of sheep raising.  Colonel Money had fruit and pecan orchards on his large farm.  \nIn September 1915, Money reported to The Ocean Springs News that his experience with sheep \nraising, although on a small scale, was very profitable.  The decline of commercial sheep raising \nnorth of Fort Bayou can be traced to the passage of Chapter 263-House Bill No. 91 by the \nMississippi legislature in 1926.  The stock law was passed to prevent all live stock (cattle, horses, \nmules, jacks, jennets, sheep, goats, and hogs) from running at large upon open or unfenced \nlands.  Animals were restricted to a safe enclosure.  The statue also sought to prevent the \nspread of Texas fever ticks.  In 1930, Bonnet v. Brown (No. 28288) tested the stock law in the \nSupreme Court of Mississippi.  The original suit had been filed at George County.  Another \ncrushing blow to sheep husbandry in the area was the 1934 screw worm epidemic.  It did \nserious damage to regional flocks and almost destroyed the sheep industry in Jackson County.\n19\n   \nTourist Amenities  \nStarting in the early 20th Century, tourism interests shifted from the mineral springs on Fort \nBayou to the beach environment where saltwater bathing and seafood were popular.  Excursion \ntrains from New Orleans brought day and weekend tourist to the coast, and particularly to \nOcean Springs where there were already some amenities such as bath houses, piers, hotels and \nboarding houses.  The pecan and citrus industry at Ocean Springs and shipyards at Moss Point \nand Pascagoula also contributed to the demand for housing in the area at this time.\n20\n \nBy 1915, the game of golf had become popular in the United States.  Mr. H.F. Miller, manager of \nthe Chicago Association of Commerce speaking on the future of Ocean Springs said, \"the golf \nclub is a most important thing.  Develop that; it will bring people, it will bring trade; develop \ngood eighteen-hole links, and the big hotel that I hear agitated will come of its own accord\".\n21\n   \nIn 1927, the Branigar brothers, from Chicago, Illinois, developed Gulf Hills just north of Ocean \nSprings and Old Fort Bayou. The development included a golf course, clubhouse and 13 upscale \nhomes.   Interestingly, the original 13 homes did not have kitchens or laundry facilities, so \nresidents took all meals at the clubhouse and their laundry was picked up and returned clean \nand folded by clubhouse employees.  According to legend, the resort was developed for Chicago \ncrime figure, Al Capone and remnants of a \"Speak Easy\" and Gambling Casino still remain.  The \nclubhouse was also home to a lounge called \"The Pink Pony” that attracted many well-known \nentertainers including Elvis Presley.  Over the past 70 plus years, Gulf Hills has been bought and \nsold many times until 1998 when it was bought by the residents.\n22\n \nToday, the upper watershed remains rural in nature with horse and cattle farms and rural \nestates; however, since Hurricane Katrina, the rural nature is quickly converting into a more \nsuburban landscape with smaller-lot residential homes and subdivisions. The lower watershed is \nbordered by the St. Martin community to the north and the City of Ocean Springs to the south. \nSubdivisions are quickly becoming a primary source of nonpoint source pollution and creating \nadded pressure along the bayou’s waterfront.  Fishing, boating and birdwatching are the \nprimary recreational uses on the bayou. City and County boat launches, unique dining, lodging \nand golfing are available to visitors and residents; this along with significant conservation areas \nmakes the bayou an attractive waterway for locating a canoe and kayak trail.\n23\n \n \n\n15 \n \n2.1.3 Current and Future Land Use \nThe watershed is primarily undeveloped (62%) and lower density, single family residential (21%).  \nThe remainder of the watershed is agricultural (7.4%) with relatively little commercial \ndevelopment (2.3%).  The Preserve Golf Course is within the watershed boundary and adjacent \nto Old Fort Bayou and makes up 0.4% of the land area.\n24\n See Figure 2.  Gulf Hills also operates a \ngolf course adjacent to Old Fort Bayou at the confluence of the bayou and Back Bay of Biloxi, \nalthough just out of the watershed boundary for HUC 031700090604.  A considerable amount of \nthe undeveloped and forested land in the watershed is publicly owned and the majority of that \nis in conservation.  Conservation is further discussed in Section 2.3.5. \n \nFigure 2:  Current Land Use       \nSource: Land use data from Gulf Regional Planning Commission (2013). Map by Gulf Coast Community Design Studio. \nProjection: NAD 1983 State Plane Mississippi East FIPS 2301 Feet. \n \n \n\n16 \n \nAccording to a study by the Gulf Regional Planning Commission in 2013 assessing future land use \nas determined in jurisdiction’s comprehensive plans, the majority of development is expected to \noccur in single-family residential (18% increase), with additional increases in commercial and \nmixed-use development.\n25\n  See Figure 3. Single-family residential development is anticipated to \noccur in the more rural areas of the upper watershed, potentially replacing some of the current \nagricultural land, as well as the forested/undeveloped land.  Commercial and mixed-use \ndevelopment is projected more along the major transportation corridors including I-10 and MS-\n57.  Currently, there is a considerable amount of development occurring in the St. Martin area \njust north of Old Fort Bayou.\n26\n  It does seem that the jurisdiction’s comprehensive plans need to \nbe updated to include more of the recent additions to protected lands in conservation.  \nCompare Figure 3:  Future Land Use to Figure 8: Land in Conservation.      \n \nFigure 3:  Future Land Use       \nSource: Land use data from Gulf Regional Planning Commission (2013). Map by Gulf Coast Community Design Studio. \nProjection: NAD 1983 State Plane Mississippi East FIPS 2301 Feet. \n \n\n17 \n \n2.2 Human Resources \n2.2.1 Demographics \nAs of the 2010 Census, there were 20,235 people living in the watershed.  Of the total \npopulation, 76% are White, 12% are Black/African American, 6% are Hispanic/Latino(a), and 4% \nare Asian.  The fact that a significant percent of the population is Hispanic and Asian suggests \nthat consideration should be given to tailoring education and outreach such that it can \novercome potential language barriers.   \n \nAccording to the American Community Survey’s 2012-2016 5-year estimates, 8% of the \npopulation is living below the poverty limit.  This is well below the national poverty rate (12.3%) \nand below the 20% threshold that is considered the rate of high poverty for rural areas and \ntipping point at which poverty will continue to grow in neighborhoods.\n27\n \n28\n \n29\n \n \nThere is a total of 8,851 housing units within Old Fort Bayou Watershed.  Of the built housing \nunits, 82% are occupied and 18% are vacant.  This is a relatively high vacancy rate compared to \nthe vacancy rate for Jackson County (13%) and the U.S. (11%), but fairly consistent with the \nvacancy rate for Mississippi as a whole (15%).  The majority of the housing in the watershed is \nowner occupied (73%) which may be a positive factor in improving environmental stewardship \nin the watershed.\n 30\n \n \nA significant number of households in the watershed are home to seniors (35%) and children \n(28%).  These are important factors to consider when developing programming, education and \noutreach strategies, and waterway access points. \n \n2.2.2 Municipal \nOld Fort Bayou Watershed is a multi-jurisdictional watershed.  The watershed includes part of \nthe City of Ocean Springs to the southwest, part of Gautier to the southeast, and spans into \nJackson County to the north.   Multiple water and sewer districts have jurisdiction in the area \nincluding West Jackson County Utility District, Gautier Utility District, Coast Water Works Inc., \nand Jackson County Port Authority.  The complex and multi-jurisdictional nature of Old Fort \nBayou watershed presents a challenge for, but also a greater justification for planning and \ncollaboration in the watershed around issues of water quality.  See Figure 4. \nThe Mississippi Sandhill Crane National Wildlife Refuge, owned and operated by the U.S. \nDepartment of the Interior’s Fish and Wildlife Service, is also a significant stakeholder in the \nwatershed.  The Refuge was established in 1975 in Jackson County for the protection and \nrecovery of this critically endangered bird and the restoration of its unique habitat, wet pine \nsavanna (e.g., pitcher plant bogs). The vast majority of wet pine savanna (95-97%) has been \naltered; thus, the Refuge plays a critical role as a representative remnant of this ecosystem. The \nMississippi Sandhill Crane Refuge consists of three separate units totaling approximately 19,300 \nacres: the Gautier, Ocean Springs, and Fontainebleau units. Each unit lies within the limited \nnesting range of the endangered Mississippi sandhill crane.  The purpose of the Mississippi \nSandhill Crane Refuge is threefold: To provide protection and management for the endangered \nMississippi sandhill crane, by restoring, improving, and maintaining nesting, feeding, and \nroosting habitat within the refuge; to protect and conserve unique savanna habitat of south \n\n18 \n \nMississippi; and to provide opportunities for environmental education and interpretation and \nwildlife-dependent recreation to refuge visitors.\n31\n    \n \nFigure 4:  City Boundaries and Utility Districts in Old Fort Bayou Watershed       \nSource: Jackson County GIS Department (2018). \n \n2.2.3 Civic Infrastructure \nThere are several civic organizations that are active in Old Fort Bayou Watershed and important \nto current and future watershed protection strategies.  These include, but are not limited to the \nLand Trust for the Mississippi Coastal Plain, The Nature Conservancy, and the Mississippi State \nUniversity Extension Service.  Brief descriptions of each organization are included below. \nLand Trust for the Mississippi Coastal Plain \nThe Land Trust for the Mississippi Coastal Plain (LTMCP) was founded in 2000 and works in the \nsix coastal counties of Mississippi.  The organization strives to conserve, promote and protect \nopen spaces and green places of ecological, cultural or scenic significance in the counties of the \nMississippi Coastal Plain.  LTMCP is accredited by the Land Trust Accreditation Commission, an \nindependent program of the Land Trust Alliance, and has worked with landowners and local \nauthorities to protect over 8000 acres of valuable wetlands and environmentally significant land \nin the region.    \n \n \n\n19 \n \nThe Nature Conservancy \nThe Nature Conservancy (TNC) is an international 501(c)(3) organization managed from its \nworldwide office in Arlington, Virginia USA.  Since 1956, TNC has been working to conserve lands \nand waters along the Gulf Coast that have provided a sense of place and connection to our \nnatural heritage for many generations.  TNC has local Boards of Trustees, land holdings, and \nactivities in all of the Gulf Coast states, including an office and significant landholdings in Old \nFort Bayou Watershed. TNC has played a key role in protecting and restoring many important \nlandscapes on the coast including areas with unique native plant communities, habitat for the \nfederally endangered species, acres of oyster reefs, and rare geologic formations rich with \nfossils.  The Nature Conservancy also employs scientists that have long been first-hand \nobservers of the health of the region’s coastal ecosystems. \nMississippi State University Extension Service \nThe Mississippi State University Extension Service, in general, provides research-based \ninformation, educational programs, and technology transfer focused on issues and needs of the \npeople of Mississippi, enabling them to make informed decisions about their economic, social, \nand cultural well-being.  Core programs include agriculture and natural resources, family and \nconsumer education, enterprise and community resource development and 4-H youth \ndevelopment.  The MSU Extension also coordinates the Master Gardener Volunteer program.  \nThrough this program, individuals are trained and certified in consumer horticulture and related \nareas.  The program allows the local Extension Service to reach a larger gardening audience.  \nContinuing education is offered to encourage long-term commitments and most certified \nMaster Gardeners serve five to seven years.  \nThe Coastal Research and Extension Center (CREC) focuses more on coastal environments and is \nlocated minutes away in Biloxi.  The CREC aims to provide education and outreach specifically \nfor Mississippi’s coastal residents in regard to almost every aspect of the coastal environment - \nfisheries, wetland management, marine industry, recreation, economics and law. \nOther Civic Organizations \nOther civic organizations near the Old Fort Bayou Watershed also have the potential to play a \nmuch larger role in environmental stewardship in the watershed.  For example, the Walter \nAnderson Museum of Art located in downtown Ocean Springs is based on Walter Anderson’s \nvision for communities that exist in harmony with their environment.  He greatly valued and was \ninspired by nature, particularly coastal ecosystems, as is evident in this internationally-\nrenowned artwork.  The Mississippi Wildlife Federation’s Habitat Stewards Program is also very \nactive on the coast and would be a great partner.  The Mississippi Habitat Stewards Program is a \nvolunteer program that supports management and conservation on public lands in coastal \nMississippi. In addition, garden clubs and local chapters of Keep America Beautiful can easily \nrefocus their work to promote environmental priorities in the watershed.   \n \n2.3 Physical Setting \n2.3.1 Soils and Geology \nThe soil and geology of a drainage area make up the hydrogeologic setting of a watershed.  The \ntype and distribution of the materials that affect the surface and substrate are important to \n\n20 \n \nunderstand in watershed planning because they greatly influence the response of surface water \nboth to precipitation and contaminants.   In addition, the hydrogeologic conditions influence \nwhich Best Management Practices are most suitable for a given area.  A good understanding of \nthe soil types and geologic characteristics of a watershed will both improve the effectiveness \nand efficiency of strategies recommended and implemented through a watershed \nimplementation plan. \n \nThe geological makeup of the Old Fort Bayou Watershed, and most of the Mississippi Gulf Coast, \nis characterized by sedimentary formations of estuarine and deltaic origin.\n32\n  Old Fort Bayou \nWatershed falls entirely within the Coastal Terraces (Pamlico Coastal Terrace, Big Ridge and \nGood Hope).  The Coastal Terraces formed during the Pleistocene period, the first epoch of the \nQuaternary period.  A report on the surface geology of Jackson County has recently been \ncompleted by MDEQ’s Office of Land and Water Resources and is under review.  It is intended to \nbe made public early 2019.\n33\n \nThe primary importance of geology in watershed planning is its effect on soil characteristics, \ndescribed below, and groundwater aquifers, further discussed in Section 2.4.1.  Soil texture and \nparticle size determine how surface water will travel over or through the ground.  The majority \nof the watershed consists of sandy loam soils with the predominant soil types being Bayou \nsandy loam in the lower end of the watershed and Vancleave loamy sand in the upper areas of \nthe watershed.  Bayou sandy loam is known for poor drainage and unsuitability for farming \nwhile Vancleave loamy sand is known for draining relatively well and being suited for farming. \n34\n  \nSee Appendix A: Soil Survey. \n \nSoils can be assigned to hydrologic soil groups based on factors such as measured rainfall, \nrunoff, and infiltration data.  The slope of the soil surface, however, is not considered when \nassigning hydrologic soil groups.\n35\n  Soils in the United States are assigned to four groups (A, B, C, \nand D) and three dual classes (A/D, B/D, and C/D). Group A soils have the highest rate of \ninfiltration and group D has the slowest infiltration rate.  Hydrologic Soil data from the National \nResources Conservation Service (NRCS) Gridded Soil Survey Geographic Database (gSSURGO) \nwas assessed for Old Fort Bayou Watershed.  In Old Fort Bayou watershed, only 10% of the land \nfalls into categories A and B, meaning the soils in these areas have higher infiltration rates.  \nForty-eight percent falls into categories C and D and have soils that have much slower \ninfiltration rates.  See Figure 5. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n21 \n \nSource: Gridded Soil Survey \nGeographic (gSSURGO) \nDatabase for Mississippi. \nUnited States Department \nof Agriculture, Natural \nResources Conservation \nService. Available online at \nhttp://datagateway.nrcs.u\nsda.gov/. [Accessed 23 \nMay 2018].  Map by \nNOAA’s National Centers \nfor Environmental \nInformation. \nFigure 5: Dominant Hydrologic Soil Groups Rotten Bayou Watershed \n   \n \n \nThe types and location of soils often determine what managerial, structural or vegetative \nactivities are feasible.  Areas that contain soils with high infiltration rates are directly responsible \nfor infiltrating precipitation and feeding the upper reaches of the watershed with groundwater \ninflow that function to moderate flows and maintain a cool water temperature regime.  \nProtection of these areas is extremely important to maintain existing high water quality. These \nareas are also are more suitable for the installation of BMPs that function to increase \ninfiltration.  On the other hand, areas that contain soils with slow infiltration rates tend to be \nmore susceptible to erosion if not properly managed and vegetated.  The majority of Old Fort \nBayou is comprised of soils with much lower infiltration rates.  The areas with poor drainage are \nalso not well-suited for septic systems.  Section 2.4.6 further explores the extent of \nnonfunctioning septic systems in Old Fort Bayou Watershed.  Several of the areas identified as \n\n22 \n \nhaving poor drainage, particularly near the northern tip of the watershed do appear to coincide \nwith some of the nonfunctioning septic systems previously identified. \n \n2.3.2 Ecoregion \nEcoregions are generally defined as an area with a relatively homogeneous ecosystem. \nGeographic areas are assigned to different ecoregions based on biotic and abiotic characteristics \nincluding geology, physiography, vegetation, climate, soils, land use, wildlife and hydrology.\n36\n  \nEcoregions are intended to provide a geographic area for ecosystem assessment, monitoring \nand management.\n37\n  Traditionally, ecoregions and watersheds have been treated as two \nseparate frameworks for environmental assessment and management, but more recently are \nbeing used in coordination with one another: \n \nAlthough ecoregions and watersheds are intended for different purposes, they can be \ncomplementary.  Ecoregions provide the spatial framework within which the quality and \nquantity of environmental resources, and ecosystems in general, can be expected to \nexhibit a particular pattern. Where watersheds are relevant and can be defined, they \nare necessary for studying the relationships of natural and anthropogenic phenomena \nwith water quality, as well as for providing the spatial unit for reference areas within \necoregions at all scales.\n38\n  \n \nOld Fort Bayou Watershed spans two, level III ecoregions.  The very northern portion of the \nwatershed, less than one-third of the watershed, is in the Southeastern Plains ecoregion and the \nsouthern portion of the watershed is in the Southern Coastal Plains ecoregion.  While there is a \ndistinct divide between the two ecoregions for mapping and analysis purposes, ecoregion \nboundaries rarely form abrupt edges.\n39\n \n \nThe Southeastern Plains are a mix of cropland, pasture, woodland, and forest. Natural \nvegetation consisted predominantly of longleaf pine, with smaller areas of oak-hickory-pine and \nSouthern mixed forest. Elevations and relief are greater than in the Southern Coastal Plain, but \ngenerally less than in much of the Piedmont. Streams in this area are generally lower-gradient \nand have sandy bottoms.\n40\n   \nThe Southern Coastal Plain consists of mostly flat plains, but also includes barrier islands, coastal \nlagoons, marshes, and swampy lowlands along the Gulf and Atlantic coasts.  Forests historically \nconsisted of longleaf pine, slash pine, pond pine, beech, sweetgum, southern magnolia, white \noak, and laurel oak, but is now mostly slash and loblolly pine with oak-gum-cypress forest in \nsome low-lying areas, citrus groves in Florida, pasture for beef cattle, and urban areas.\n41\n \n \n2.3.3 Wetlands \nWetlands are critical to protecting water quality and moderating water quantity.  Some of these \n“wetland services” that protect water quality and quantity include providing erosion control, \nflood protection, filtration, critical habitat and carbon sequestration.  Coastal wetland losses \noccur as a result of both human activity and natural processes.  Human activities such as urban \ndevelopment can remove wetlands, harden shorelines and change overall hydrology.  Natural \nprocesses such as erosion and inundation from sea level rise and storms can also affect \nwetlands.\n42\n  Following the State’s passage of the Coastal Wetland Protection Act, wetland loss \n\n23 \n \ndue to development fell dramatically while coastal erosion became the major contributor of \nwetland loss.\n43\n   \n \nOld Fort Bayou watershed is comprised of a mix of wetland environments including estuarine, \nfreshwater and riverine, the most common being freshwater forested/scrub wetlands that \nextend throughout the reaches of the watershed.  Overall, just over 30% of the land area in the \nwatershed is classified as “wetlands” as defined by the Mississippi Department of Marine \nResources (MDMR).  See Figure 6.   \n \nFigure 6: Wetlands in Old Fort Bayou Watershed \n \nSource: Map and analysis by the Mississippi Department of Marine Resources Coastal Preserves Program (2018). \n\n24 \n \nWetlands in Old Fort Bayou watershed are under the jurisdiction of MDMR’s Coastal Program \naccording to Section 57-15-6 of the Mississippi Code of 1972.  Old Fort Bayou watershed is part \nof the Mississippi Coastal Zone which includes Hancock, Harrison and Jackson Counties. \nImplementation of the Coastal Program is the primary responsibility of the Office of Coastal \nZone Management and includes administering the Coastal Preserves Program, Wetlands \nPermitting, and other special projects.  Wetland activities that are regulated include: \n \nDredging, excavating or removing of soil, mud, sand, gravel, flora, fauna, or aggregate \nof any kind from any coastal wetlands; dumping, filling or depositing of any soil, \nstones, sand, gravel, mud aggregate or of any kind or garbage, either directly or \nindirectly, on or in any coastal wetlands; killing or materially damaging any flora or \nfauna on or in any coastal wetlands; and the erection on coastal wetlands of \nstructures which materially affect the ebb and flow of the tide; and the erection of any \nstructure on suitable sites for water dependent industry. The use of the term \n“indirectly” in this definition covers the possibility of activities located outside of \ncoastal wetlands which cause dumping, filling, or depositing in coastal wetlands.\n44\n \n \nApplications for wetlands activities in the Mississippi Coastal Zone are submitted through \nMDMR, but may also be reviewed by the U.S. Army Corps of Engineers (USACE) under the \nMemorandum of Agreement with the Mobile and Vicksburg Districts of the USACE.\n45\n \n \n2.3.4 Climate and Climate Change \nOld Fort Bayou Watershed, and Mississippi in general, are located in a humid subtropical climate \nregion, characterized by temperate winters; long, hot summers; and rainfall that is fairly evenly \ndistributed through the year. The region, however, is subject to periods of both drought and \nflood, and determining \"average\" conditions is challenging. Prevailing southerly winds provide \nmoisture for high humidity and potential discomfort from May through September. Locally \nviolent and destructive thunderstorms are a threat on an average of about 60 days each year. \nEight hurricanes have struck Mississippi's coast since 1895, and tornadoes are a particular \ndanger, especially during the spring season.\n46\n \nNormal mean annual temperatures are 68°F along the coast. Low temperatures have dropped \nto 16°F below zero while high temperatures exceed 90°F over 100 days each year. Temperatures \nroutinely exceed 100°F at many places in the state each year and drop to zero or lower an \naverage of once in five years in the state. Normal precipitation ranges from about 50 to 65 \ninches across the state from north to south.\n47\n  \nClimate change is likely to affect several processes that will impact watershed dynamics in \ncoastal Mississippi and Old Fort Bayou Watershed including sea level rise and frequency and \nduration of rainfall events.  There are various estimates of sea level rise resulting from climate \nchange, but even according to the most conservative predictions, substantial flooding of coastal \narea appears to be likely.  There is also a limited amount of local and regional sea level rise data \navailable for the Mississippi Gulf Coast.  Based on available data, Mississippi expects a minimum \nsea level rise of approximately 10 inches by the year 2100. However, gaps in the data available \nand a lack of long-term historical trends may affect the accuracy of this prediction.\n48\n Sea level \nrise is likely to have a significant impact on wetlands in the area: \n \n\n25 \n \nA rise in sea level inundates the coastal vegetated lands, converting them into areas of \nopen water and resulting in a loss of wetland functions.  Although new wetlands may be \ncreated further towards the inland if the coastal topography is ideal (i.e., in the \npresence of gradually increasing slope), whether or not they can make up the loss due \nto sea level rise largely depends on the extent of land development on the newly \nflooded area, as well as the rate at which the replacing wetland ecosystem functions can \nbe fully established.\n49\n \n \nNOAA’s Digital Coast Sea Level Rise and Coastal Flooding Impacts Viewer is a tool for visualizing \nimpacts of sea level rise from one foot to five feet.  When comparing the impacts of sea level \nrise in Old Fort Bayou Watershed (See Figure 7) to anticipated future development as shown in \nFigure 3 it is apparent that a substantial amount of land slated for development in the \nwatershed could be compromised by sea level rise.  In addition, the estuarine and marine \nwetlands shown in Figure 6 should be protected as natural buffers in anticipation of sea level \nrise along with regular flood events. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n26 \n \nFigure 7: Sea Level Rise and Coastal Flooding Impacts on Old Fort Bayou Watershed \n \nIn addition to sea level rise, moisture deficits and drought are likely to increase across the \nMississippi Gulf Coast.\n50\n  This could have an effect on vegetation important for soil stabilization \nand habitat, as well as ground water recharge.  Alternately, heavy rainfall events have been and \nare likely to continue increasing.  Intense rainfall events contribute to stormwater runoff \nincreasing flooding, erosion and influx of pollutants into the water system. \n \n \n2.3.5 Conservation Mapping \nIn 2010 the Land Trust for the Mississippi Coastal Plain and consultant, CDM Smith, undertook a \nproject known as Conservation Legacy to develop a toolkit for conserving land in a more \n\n27 \n \nstrategic manner in the six coastal counties of Mississippi.  One of the products was a Map of \nPotential Conservation Lands that is a model of the suitability of land for conservation based on \nranked environmental and land use conditions including wetlands, hydrological soil groups, \nflood zones, elevation/slope, upland forest and important ecosystems.\n51\n \nA significant portion of the watershed (40%) is currently in conservation under the management \nof the Land Trust for the Mississippi Coastal Plain, The Nature Conservancy, and the U.S. Fish \nand Wildlife Service.  See Figure 8.   \n \nFigure 8: Land in Conservation \n \nSource: Jackson County Tax Assessor. (2018). Map by GCCDS. Projection: NAD 1983 State Plane Mississippi East FIPS \n2301 Feet. \n \nThe area in conservation is roughly the middle third of the watershed, separating the rural \nagricultural areas to the north from the more urban and developed areas in the south.  These \nprotected lands offer a nice buffer for runoff from the agricultural areas, unfortunately a lot of \nthe higher priority areas (6/7/8) in terms of conservation are along the waterway in areas that \nare more developed.  See Figure 9. Protection of remaining undeveloped areas along Old Fort \nBayou should be a priority in terms of planning and management strategies for Old Fort Bayou \nWatershed. The Land Trust for the Mississippi Coastal Plain can play a significant role here in \nthat unlike many conservation agencies, they see value in protecting smaller properties in \ncritical areas for reasons such as their value as wetlands and buffers, potential for future \n\n28 \n \nconnections, and/or value for cultural or educational purposes.  As seen in Figure 9, LTMCP \nalready owns and manages a number of properties along Old Fort Bayou. \n \n \nFigure 9: Conservation Priority Areas in Old Fort Bayou Watershed. \n \nSource: Land Trust for the Mississippi Coastal Plain. Conservation Legacy: Potential Conservation Lands Map. \n<http://gis.co.harrison.ms.us/landtrust/>. Accessed 4 December 2018. \n \n2.4 Water Resources \n2.4.1 Groundwater \nThere are 16 major aquifers and various minor aquifers throughout Mississippi.  The \ngroundwater resources found in these aquifers supplies over 90% of Mississippi’s drinking water \nsupply.  In the coastal counties, drinking water and potable water is mainly supplied through the \nGrand Gulf Aquifer System which includes, in ascending order, the Catahoula, Hattiesburg, \nPascagoula and Graham Ferry aquifers.\n52\n   \nThe wells in Old Fort Bayou are supplied by the Graham Ferry and Pascagoula aquifers.  There \nare relatively few notable concerns related to water quantity and quality associated with these \naquifers.  The Graham Ferry and Pascagoula aquifers tend to be higher in iron and manganese \n\n29 \n \nwhich can affect the flavor and color of the water.\n53\n  The Mississippi Department of Health \nmonitors the water quality for the public water supply wells and all public wells are currently \ncompliant for volatile organic chemicals, synthetic organic chemicals and nitrate \nconcentration.\n54\n  The Mississippi Gulf Region Water and Wastewater Plan did note that levels of \norganic color have been documented in excess of Secondary Drinking Water Standards in \nJackson County, but no specifics were given.\n55\n \nThe Graham Ferry and Pascagoula aquifers are almost entirely fresh water and there is relatively \nlittle concern about the possibility of saltwater intrusion.  A study done by MDEQ in 2002 found \nthat while salt concentrations in the well water in the area are naturally higher, they have not \nincreased at a rate that would provide evidence of saltwater intrusion.  The study also found \nthat saltwater intrusion is unlikely due to extraction of groundwater in the deeper confined \naquifers.\n56\n  The deeper sands of the aquifer system are recharged at their outcrop, north of Old \nFort Bayou Watershed.  According to MDEQ’s Office of Land and Water Resources: \nThe aquifers providing potable water in the Old Fort Bayou Watershed area are \nconfined, meaning that there is a clay interval above the aquifer which protects it from \ncontamination from the surface.  Recharge for these aquifers is to the north of the \nwatershed and, activities at the surface in the watershed will not have any adverse \neffects on the aquifers.  Several aquifers are available for use in the Old Fort Bayou area, \nand the water quality is quite good.  Ground water resources are abundant in the Old \nFort Bayou Watershed, and there is no anticipation of having any problems with either \nwater supply or water quality for the foreseeable future.\n57\n \nThe Gulf Region Water and Wastewater Plan, however, noted that all three coastal counties \nproject “steady increases in water demands that cannot be met by current water supply, \ntreatment, and distribution infrastructure.” The improved infrastructure was and is being \nplanned and implemented based on the projected 2025 demand.\n 58\n  A report on the \ngroundwater resources of Jackson County has recently been completed by MDEQ’s Office of \nLand and Water Resources and is under review.  It is intended to be made public early 2019.\n59\n \nThe Preserve Golf Club primarily irrigates using water from a well to a 90 ft aquifer.  Prior to a \nredesign in 2014 the Club used water solely from a well to a 400 ft aquifer, which had plenty of \nwater, but the water was sodic (Sodic water is high in sodium (Na+) concentration relative to \nconcentrations of calcium (Ca2+) and magnesium (Mg2+) and considered poor quality for golf \ncourse irrigation).  While the better quality water from the 90 ft aquifer is sufficient during \nmonths with “normal” rainfall, during drier months the Club has to supplement with less \ndesirable water from the 400 ft aquifer.  So far, this solution has sufficed, but if periods of \ndrought become more frequent an alternative solution may need to be considered.\n 60\n \n \n2.4.2 Access and Recreation \nThe coast and its upland waterways provide the opportunity for a wide range of recreational \nactivities.  In a public opinion survey conducted in the Southern Mississippi Planning and \nDevelopment District on 65 outdoor recreational activities, nine out of the 45 most popular \nwere water related. The most popular activities include fishing, canoeing, kayaking, rafting, and \ntubing.\n61\n  Old Fort Bayou is well positioned in terms of public access and recreation \nopportunities.  The Bayou became a designated blueway under the direction of the Land Trust \nfor the Mississippi Coastal Plain following the development of the 2007 Action Plan.  Public \n\n30 \n \naccess and recreation opportunities are well documented in the blueway guide.  See Appendix \nG: Old Fort Bayou Blueway Guide.  The access and recreation opportunities associated with Old \nFort Bayou Blueway are beneficial for the watershed for two main reasons.  First, when coupled \nwith educational signage, these access sites serve to connect people with their waterways and \nincrease environmental stewardship.  In addition, nature-based recreation is a growing market \nin south Mississippi and responding to this growing demand would likely prove beneficial both in \nterms of economic development and property values. \nThe original blueway guide was produced in 2010 and is available for download on the Land \nTrust for the Mississippi Coastal Plain’s website and in print at their office and the Ocean Springs \nChamber of Commerce.  The blueway guide was updated in 2018 as part of a National Heritage \nArea Grant through the Department of Marine Resources.  The effort was part of the Nature-\nbased Tourism Plan for Coastal Mississippi approved in 2016 and included the development of a \nBlueways Design Guide.  The updated brochure is available on the Mississippi Gulf Coast \nNational Heritage Area’s website.  LTMCP currently has funding to print the updated brochure.  \nIt is important to note that the Jackson County Bicycle, Pedestrian and Trails Master Plan, also \ndeveloped in 2018, includes blueway recommendations applicable to Old Fort Bayou that \ninclude extending the blueway to include Bayou Talla.\n62\n  Bayou Talla is a significant offshoot of \nOld Fort Bayou that is adjacent to the St. Martin Schools that are part of the Jackson Country \nSchool District.  Improved access points near the schools represent a significant opportunity for \nmonitoring, education and outreach.  In addition, LTMCP is currently working on a new kayak \nlaunch adjacent to The Inlets development in Ocean Springs on Old Fort Bayou that is \nanticipated to be accessible to the public starting in the spring of 2019.  These anticipated \nadditions of blueway infrastructure will need to be added to the Old Fort Bayou Blueway \nbrochure. \n \n2.4.3 Wildlife and Fisheries \nOld Fort Bayou Watershed supports a broad diversity of wildlife.  The Mississippi National \nHeritage Inventory keeps a database of critical species known as species of \"special concern\".  \nAfter review by the U.S. Fish and Wildlife Service office in Hancock County, several of the species \nidentified as being of “special concern” and possibly in Jackson County are listed as threatened \n(See Appendix B: Mississippi National Heritage Inventory and C: Federally Endangered, \nThreatened, and Candidate Species in Mississippi).\n63\n   Critical species confirmed or likely in Old \nFort Bayou Watershed include the following: \n• Mississippi Sandhill Crane (Endangered/Critical Habitat) \n• Gulf Sturgeon (Threatened/Critical Habitat) \n• Alabama Red-bellied Turtle (Endangered) \n• Black Pinesnake (Threatened) \n• Gopher Tortoise (Threatened) \n• Dusky Gopher Frog (Endangered/Critical Habitat) \n• Louisiana Quillwort (Endangered) \n \n \n \n\n31 \n \n2.4.4 Designated Use Classifications and Water Quality Standards \nOld Fort Bayou is classified as suitable for “Recreation” from Biloxi Bay to Bayou Talla and \nsuitable for “Fish and Wildlife” from Bayou Talla to its headwaters.  Waters in the Recreation \nclassification are suitable for primary contract recreation such as swimming, while waters in the \nFish and Wildlife classification are suitable for secondary contact recreations (i.e. kayaking, \nwhere full body immersion is unlikely), fish consumption and aquatic life uses.\n64\n \nSeasonal water quality monitoring has been regularly performed by MDEQ at a state ambient \nmonitoring station (#0481299) near the mouth of the Bayou in the area classified for Recreation.  \nVery little has been documented upstream of this monitoring station.\n65\n  As such, the available \nwater quality data from the station at the mouth of the bayou was analyzed based on the water \nquality standards for the Recreation classification with a focus on bacteriological indicators.   \nThe current water quality standards for bacteria for Recreation set a threshold based on a \ngeometric mean of 126 culturable e. coli bacteria per 100 ml, and state that the samples \nanalyzed during a 30-day period not exceed 410 e. coli per 100 ml more than 10% of the time.  \nIn addition, there should be a minimum of five samples taken over a 30-day period with no less \nthan 12 hours between individual samples.\n66\n  Additional standards exist for dissolved oxygen, \ndissolved solids, pH and temperature, but due to lack of data for these indicators and the focus \non the fecal coliform TMDL, did not play a significant role in determining the current status of \nwater quality in Old Fort Bayou.  Results are further discussed in Section 2.4.5.   \nIt is important to note that due to current land uses and the likelihood of future development \nwithin the watershed it seems important to also monitor nutrients such as Total Phosphorus \n(TP) and Total Nitrogen (TN).   There are several proposed thresholds that should be considered \nif future monitoring is arranged.  The State of Mississippi, for example, has developed numeric \nnutrient thresholds for non-tidal streams and rivers to protect aquatic life in Mississippi.  The \nrecommended thresholds for TN in southeast Mississippi rivers and streams range from 0.31 to \n0.68 mg/l, depending on the approach.\n67\n   \n \n2.4.5 Current Status of Water Bodies \nBMI Environmental Services, in partnership with Nutter & Associates, analyzed available water \nquality data for Old Fort Bayou as compared to the TMDL and approved thresholds.  See \nAppendix D: Old Fort Bayou Fecal Coliform Bacteria Total Maximum Daily Load Reduction Plan.  \nBased on available bacterial data, it was determined that Old Fort Bayou was generally in \ncompliance with MDEQ water quality standards for the Recreation classification between 2009 \nand 2017.  Elevated levels of fecal indicator bacteria were correlated with periods of heavier \nrainfall and so can be attributed to stormwater runoff and nonpoint sources.  When the main \nsources of fecal indicator bacteria are from point sources elevated concentrations are usually \nseen during periods with less rainfall (i.e. low flow).  These findings are consistent with the 2002 \nTMDL where 97% of the allocation was determined to be from nonpoint sources.\n68\n  See Figures \n10 and 11. \n \n \n \n \n \n\n32 \n \nFigure 10: MDEQ Seasonal Data for Bacteria Concentrations - Washington Ave. Bridge \n \n \n \nSource: Mississippi Department of Environmental Quality, Water Quality Assessment Branch.  \n \n \n400\n200\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\n200920102011201220132014201520162017\nBateria Concentration (CFU/100ml)\nYear\nGeometric Mean of Fecal Coliform Colony Forming Units (CFU)\n2009 -2017 Old Fort Bayou -Washington Ave. Bridge\nWinterSummer\n410\n126\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\n200920102011201220132014201520162017\nBateria Concentration (CFU/100ml)\nYear\nGeometric Mean of E. coli Colony Forming Units (CFU)\n2009 -2017 Old Fort Bayou -Washington Ave. Bridge\nWinterSummer\n\n33 \n \nFigure 11: Comparison of Bacteria Concentration and Recent Precipitation \n \n \nSource: BMI Environmental Services, LLC and Nutter & Associates, Inc. Prepared for Land Trust for the Mississippi \nCoastal Plain. (2018). Old Fort Bayou Fecal Coliform Bacteria Total Maximum Daily Load Reduction Plan. Pg 7. \nTo supplement the fecal indicator bacteria water quality data from the MDEQ station at the \nmouth of Old Fort Bayou, GCCDS took students from the Marine Science classes at St. Martin \nHigh School to monitor water quality at two sites along Old Fort Bayou on Monday, December 5, \n2018.  The project was funded through a grant from NOAA’s Gulf of Mexico Bay Watershed \nEducation and Training Program (B-WET) to the Gulf Coast Community Design Studio.  The \nproject will continue through August 2019 and it is anticipated that another round of water \nquality testing will be done in the spring of 2019.  While the MDEQ ambient water quality \ntesting team was not able to accompany the students on the fall field trip, they will hopefully be \nable to test alongside students on the spring field trip.  More information on the project is \nincluded as Appendix E: B-Wet Old Fort Bayou Watershed Education & Civic Engagement.   \nThe students used Earth Force® Low Cost Water Monitoring kits and collected information on \nwater temperature, turbidity, pH, Dissolved Oxygen, Phosphorus and Nitrates.  Volunteers \nfrom local nonprofits and various state and federal agencies including the Land Trust for the \nMississippi Coastal Plain (LTMCP), NOAA National Centers for Environmental Information’s \nCenter for Coast, Oceans and Geophysics (NCEI), EPA Gulf of Mexico Program, National Park \nService, Mississippi Department of Wildlife, Fisheries and Parks, and The Nature Conservancy \naccompanied the students on the field trip to assist with data collection.  Compiled results are \nbelow in Table 2.   \n \n \n \n \n\n34 \n \nTable 2: St. Martin High School B-WET Program Water Quality Testing Results. \nThe Preserve Golf Club \n \nTwelve Oaks \n901 MS-57, Vancleave, MS (upstream) \n \n1112 Hanley Rd, Ocean Springs, MS (downstream) \n       \nIndicator Result Rating \n \nIndicator Result Rating \nWater Temperature 20.1°C   \n \nWater Temperature 23.2°C   \npH 6.3 Good \n \npH 6.1 Good \nTurbidity 30.6 JTU Good \n \nTurbidity 15.8 JTU Good \nDissolved Oxygen 66% Saturation Fair \n \nDissolved Oxygen 67% Saturation Fair \nPhosphate 1.5 ppm Good \n \nPhosphate 1.7 ppm Good  \nNitrate 5 ppm Fair \n \nNitrate 5.1 ppm Fair \n \nSource: St. Martin High School student data from November 5, 2018 using Earth Force® Low Cost Water Monitoring \nkits.  The last measurable rainfall was 0.81 inches on October 26, 2018. \nWhile results from the students’ water quality testing cannot be held to the same level of \nscientific scrutiny as the water quality analyzed above or other water quality data typically \nutilized by MDEQ, it is useful in that it suggests that water quality can be improved, and other \nwater quality indicators should be more closely monitored in the future.  It is interesting to note \nthat nutrients (phosphate and nitrogen) actually read slightly higher downstream, nearer to the \nurbanized areas and not upstream adjacent to The Preserve Golf Course and more of the \nrural/agricultural land uses.  The students did test for fecal coliform, but the tests included in \nthe Earth Force® Low Cost Water Monitoring kit only offer a positive or negative reading.  Tests \nat both sites showed positive results indicating higher levels of fecal coliform.  However, given \nthe inaccuracies likely with this testing method, the student bacterial water quality data should \nnot override the results from MDEQ’s testing documented above. \n \n2.4.6 Sources of Pollutions \nThere were four municipal or industrial facilities that were permitted to discharge into Old Fort \nBayou under the National Pollutant Discharge Elimination System (NPDES) in the 2002 TMDL.  \nAll four facilities have since been connected to municipal services.  The 2002 TMDL report and \nthe 2018 analysis of water quality data by BMI Environmental Services and Nutter & Associates \nfound that NPDES point sources are not the cause of elevated levels of fecal indicator bacteria.  \nAs such, the majority of the 2018 report utilized land use data, windshield and boat \nreconnaissance surveys and stakeholder feedback to start to identify potential nonpoint \npollutant sources and/or opportunities for implementing Best Management Practices (BMP).\n69\n \nPathogens such as fecal coliform and e. coli can come from waste from humans from failing \nseptic systems or discharge from sewer treatment plants, domestic animal waste such as from \npets or livestock, or wildlife.  Basic levels of testing do not provide enough data to determine the \nspecific source, however additional testing can be done that will give a better indication of \nwhere the pathogens are coming from.  Based on results from geospatial data and watershed \nreconnaissance, the 2018 analysis divided the watershed into three subunits.  Each subunit \n(north, middle and south) had common characteristics that suggested similarities in sources of \n\n35 \n \npathogenic loading and therefore similar prescriptions for recommended BMPs.  The northern \nunit is more rural and has some agricultural uses and low-intensity development.  In this unit, \nsources more common to rural areas such as runoff from livestock operations or failing septic \nsystems are more likely.  The middle unit consists mainly of conservation lands.  Sources of \npathogens in this area are more likely from wildlife or the fairly limited development along US \nHighway 57 and Old Fort Bayou corridor.  The lower unit has higher intensity development and \ndeveloping areas.  According to the report, nonpoint source loading from stormwater runoff, \nsewer system overflows and direct deposits are likely the greatest course of anthropogenic \npathogen loading.\n70\n  While it is likely that there are still impacts from nonfunctioning septic \ntanks, the most recent inventory was conducted between 2006 and 2008.  See Figure 12.  Given \ninfrastructure improvements made since 2008, it is likely that the impact has been reduced, \nalthough it would still be worthwhile to conduct a current inventory to see where there may still \nbe higher concentrations of nonfunctioning septic systems. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n36 \n \nFigure 12: Nonfunctioning Septic Systems in Old Fort Bayou Watershed (2008) \n \nNutrients such as nitrogen and phosphorus often come from fertilizers and pesticides used in \nagriculture and on residential lawns and gardens.  While there is very little available data from \nwhich to draw conclusions, results from the St. Martin High School student’s testing suggest that \nmore nutrient loading may be coming from the downstream urban areas as compared to the \nmore rural development and golf course upstream. \nVarious activities throughout the watershed seem to be intensifying erosion and sedimentation.  \nNew residential and commercial construction that exposes soil without adequately managing for \nthese changes both during and after construction can have a significant impact on the hydrology \n\n37 \n \ndownstream.  This seems to be a significant current problem and one that is likely to worsen if \nnot aggressively managed in the future.  See Figure 13.  \n \nFigure 13: Erosion in Old Fort Bayou Watershed \n   \nSource: Elizabeth Englebretson. Photos taken June 18, 2018 and August 24, 2018. \n \nWhile litter is not well monitored within the watershed it is a visible source of pollution that \nends up in the stormwater system and waterways.  The Mississippi Coastal Cleanup managed by \nthe Mississippi State University Extension Service does have one cleanup location in Old Fort \nBayou Watershed at the Washington Avenue boat launch in Ocean Springs.  The Mississippi \nCoastal Cleanup is an annual coastwide effort to remove trash and debris from Mississippi’s \ncoastline, waterways and barrier islands.  Data is collected as part of this effort to categorize \nmajor sources of marine debris entering the coastal environment and to track change.  \nAccording to the 2017 Mississippi Coastal Cleanup report, there were only three volunteers at \nthat site and less than a half mile was covered.  Six pounds of litter were reportedly collected \nand of the litter collected, the majority was single-use plastics such as straws, bottles and bags.  \nThe current site is at the lower end of Old Fort Bayou and there are likely opportunities to add \nan additional site or sites further upstream and/or invite boaters to join the cleanup from the \nwater to increase the impact.  In addition, there is an opportunity to work with restaurants in \nthe watershed and particularly those on Old Fort Bayou to reduce the use of single-use plastics \nand educate residents.  Plastic Free Gulf Coast is an effort currently supported by the NOAA \nMarine Debris Prevention Program focused on reducing the use of single-use plastics within the \nfive Gulf States through outreach, education, and providing alternatives to restaurants and \nconsumers.  The two lead partners on the project are MSU’s Gulf Coast Community Design \nStudio and Coastal Research and Extension Center.  The program has been working closely with \ntwo restaurants in Hancock and Harrison Counties, but currently does not have any participating \nrestaurants in Jackson County. \nIn addition to litter in the waterways and along the roadways, there is evidence of illegal \ndumping of larger items in some of the more rural areas.  See Figure 14.  Currently, Jackson \nCounty, Ocean Springs and Gautier all contract with Waste Management for residential and \ncommercial garbage pick-up.  Curbside recycling and pickup of regular and some bulky items is \navailable to all residents.  Large items, including tires, that cannot be picked up curbside can be \n\n38 \n \ndisposed of at no cost at the Jackson County Landfill.  Since cost and convenience do not seem \nto be large barriers for residents in Old Fort Bayou Watershed, additional efforts may need to \nfocus on making residents aware of their options for proper disposal and/or the consequences \nof illegal dumping.   \n \nFigure 14: Illegal Dumping in Old Fort Bayou Watershed \n      \nSource: Elizabeth Englebretson. Photos taken June 18, 2018. \n \n \n \n \n \n \n \n \n \n \n \n\n39 \n \nSection 3: Management and Monitoring Plan \n \n3.1 Watershed Management Actions \nBest Management Practices (BMPs) are techniques used to manage and improve water quantity and \nquality.  The goal of BMPs are to reduce or eliminate contaminants collected by stormwater as it moves \ninto streams and rivers.  Best management practices can be structural (i.e. permeable paving, living \nshorelines or bioretention areas) or nonstructural (i.e. wetland conservation or policies and ordinances \nthat require or incentivize individuals to implement measures to improve water quality or manage the \nquantity of water coming off their property).  Section 3.1.1 gives a summary of best management \npractices that have been completed since the development of the 2007 Old Fort Bayou Action Plan while \nSection 3.1.2 describes recommended best practices to be implemented in the future. \n \n3.1.1 Current Management Actions \nOld Fort Bayou/Tuxachanie Creek Watershed Nonpoint Source Pollution Demonstration Project \nThe Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint Source Pollution Demonstration \nProject was the result of a partnership between the Mississippi Soil and Waters Conservation \nCommission, Mississippi Department of Environmental Quality, United States Environmental \nProtection Agency, United States Department of Agriculture Natural Resources Conservation \nService, and the Jackson County Soil and Water Conservation District.  The primary goals of the \nproject were: \n1. To improve water quality and protect high quality waters by demonstrating the \neconomic benefits of selected BMPs in targeted areas, \n2. To apply BMPs to agricultural land in the demonstration project so as to reach the \ndesired outcome of reduced runoff, nutrients and sedimentation, and \n3. To inform and educate the public about BMPs that benefit water quality.\n71\n \nThe project began in November 2001 and concluded in September 2006 and resulted in the \ninstallation of a significant number of BMPs within the rural area of the 102,000-acre watershed \n(See Table 3).   Education and outreach included demonstration farms, educational field days, \npress releases and fact sheets.  The total project cost was $376,867.  Appendix J contains the \nfinal report for the Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint Source Pollution \nDemonstration Project. \n \n \n \n \n \n \n \n \n\n40 \n \nTable 3: Summary of Best Management Practices Installed \nBMP Number of \nPractices \nNumber of \nAcres \nTotal Tons of Soil \nSaved Per Year \nEstablishment of Permanent Vegetation 1 3 12 \nFencing 26 46,000 ft  \nHeavy Use Area Protection 12   \nNutrient Management 9 724 2,916 \nPasture & Hayland Planting 15 404 1,667 \nPond 1 80 560 \nStream Crossing 1   \nStreambank & Shoreline Protection 1 70 560 \nWater & Sediment Control Basin 5 186 1,696 \nTank/Trough 11   \nChiseling 1 56 224 \nTotal 83 1,523 7,635 \n \nNPDES Phase II Stormwater Management Plans \nAll three jurisdictions that overlap with Old Fort Bayou Watershed have NPDES Phase II \nStormwater Management Plans are on file with the Mississippi Department of Environmental \nQuality.  The purpose of the plans is to address any existing water quality issues and to prevent \nwater quality impairment resulting from stormwater runoff within the jurisdiction’s MS4 \npermitted area.  The City of Gautier’s plan is still under review, but has been considered as part \nof this watershed planning work.  The City of Ocean Springs and Jackson County have both \nsubmitted their annual reports for 2017.  Per ACT7, S-2 of the MS4 General Permit, the \n“coverage recipient is to annually summarize the progress made in implementing the conditions \nof the permit and the elements of the Storm Water Management Program (SWMP).”  Section I \nof the annual report is a Summary of Implementation Activities by Minimum Measure and Best \nManagement Practice which includes best management practices related to stormwater.  The \nreports include extensive lists of strategies that have and will be implemented ranging from \npublic education and involvement to pre- and post-construction stormwater controls.  See \nAppendix K: Jackson County and Ocean Springs MS4 2017 Annual Reports.  Strategies \ndocumented for all three jurisdictions are very similar and as evident by the 2017 annual \nreports, Ocean Springs and Jackson County appear to be following through with implementation \nto an above average degree.  The Old Fort Bayou Watershed Implementation Plan does \nrecommend some ways to improve and/or expand strategies included in the jurisdictions \nStormwater Management Plans (See Section 3.1.2: Planned Management Actions and Section \n3.1.3: Future Outreach and Education Activities)    \nConservation Lands \nThe U.S. Fish and Wildlife Service (FWS), The Nature Conservancy (TNC) and the Land Trust for \nthe Mississippi Coastal Plain (LTMCP) all have significant landholdings in Old Fort Bayou \nWatershed as described above.  FWS and TNC both own and manage larger parcels in the \nmiddle of the watershed, while LTMCP has a number of smaller properties in the lower \nwatershed along Old Fort Bayou.  All three entities employ a range of BMPs on their properties. \n\n41 \n \nBest Management Practices used by FWS focus on the restoration of the endangered Mississippi \nsandhill cranes and their habitat, the wet pine savanna as documented in the Mississippi \nSandhill Crane National Wildlife Refuge Comprehensive Conservation Plan.  This involves \nrestoring or maintaining the local hydrology, increasing water for crane nesting areas, and \ncreating shallow-water areas.  FWS also implements other BMPs including, but not limited to: \n• Nuisance wildlife management \n• Invasive species management \n• Farming for wildlife (i.e. cultivating upland sites to provide winter feeding areas for the \ncranes) \n• Fire management (i.e. prescribed burns) \nA significant portion of the Conservation Plan also focuses on education and outreach \nstrategies.\n72\n \nThe Nature Conservancy has a Management Plan for their Old Fort Bayou Nature Preserve-\nMitigation Bank that focuses on restoration and management efforts within the nature \npreserve. In addition, the property also has an Ecological Restoration Plans and Mitigation \nBanking Instrument that aid in guiding restoration efforts.  TNC’s East Gulf Coastal Plain \nEcoregional Plan depicts the Old Fort Bayou area as an Area of Conservation Interest. TNC \nimplements a number of BMPs focused on wet pine savanna restoration on their Old Fort Bayou \nMitigation Bank. These include: \n• Prescribed burns \n• Invasive species management \n• Native vegetation plantings \n• Management of vernal ponds for endangered species \n• Erosion control of roads and trails \nThe Land Trust for the Mississippi Coastal Plain also implements BMPs on their properties in the \nwatershed.  BMPs have included removal of invasive species, planting native vegetation and \nerosion control.  LTMCP is also dedicated to providing quality access through low impact trails \nand education to the public around the natural landscapes and BMPs on their properties.    \nThe Preserve Golf Club \nThe Preserve Golf Club, located in Vancleave and adjacent to Old Fort Bayou, has been a \ncertified Audubon Signature Sanctuary since 2007.  As such, The Preserve has been dedicated to \nprotecting the natural environment in addition to providing a high quality golf experience.  In \naddition to being home to approximately 32 acres of mitigated wetlands, The Preserve is a \nshowcase of many Best Management Practices.  See Appendix L: Case Study - The Preserve Golf \nClub.  Several of the BMPs are listed below: \n• Vegetative buffer strips \n• Irrigation system to minimize drift and maximize water use efficiency \n• Special management zones (i.e. no or limited spray) \n• Bridge crossings over sensitive areas \n• Habitat management (i.e. controlled burns) and restoration \n• Native plantings and removal of invasive species \n• Wildlife management (i.e. bird and bat houses) \n\n42 \n \n• Proper storage of fertilizers and pesticides \n• Cleaning areas and protocols for equipment that comes in contact with chemicals \nIn addition to implementing an extensive range of BMPs at The Preserve, the Director of Golf \nOperations has been very involved in developing the BMP manual for golf courses in Louisiana \nand Mississippi.  The manual is still in progress and hopefully will be completed in 2019.  The \nDirector has also been very involved on the Old Fort Bayou Watershed Steering and Technical \nAdvisory Committee and is a key partner in the work with St. Martin High School students.  The \nPreserve has the potential to be an even more visible leader and influencer in terms of Best \nManagement Practices both in the watershed and larger region. \n \n3.1.2 Planned Management Actions  \nPrevious sections in the WIP have described challenges and opportunities facing Old Fort Bayou \nWatershed (Section 2.4.6 Sources of Pollutions) and identified the goals and objectives for \nrestoring the watershed (Section 1.2.4 Goals and Objectives).  The following management \nstrategies are organized around these challenges and opportunities and are recommended \nbased on their ability to address the goals for restoring and enhancing Old Fort Bayou \nWatershed.   A full listing of potential management strategies recommended for Old Fort Bayou \nWatershed including responsible parties, potential funders, estimated costs and a \nrecommended implementation timeline is included in Appendix F: Management Actions.  Where \napplicable, expected reductions to fecal coliform loads are indicated to demonstrate ability to \nmeet and/or exceed the goal of a 35% reduction as put forth by the 2002 TMDL.  Actual \nreductions in fecal indicator bacteria loading can only be determined with a better \nunderstanding of sources of contaminants and modeling based on the size and location of BMPs \nto be installed.  While this level of data does not exist for the Old Fort Bayou Watershed \nImplementation Plan, there is little doubt that a combination of the strategies recommended \nbelow will accomplish the goals set forth in the 2002 TMDL and this planning document. \nOld Fort Bayou Watershed Partnership \nSince watershed boundaries do not correspond to municipal boundaries and often include \nmultiple jurisdictions, watershed plans are usually under the care of a watershed partnership.  A \nformal watershed partnership was not established as part of this planning work, however, the \nactive participation of the Steering and Technical Advisory Committee, including the Education \nand Outreach Subcommittee, has contributed greatly to the development of the Old Fort Bayou \nWatershed Implementation Plan and all that has been accomplished in Old Fort Bayou \nWatershed to date.  Up to this point, however, the meetings and activities of the committees \nhave been coordinated by a paid facilitator.  According to a study of watershed management \norganizations conducted at the University of Oregon, “many [watershed groups] were unable to \nsustain themselves once the sponsoring agency withdrew its provisional leadership” and that \n“volunteer coordinators, or part-time coordinators loaned from partner agencies, are \ninadequate to maintain effective group leadership.”\n73\n In the short term, there is already a \nJackson County Stormwater Task Force coordinated by Jackson County with participation from \nthe four cities in Jackson County.  Since this task force already deals with many overlapping \nareas including stormwater management BMPs and outreach and education, it would be an \neasy transition for this group to adopt responsibility for the Old Fort Bayou Watershed \nImplementation Plan.  Per the County’s 2017 MS4 annual report, the task force is considering \n\n43 \n \nexpanding participation to include citizen members.  Adding additional members to the task \nforce who have served on the Old Fort Bayou Watershed Steering and Technical Advisory \nCommittee would both support the goals of the MS4 jurisdictions and forward the work of the \nOld Fort Bayou Watershed Implementation Plan.  Another option would be for The Mississippi \nDepartment of Environmental Quality to consider funding a watershed coordinator grant \nprogram similar to what was done in California through the Department of Conservation.\n74\n \n \nData Gaps \nSeasonal water quality monitoring has been regularly performed by MDEQ at a state ambient \nmonitoring station (#0481299) near the mouth of Old Fort Bayou.  Data on fecal indicator \nbacteria recorded at this monitoring station from 2009 to 2017 is included in Section 2.4.5.  \nAside from this, little data has been collected.  Significant data gaps remain and are described \nbelow.  In general, ambient water quality data should continue to be collected, but from \nmultiple sites throughout the watershed to give a more comprehensive picture of sources of \nimpairments in Old Fort Bayou. \n Primary Source(s) of Pathogens \nFindings from both the 2002 TMDL report and this watershed assessment indicate that \npathogens are most likely coming from nonpoint sources.  As noted in Section 2.4.6, \npathogens can come from many different nonpoint sources and current available data \ndoes not allow for identifying specific sources.   Additional bacteria monitoring may be \nhelpful in delineating inputs.  In addition, the most recent survey of septic systems in \nOld Fort Bayou Watershed was conducted by the Mississippi Department of Health in \n2008.  It would be beneficial to update the survey in coordination with outreach and \neducation efforts to inform septic system owners of proper maintenance procedures. \nNutrients \nVery little data exists on nutrient loads (Total Nitrogen and Total Phosphorus) in the \nwatershed.  Students from St. Martin High School did test for nutrients at two sites on \nOld Fort Bayou as part of the B-WET program on November 5, 2018 and the results are \nincluded in Section 2.4.5.  This data, however, was not collected according to accepted \nscientific protocols so cannot be used to draw any firm conclusions.  That said, \ncomparing results from the upstream site and the downstream site suggest that more \nnutrient loading may be coming from the downstream urban areas as compared to the \nmore rural development and golf course upstream.    \n Erosion and Sediment Delivery Rates \nBased on visual surveys of the watershed and anecdotal information from longtime \nresidents, sedimentation in Old Fort Bayou appears to be a growing concern.  Main \nsources appear to be cleaned/cleared drainage ditches and new construction.  \nMethodologies such as semi-quantitative models developed for erosion and sediment \nyield assessments at the basin scale can be used to more narrowly define sources of \nerosion and sediment.  After source and quantity are identified, a sediment delivery \nprocedure can be used to determine how sediment is being naturally transported from \nthe source of erosion to a specific location in the waterway.  Employing such a model in \n\n44 \n \nOld Fort Bayou Watershed could help identify where to target BMPs so that more \nsignificant results can be realized with fewer investment dollars. \n \nPriority Projects \n  Conservation & Restoration at Bayou Talla \nThe Land Trust for the Mississippi Coastal Plain is currently negotiating acquisition of \nseveral properties totaling 13.98 acres along Old Fort Bayou and Bayou Talla.  See Figure \n15.  These properties have significant conservation value in terms of preserving riparian \nbuffers in critical areas of the watershed and offer connectivity to other properties \nowned and managed by LTMCP.  The property that extends north along Bayou Talla \nconnects to property owned by Jackson County School District and home to St. Martin \nSchools.  This connectivity offers additional opportunities for access, education and \noutreach.   \nFigure 15: Potential Area for Conservation and Restoration Activities \n \nSt. Martin High School also has access to an outdoor classroom and trail which has not \nbeen managed or used for a period of time.  LTMCP has proposed working with students \nand a group of Navy Volunteers stationed in Pascagoula, MS to restore the trail and \noutdoor classroom. \n  Golf Courses \nThe Preserve Golf Club located at the northern end of Old Fort Bayou is a leader in golf \ncourse BMPs and has already implemented an impressive list as described above.  The \n\n45 \n \nGolf Course Superintendents Association of America (GCSAA) has been leading a \nnational effort to encourage voluntary use of BMPs on golf courses.  The motivation \nbehind the effort is to protect water quality through voluntary measures and to avoid \ntop-down regulation that may unnecessarily hinder golf operations.  Florida has already \ndeveloped their state-specific manual of best management practices and is leading the \ncharge.  Mississippi and Louisiana have made significant progress in developing their \njoint manual which should be completed in 2019.  GCSAA is encouraging all manuals to \nbe completed and BMPs to be implemented by 2020.  While there are still additional \nBMPs that can be implemented at The Preserve, as mentioned above, The Preserve has \nthe potential to be an even more visible leader and influencer in terms of Best \nManagement Practices both in the watershed and larger region.    \nFurther downstream on Old Fort Bayou is Gulf Hills Golf Course.  The area is historically \nsignificant and includes a hotel and number of single-family homes. See Section 2.1.2.   \nThough technically just outside of the Old Fort Bayou Watershed (HUC 031700090604) \nboundary, it is included in the recommendations because it drains into Old Fort Bayou \nas it is about to enter the Back Bay of Biloxi.  The manager of the Gulf Hills Hotel and \nConference Center was active on the Steering Committees for the 2007 Old Fort Bayou \nWatershed Action Plan and the 2018 Watershed Implementation Plan, including hosting \nthe third meeting of the Steering and Technical Advisory Committee on September 25, \n2018.  While less has been done to date in terms of BMPs targeted specifically at water \nquality compared to The Preserve, because of close proximity to the hotel and \nresidential area there is a significant opportunity for implementing BMPs coupled with \noutreach and education. \n  Urban Ordinances & Low Impact Development \nOne of the top concerns identified in the watershed assessment was water quality \nimpairments and increased risk of flooding during intense rain events due to \nstormwater runoff in the more developed areas.  Development has increased over the \npast several years and is likely to continue.  All three jurisdictions have ordinances \naimed at controlling stormwater runoff, yet in general, the region is much less \ncomfortable with principles and strategies related to Low Impact Development than \nmany other areas of the Country.   \nThe B-Wet program with St. Martin High School students has focused on Low Impact \nDevelopment strategies for addressing stormwater runoff. See Appendix E.  The \nprogram will continue through August 2019 and includes a summer internship for four \nstudents to work with the Jackson County Planning Department to identify barriers to \naddressing stormwater issues and recommend solutions.  Recommendations may \ninclude revisions to existing ordinances, additional capacity around enforcement and/or \nways to educate on and incentivize the use of Low Impact Development technologies.  \nGiven the similarity in stormwater controls between the jurisdictions in Old Fort Bayou \nWatershed and along the coast it is very likely that recommendations resulting from this \nwork will be applicable to a much larger area. \n  \n \n \n\n46 \n \nConservation and Restoration \n  Conservation and Riparian Buffers \nAs part of the Conservation Legacy Project, the Land Trust for the Mississippi Coastal \nPlain has a map of Potential Conservation Lands that is a model of the suitability of land \nfor conservation based on ranked environmental and land use conditions including \nwetlands, hydrological soil groups, flood zones, elevation/slope, upland forest and \nimportant ecosystems.  Areas that are in Old Fort Bayou watershed and currently \nundeveloped were identified as being relatively high priority areas (See Figure 9) in \nterms of conservation and should be considered in planning and management strategies \nfor Old Fort Bayou Watershed.  See Section 2.3.5.  LTMCP should continue to work with \nJackson County, Ocean Springs, Gautier and private landowners within the watershed to \nacquire property or easements that will protect critical land within the watershed.  The \nfocus of these efforts should be on preserving, expanding and restoring riparian buffers \nalong Old Fort Bayou. \nIn addition, the Mississippi Sandhill Crane National Wildlife Refuge has established a \npartnership with Wildlife Mississippi, also known as the Mississippi Fish and Wildlife \nFoundation, to conserve private lands near the refuge through conservation easements.  \nConservation efforts should continue to be pursued and coordinated across the \nwatershed.   \nLiving Shorelines and Marsh Restoration \nStreamside buffers and living shorelines are very effective in improving water quality \nand habitat along waterways.  A living shoreline describes a natural approach to \nshoreline stabilization that reduces erosion while preserving or creating habitat along \nthe shoreline.  A visual survey done of Old Fort Bayou by members of the Steering and \nTechnical Advisory Committee on August 24, 2018 revealed that while many healthy \nmarsh areas remain intact, there are also quite a few opportunities to remove derelict \nstructures and hardened shorelines and replace them with living shorelines.   \nResults of these efforts would be further enhanced by some type of incentive program \nfor homeowners who willingly implement BMPs along the shorelines.  The Scenic \nStreams Program and Partners for Fish and Wildlife Program are two examples designed \nto promote voluntary conservation and best management practices.  The Scenic \nStreams program, under the leadership of the Department of Wildlife, Fisheries and \nParks, began in 1999 and opened the door for participants in the program to be able to \nreceive tax incentives that are or may become available.  The Southeast Region Partners \nfor Fish and Wildlife Program is a branch of the US Fish and Wildlife Service that \nprovides technical and financial assistance to private landowners interested in \nimproving habitat as they maintain their primary land management goals.  \n \nRecreation and Ecotourism \nBlueway \nOld Fort Bayou is currently a successful blueway.  Plans for an expansion up Bayou Talla \nand updates to both printed material and signage are in the works.  See Section 2.4.2.  \n\n47 \n \nAccess to Old Fort Bayou is seen as a positive thing and these plans are encouraged so \nlong as they are coupled with education and outreach on environmental stewardship. \nNo Wake Zones \nAs evident from the boat tour of Old Fort Bayou on August 24, 2018, there are areas \nalong the waterway where significant scouring is occurring.  Some of this scouring may \nbe the result of increases in stormwater runoff due to development, but some may be \ndue to wake from boat traffic.  Further observation of boat traffic could help to \ndetermine the level to which waves caused from water vehicles travelling at higher \nspeeds is a problem in Old Fort Bayou.  Signage or other means of educating the public \non water quality impairments caused by scouring associated with wave action may be \nnecessary. \n Watershed Signage \nIn addition to blueway signage, the addition of Old Fort Bayou Watershed signage \nstrategically installed around the watershed is recommended as a low-cost tool for \nincreasing community awareness of the watershed. \n Promotion of Conservation Areas Open to the Public \nThe Mississippi Sandhill Crane National Wildlife Refuge Comprehensive Conservation \nPlan states that public use and visitation are encouraged at the Refuge in four priority \nareas including wildlife observation, wildlife photography, environmental education and \ninterpretation.  A public use development plan was apparently drafted by the Refuge in \n1985, but there is no record of the plan being submitted or approved.\n75\n  The \nConservation Plan indicated that a Visitor Services Plan would be developed, but to date \nno plan has been completed.\n76\n  Developing a Visitor Services Plan in line with the goals \nand objectives of the Old Fort Bayou Watershed Implementation Plan should be \nconsidered a high priority for the Refuge as a critical stakeholder in Old Fort Bayou \nWatershed. \n \nWaste and Wastewater \n Nonfunctioning Septic Systems \nAccording to a survey done by the Mississippi Department of Health (MSDH) in 2008, \nthere were pockets of nonfunctioning septic systems in Old Fort Bayou Watershed.  See \nFigure 13.  The most significant clusters were in the northern tip of the watershed and in \nthe south-central area.  Following Hurricane Katrina, sewer and water districts across \ncoastal Mississippi were able to tie-in many areas that were previously on septic \nsystems, primarily using funds through the Coastal Impact Assistance Program (CIAP).  \nAn updated assessment of remaining nonfunctioning septic systems should be \nconducted, coupled with an educational campaign about the risks of nonfunctioning \nseptic systems and proper maintenance.  An example program is being implemented in \nthe town of Bluffton, South Carolina following recommendations in the May River \nWatershed Action Plan.  The programming utilizes the Coast-A-Syst model of home \nassessment and action.\n77\n   \n\n48 \n \nLitter \n Coastal Cleanup Extension & Other Cleanup Events/Incentives \nThe Mississippi Coastal Cleanup does have one cleanup location in Old Fort Bayou \nWatershed at the Washington Avenue boat launch in Ocean Springs, however, it has had \nvery few volunteers and is limited in geographic scope.  See Section 2.4.6.  Additional \nefforts to increase the number of volunteers is recommended, in addition to adding a \ncleanup site or sites further upstream.  It would also be beneficial to add cleanup efforts \nfrom the water.  This could be accomplished by inviting boaters to join the Mississippi \nCoastal Cleanup to increase the impact or by adding a cleanup component to other \nevents such as Battle on the Bayou.  Mississippi Power’s Renew Our Rivers Program is \nanother potential partner that can help with future cleanups from the water.  Finally, \nrestaurants on Old Fort Bayou and/or other businesses or organizations could also offer \na reward or incentive to patrons to who document litter collection efforts along the \nbayou or in the watershed.   \n Trash Catches in Commercial Area \nWhere there are curb and gutter drainage systems, especially in commercial areas, litter \ncan easily be washed down the storm drains and into waterways.  Trash catches or drain \nguards installed at the catch basins would help prevent litter from entering the \nwaterways. \n Street sweeping \nRoadway litter and debris are evident throughout the watershed and larger region and \neasily make their way into waterways through the drainage system.  Regular street \nsweeping should be coordinated through the county and city road maintenance \ndepartments.  \nAdopt-a-Roadway \nCurrently, adopt-a-highway programs are administered by the federal and state \ndepartments of transportation.  Eligible roadways include federal and state highways.  \nThrough these programs, public and private organizations and individuals agree to clean \na one to two mile segment of the highway a certain number of times per year.  In \nexchange, dedication signage and clean-up materials are provided by the Department of \nTransportation.  These programs not only serve to clean-up roadway litter, but also help \ndeter litter in the first place.  Drivers and pedestrians that see Adopt-a-Roadway signage \nand witness volunteers picking up garbage are more likely to think twice about littering \nin that area.   \n \nUrban BMPs \n Nonstructural \n  Ordinance Updates    \nIt is likely that an assessment of the jurisdictions’ ordinances related to \nstormwater management will indicate that improvements can be made.  \n\n49 \n \nRelated ordinances include stormwater management ordinances; ordinances for \nstormwater runoff, illicit discharges, and illegal connections; flood damage \nprotection ordinances; and building codes.  This assessment is to be completed \nfor Jackson County as part of the B-WET program underway with St. Martin High \nSchool as described above and in Appendix E.  \n  Coastal Technical Manual \nEffective stormwater management requires connecting the dots from policy \nimplementation to proper construction and installation of best management \npractices.  Many of the jurisdictions on the coast are looking to implement \npolicies that would allow, incentivize or require pre and post-construction best \nmanagement practices addressing stormwater runoff, but are unfamiliar with \nsome of the technical aspects or unclear about the implications of certain \npolicies.  The State of Georgia addressed this concern and information gap by \ncreating a Stormwater Management Manual.  The Georgia Stormwater \nManagement Manual has several volumes including a Policy Guidebook, \nTechnical Handbook and Coastal Supplement.  Jurisdictions in Georgia refer to \nthese volumes in their policies and ordinances so that standards and guidelines \nare clear for all affected parties. \nThe Mississippi Department of Environmental Quality has developed a similar \nmanual called Erosion Control, Sediment Control and Stormwater Management \non Construction Sites and Urban Areas, however, it does not have as many \ntechnical details as the Georgia Manual, does not have a coastal supplement \nand is not used as effectively by jurisdictions in Mississippi as the Georgia \nManual is in Georgia.  MDEQ should consider adding a coastal supplement to \ntheir technical manual so it is more relevant to jurisdictions on the coast or \nadopting Georgia’s Coastal Stormwater Supplement to the Georgia Stormwater \nManagement Manual.  In addition, MDEQ should look to partner with the \nMississippi Alabama Sea Grant Consortium, Grand Bay National Estuarine \nResearch Reserve (NERR), or similar organizations and agencies to provide \ntraining to jurisdictions and engineers on how to use the manual. \n  Fertilizer Ordinance \nPreliminary water quality data recorded by students at St. Martin High School \nsuggest that more of the nutrients entering Old Fort Bayou are coming from the \nmore urban area of the watershed and most likely from fertilizer use.  To \naddress fertilizer use in urban areas many jurisdictions in Florida have adopted \nsome form of a fertilizer ordinance based off of the Florida Department of \nEnvironmental Quality’s Model Ordinance for Florida-Friendly Fertilizer Use on \nUrban Landscapes.  See Appendix H:  Model Ordinance for Florida-Friendly \nFertilizer Use on Urban Landscapes.  The jurisdictions in Old Fort Bayou \nWatershed should consider adopting some form of fertilizer ordinance, in \ncoordination with education and outreach to property owners and lawn care \nbusinesses about responsible fertilizer use, as a means of reducing nutrients \nentering Old Fort Bayou. \n \n\n50 \n \nStructural \n  Pre and Post Construction \nAny type of construction or earthwork exposes soil and makes areas more \nsusceptible to erosion.  Best management practices for controlling impacts from \nconstruction are extremely important, especially given the increase in \ndevelopment following the recession.  For most development, a Stormwater \nPollution Prevention Plan is required in which the developer must show what \nbest management practices they intend to implement to minimize impacts \ndownstream.   \nIn most jurisdictions on the coast, if a site is over five acres, the site is the \njurisdiction of MDEQ.  A Stormwater Pollution Prevention Plan (SWPPP), Large \nConstruction Notice of Intent (LCNOI) and permit are required and must be filed \nwith MDEQ and the jurisdiction.  Under five acres is the jurisdiction’s \nresponsibility.  Most jurisdictions require that development under five acres \nhave a permit, Small Construction Notice of Intent (SCNOI) and SWPPP.  Usually \nif a site is under one acre the jurisdiction does not require a plan or permit. \nMDEQ has a technical guide to assist in the development of these plans titled \nErosion Control, Sediment Control and Stormwater Management on \nConstruction Sites and Urban Areas.  Volume one, Erosion and Sediment Control \nManual, covers BMPs through construction and volume two, Stormwater Runoff \nManagement Manual, covers post construction BMPs.  There does not appear \nto be a lack of regulation or guidance concerning pre and post construction \nBMPs, however, there are currently active construction sites that do not have \nadequate controls in place.  See Figure 16.  The issue appears to be more with \nlack of capacity to enforce the SWPPP’s.  As development continues to increase \nin Old Fort Bayou Watershed, MDEQ and the jurisdictions need to view erosion \nand stormwater control as a priority and increase their capacity to monitor and \nenforce SWPPP’s.   \n \n \n \n \n \n \n \n \n \n \n \n\n51 \n \nFigure 16: Active Construction Sites in Old Fort Bayou Watershed \n  \nSource: Elizabeth Englebretson. Photos taken June 18, 2018 \n  Drainage swale maintenance \nThe drainage systems in Old Fort Bayou Watershed are primarily open, grassy \nswales.  This is an excellent starting point in terms of stormwater management \nbecause there are theoretically more opportunities for infiltration than with \npiped, curb and gutter systems.  In order to function at an optimal level, \nhowever, swales need to be properly maintained.  Maintenance typically \ninvolves litter control and maintaining the grass or wetland plant cover.  \nSediment needs to be removed once it has exceeded 25 percent of the original \ndesign volume, but scouring ditches without revegetating only creates more \nproblems downstream.  Grass should be mowed to a height of 3-4 inches and \nalternate planting should be considered where appropriate or where grass has \nnot been successfully established.  In addition, during construction it is \nimportant to stabilize the embankment either with a temporary grass cover or \nwith natural or synthetic erosion control products.  General maintenance \nguidelines can be found online at \nhttp://water.epa.gov/polwaste/npdes/swbmp/Grassed-Swales.cfm \n  Small Scale Urban BMPs \nRain barrels and rain gardens are examples of smaller scale urban BMPs that can \nhave a significant positive impact on water quality if implemented throughout a \ncommunity.  There are many opportunities in the more developed areas where \nthese practices can be encouraged.  Local garden clubs would be excellent \norganizations to educate and encourage the community in regards to these \npractices along with encouraging the use of native plants.  In addition, small, \nhighly-visible demonstration projects can be implemented at businesses and \norganizations in and around the watershed.  Coupled with educational signage, \n\n52 \n \nthese projects can serve to inform community members about BMPs.  \nOrganizations like the Walter Anderson Museum of Art and the Mary C O’Keefe \nCultural Center would be excellent sites for demonstration projects that also \nincorporate artistic components. \n \nAgricultural and Rural BMPs \n Nonstructural   \nLogging BMPs \nForested areas within Old Fort Bayou Watershed are periodically used for \nharvesting lumber.  The Mississippi Forestry Commission (MFC) encourages \nBMPs in regards to forestry and logging and has a guide called Best \nManagement Practices for Forestry in Mississippi.  MFC could go a step further, \nhowever, and incentivize implementation of these practices.  In Missouri, the \nMissouri Department of Conservation implemented a cost-share program \ndesigned to be a partnership between the logger and property owner.\n78\n  The \nMDC pays loggers $10 to $20 per acre and landowners $5 for every acre in \nwhich they implement BMPs.  Funding was provided through a Natural \nResources Conservation Service Conservation Innovation Grant. \nOrdinances can also help improve logging practices through regulation and/or \nincentives.  An example of such an ordinance is from Carbon County, Utah, \nwhere County Commissioners passed a Timber Harvest Ordinance.  Property \nowners are required to submit an application and obtain a permit to harvest \ntimber when it will exceed a certain tonnage.  The ordinance also called for the \nselection and appointment of a professional County Forester. This person \nadministers the ordinance by reviewing permit applications, issuing permits to \nqualifying applicants, and inspecting logging jobs on private land. Other forest \npractices addressed include road maintenance, winter operations, site \npreparation, regeneration, revegetation, chemical management, and prescribed \nburns.\n79\n   Jackson County should consider using a similar mechanism to increase \nthe implementation of logging BMPs.   \n \nStructural \nThe following structural, agricultural BMPs are recommended by the Jackson County Soil \nand Water Conservation District, Mississippi Soil and Water Conservation Commission \nand Natural Resources Conservation Service based on remaining opportunities following \nthe implementation of the Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint \nSource Pollution Demonstration Project that concluded in 2006. \nDuring the development of this Watershed Implementation Plan the Jackson County Soil and \nWater Conservation District in coordination with the Mississippi Soil and Water Conservation \nCommission and United States Department of Agriculture Natural Resources Conservation \nService assessed the remaining opportunities for BMPs in the more rural area in the northern \npart of the watershed; taking into account investments that were made between 2001 and \n\n53 \n \n2006 as part of the Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint Source Pollution \nDemonstration Project.  Table 4 below is a result of that assessment.  Brief descriptions of each \nstrategy included in the table can be found below in the subsection on Agricultural and Rural \nBMPs: Structural. \n \nTable 4: Summary of BMPs Recommended for Old Fort Bayou Watershed \nPractice Average Unit NRCS Cost Units Total Cost \nCritical Area Planting $248.10  32 acres $7,939.20  \nFence $1.91 12,499 ft $23,873.09  \nGrade Stabilization Structures $5,000 5 $25,000.00  \nHeavy Use Area $1.04 8,000 acres $8,320.00  \nPipeline $1.75 3,600 ft $6,300.00  \nStream Bank Protection $1.54 1,588 acres $2,445.52  \nGrassed Waterways $1,648 13 $21,424.00  \nPond $3.77 2,120 acres $7,992.40  \nTank/Trough $4,600 10 $46,000.00  \nTOTAL     $149,294.21  \n \nHeavy Use Area Protection \nHeavy use area protection methods reinforce locations that are frequented by \nlivestock by establishing vegetative cover, surfacing with suitable materials, or \ninstalling needed structures.  Heavy use protection areas are often combined \nwith tanks or troughs that hold drinking water for livestock.  \nFencing \nFencing should be strategically placed to exclude livestock from areas that \nshould be protected from grazing or access, such as waterways. \nPond (Alternative Water Source) \nPonds can be installed by constructing a dam or an embankment or by \nexcavating a pit or dug out.  Ponds can serve to catch and store runoff and act as \na water source for livestock. \nCritical Area Planting \nAppropriate vegetation should be planted in areas that are critically eroded or \nlikely to experience erosion.  It is important for water quality for any \neroded/erodible areas to be planted, it is emphasized here for rural and \nagricultural zones because these areas can easily go overlooked on larger plots \nof land. \nTank/Trough \nA watering facility to be able to hold water for the purpose of livestock to drink.   \n\n54 \n \nGrade Stabilization Structures \nAn earthing, concrete, or other structure(s) built across a drainage to prevent \ngully erosion. \nPipeline \nA waterline from existing water wells, troughs, or other water sources. \nStream Bank Protection \nA vegetative, structural or combination treatment of streams designed to \nstabilize the stream and reduce erosion. \nGrassed Waterways \nBroad, shallow, and typically saucer-shaped channels designed to move surface \nwater across farmland without causing soil erosion.  The vegetative cover in the \nwaterway slows the water flow and protects the channel surface from the \neroding forces of runoff water. \n  \n3.1.3 Education and Outreach Activities \nEducation and outreach efforts are critical to informing the community about challenges \nand opportunities that affect the water quality in Old Fort Bayou Watershed and causing \nlarge-scale behavior change needed to improve impairments coming from nonpoint \nsources.  Outreach efforts were planned and initiated as part of the 2007 Action Plan.  \nThe Education and Outreach Subcommittee assembled as part of the development of \nthis Watershed Implementation Plan revisited the strategies recommended in the \nAction Plan at a work session on August 27, 2018 and determined if the strategies had \nbeen completed, implemented in-part, not implemented and/or no longer a priority.  \nAside from completion of the blueway, most strategies had not been completed, but \nremained important.  As such they have been included in some form in the \nrecommended education and outreach activities that follow.  \nWhile education and outreach were not specifically included in the scope of work of \ndeveloping this Watershed Implementation Plan, a significant degree of education \noccurred as the Steering and Technical Advisory Committee regularly met and \ninteracted with others outside the committee during the planning period.  In addition, \nas a result of funding from NOAA’s Gulf of Mexico Bay Watershed Education and \nTraining Program (B-WET), GCCDS has been able to implement a comprehensive \nwatershed education program focused specifically on Old Fort Bayou Watershed with \nstudents at St. Martin High School.  Programming will continue through August 2019 \nand is documented in Appendix E.  In addition, the Jackson County Soil and Water \nConservation District and Mississippi Sandhill Crane National Wildlife Refuge have been \nproviding education and outreach programming and materials to local school groups \nand at other events as documented in the jurisdictions’ MS4 plans and the Mississippi \nSandhill Crane National Wildlife Refuge Comprehensive Conservation Plan.  LTMCP and \nTNC also regularly disseminate information and programming as part of their missions.  \n\n55 \n \nAs mentioned above, education and outreach will be key to both the success of the Old \nFort Bayou Watershed Implementation Plan and overarching goal of improving water \nquality by reducing impairments from nonpoint sources in the watershed.  A full listing \nof potential education and outreach activities recommended for Old Fort Bayou \nWatershed including responsible parties, potential funders, estimated costs and a \nrecommended implementation timeline is included in Appendix H: Management Action. \nEducation in Schools \nProgramming started with funding through the B-WET program at St. Martin High \nSchool should be continued and expanded to include St. Martin Middle and Elementary \nSchools.  In addition, Ocean Springs’ schools should include programming focused on \nwatershed dynamics and stormwater runoff specific to Old Fort Bayou Watershed.  The \ntwo schools in the Ocean Springs School District in closest proximity to Old Fort Bayou \nare the Ocean Springs Upper Elementary School and Pecan Park Elementary School. \nArts Organizations \nThere are several arts organizations in Ocean Springs that would be excellent partners in \nterms of both demonstrating small-scale urban BMPs and watershed outreach and \neducation with an art component.  The Walter Anderson Museum of Art (WAMA) \nlocated in downtown Ocean Springs is based on Walter Anderson’s vision for \ncommunities that exist in harmony with their environment.  He greatly valued and was \ninspired by nature, particularly coastal ecosystems, as is evident in this internationally-\nrenowned artwork.  This joint vision of art and environmental stewardship and \nproximity to Old Fort Bayou make WAMA an ideal candidate for a future partner in \noutreach and education.  The Mary C O’Keefe Cultural Center would be another ideal \npartner.  The Mary C offers programming in art, music, theater and cooking and is home \nto the Ocean Springs Museum of History.  A rain garden or water feature onsite with a \nmusic component created by rainwater would be a beautiful addition to the site.  \nComplimented by signage and educational programming or an exhibit, the Mary C could \nbe a very effective partner in outreach efforts. \nLow Impact Development \nJurisdictions along the Mississippi Gulf Coast, including those in Old Fort Bayou \nWatershed, seem to be much less comfortable in implementing Low Impact \nDevelopment (LID) strategies than other areas of the County and do relatively little to \npromote or incentivize the use of LID with private developers.  Efforts are needed to \neducate the jurisdictions on Low Impact Development techniques and to provide the \njurisdictions and developers with tools to increase their capacity to promote and use \nLID.  Some of this will be accomplished with the help of student interns over the \nsummer of 2019 through the B-WET program with St. Martin High School.  In the least, \nthe students under the guidance of GCCDS and LTMCP will be able to do a thorough \nassessment of barriers to implementing LID strategies and develop solid \nrecommendations applicable to the County and others in the region. \nFacebook Page \nFacebook is a popular tool for outreach and education.  In terms of watershed planning, \na Facebook page is typically created and maintained by a watershed partnership.  While \n\n56 \n \nthere is not a watershed partnership for Old Fort Bayou Watershed, the Jackson County \nStormwater Task Force, with more participation from members of the Old Fort Bayou \nWatershed Steering and Technical Advisory Committee could serve this role. \nPlastic Free \nPlastic Free Gulf Coast is an effort currently supported by the NOAA Marine Debris \nPrevention Program focused on reducing the use of single-use plastics within the five \nGulf States through outreach, education, and providing alternatives to restaurants and \nconsumers.  The two lead partners on the project are MSU’s Gulf Coast Community \nDesign Studio and Coastal Research and Extension Center.  The program has been \nworking closely with two restaurants in Hancock and Harrison Counties, but currently \ndoes not have any participating restaurants in Jackson County.  Restaurants along Old \nFort Bayou should be encouraged to participate in this program. \nProjects for Scout Troops \nMany Boy and Girl Scout troops are active in Old Fort Bayou Watershed.  Often these \nyoung men and women are looking for volunteer projects to help complete \nrequirements of their programs.  Appendix I includes sample projects for Boy Scouts \nrelated to the Soil and Water Conservation Badge.  The Mississippi Sandhill Crane \nNational Wildlife Refuge also recommends developing a fire ecology merit badge. \nSeptic System Maintenance \nIn the absence of funding to tie-in additional areas on septic system, an educational \ncampaign about the risks of nonfunctioning septic system and proper maintenance \nshould target areas in the watershed where high concentrations of septic systems \nremain.  An example program is being implemented in the town of Bluffton, South \nCarolina following recommendations in the May River Watershed Action Plan.  The \nprogramming utilizes the Coast-A-Syst model of home assessment and action.\n80\n     \nSignage \nStrategically placed signage with an educational component can be a very cost-effective \nway to increase community members’ awareness of water quality challenges and best \nmanagement practices.  Educational signage should be installed when publically \naccessible BMPs are installed.  If not already present, signage should be added at public \naccess point or trails.  It is also recommended that general Old Fort Bayou Watershed \nSigns be added strategically throughout the watershed.  Signage should be consistent \nwith the recently completed National Heritage Area’s Blueways Design Guide. \nPet Waste \nWhile the current level of pathogen testing does not distinguish between septic waste, \ndomestic animal waste and wildlife, anecdotally, there appears to be an excessive \namount of pet waste that is left on the ground.  Bacteria in pet waste does break down \nnaturally, however the ecosystem cannot handle the number of domestic dogs typically \nconcentrated in a small area.  The natural ecosystem can only handle two canines in a \nsquare mile. In urban areas, there are often as many as 125 dogs per square mile.   \nEducation around proper disposal of pet waste should be distributed by the local \njurisdictions, property owners associations, and local pet-related businesses such as \n\n57 \n \nveterinary clinics.  Signage and waste receptacles should also be provided in areas \nwhere people frequently walk pets. \nPromote Use of Native Plants \nUse of native plants, especially in areas that tend to remain wet, are susceptible to \nerosion, or are near waterways, can have a positive and substantial effect on water \nquality.  Many residents would likely be willing to use native plants in place of grass or \ninvasive varieties if they knew what to plant and the benefits of doing so.  Local garden \nclubs and nurseries would be ideal promoters of the use of native plants.   \n \n3.2 Plan Evaluation and Revision \n3.2.1 Monitoring Plan \nMDEQ \nPost-BMP monitoring locations will be selected using best professional judgment and will be \ntargeted to reflect water quality downstream of BMP activity.  Once BMP installation is \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring \nwill be initiated.  Post BMP monitoring will be conducted in a way that allows for comparison \nwith the pre-implementation data.  Because recovery periods of streams can be dependent on \ntype and amount of BMPs installed, more than 1 year of post BMP data may be needed to \nobserve a change in water quality.  In some cases, it may take 5 or more years to see full \nbenefits of BMPs. All data collection efforts will be conducted using trained personnel following \nestablished Standard Operating Procedures and adhering to agency Quality Assurance \nprotocols.\n81\n \nRestore Corps \nClimb Community Development Corporation (Climb CDC) is a nonprofit Mississippi community \ndevelopment agency whose mission is to promote strong communities by providing individuals \naccess to opportunities that inspire self-reliance.  As part of its workforce training program, \nCLIMB CDC formed a Gulf Coast Restore Corps that is part of the national Corps Network.  The \nRestore Corps will participate in projects related to the restoration of the Gulf of Mexico from \nthe effects of the 2010 Oil Spill.  The team is able to provide services including monitoring water \nquality, conducting visual waterway assessments, and implementing or providing ongoing \nmaintenance for restoration/recreation projects.  Fees for services are relatively minimal and \nare determined at the time the services are requested.  If state agencies such as MDEQ are not \nable to continue monitoring in Old Fort Bayou in the future, consideration should be given to \npartnering with paid and semi-professional groups like the Gulf Coast Restore Corps for periodic \nmonitoring and assessment. \nSchools \nAs mentioned in Sections 1.3 and 3.1, the Gulf Coast Community Design Studio secured funding \nfrom NOAA’s Gulf of Mexico Bay Watershed Education and Training Program (B-WET) for the \n2018-2019 school year to work with 10\nth\n through 12\nth\n grade students enrolled in environmental \nscience-related classes at St. Martin High School and several interns over the summer.  See \nAppendix E.  The grant funding not only allowed GCCDS staff to work with students during the \n\n58 \n \n2018-2019 school year, but provided supplies to teachers to continue the program in future \nyears.  St. Martin High School is encouraged to keep monitoring water quality in Old Fort Bayou \nand Bayou Talla.  Programming and monitoring capabilities should also be expanded to included \nSt. Martin Middle and Elementary School Students.  The Land Trust for the Mississippi Coastal \nPlain properties along Old Fort Bayou in Ocean Springs also offer excellent opportunities for \nschool groups from Ocean Springs to monitor water quality downstream in Old Fort Bayou. \nOther Potential Partners \nOther potential partners include Research and Education to Advance Conservation and Habitat \n(REACH) and the EPA’s Gulf of Mexico Program.   \n \n3.2.2 Adaptive Management and Plan Revision \nThe goals, objectives and resulting strategies and recommendations included in the Old Fort \nBayou Watershed Implementation Plan have been determined based on an assessment \nconducted in 2018.  Environmental and socioeconomic conditions are ever changing.  These \nconditions, as well as any implemented Best Management Practices, will likely have an impact \non the watershed and water quality in Old Fort Bayou.  As such, it is recommended that an \nintegrated assessment of Old Fort Bayou Watershed be conducted on a routine basis and that \nadjustments or amendments be made to the Old Fort Bayou Watershed Implementation Plan as \njustified by the results of the assessments.  According to the Mississippi Coastal Nutrient \nReduction Strategy, “five years is considered adequate for observing near-field changes in water \nquality from the implementation of various management practices in the watershed.”\n82\n  The Old \nFort Bayou Watershed Partnership should begin conducting its first assessment and plan \nrevision in 2023.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n59 \n \n \n \n \n \n \n \n \n \n1\n U.S. Environmental Protection Agency. Handbook for Developing Watershed Plans to Restore and Protect Our \nWaters. (2008). Pg. 2-2.  <http://www.epa.gov/owow/nps/watershed_handbook> \n2\n U.S. Environmental Protection Agency. Handbook for Developing Watershed Plans to Restore and Protect Our \nWaters. (2008). Pg. 2-2.  <http://www.epa.gov/owow/nps/watershed_handbook> \n3\n U.S. Environmental Protection Agency. Nonpoint Source Program and Grants Guidelines for States and Territories. \n(2013). Appendix C, Pgs. 63-67.  <https://www.epa.gov/sites/production/files/2015-10/documents/319-guidelines-\nfy14.pdf> \n4\n FTN Associates, Ltd. Prepared for Mississippi Department of Environmental Quality. Mississippi Coastal Nutrient \nReduction Strategies. (2011). Pg. 1. \n<http://www.deq.state.ms.us/Mdeq.nsf/pdf/WMB_MSCoastalNutrientReductionStrategies/$File/Mississippi%20C\noastal%20Nutrient%20Reduction%20Strategies.pdf?OpenElement> \n5\n Mississippi Department of Environmental Quality, TMDL/WLA Section. Fecal Coliform TMDL for the Back Bay of \nBiloxi and Biloxi Bay. (2002). Pg. xviii. \n6\n Mississippi Department of Environmental Quality, TMDL/WLA Section. Fecal Coliform TMDL for the Back Bay of \nBiloxi and Biloxi Bay. (2002). Pg. xx. \n7\n Mississippi Department of Environmental Quality. Mississippi’s Nonpoint Source Pollution Control Section 319(h) \nGrant Program Work Plan for Grant Year 2019.  Prepared for U.S. Environmental Protection Agency Section 319(h) \nof the Clean Water Act.  27 September 2018. \n<http://www.usda.gov/wps/portal/usda/usdahome?contentidonly=true&contentid=2011/12/0499.xml>. \n8\n Mississippi Department of Environmental Quality, TMDL/WLA Section. Fecal Coliform TMDL for the Back Bay of \nBiloxi and Biloxi Bay. (2002). Pg. A-1. \n9\n Mississippi Department of Environmental Quality, TMDL/WLA Section. Fecal Coliform TMDL for the Back Bay of \nBiloxi and Biloxi Bay. (2002). Pg. 5-4. \n10\n   Bellande, Ray L.  Ocean Springs Archives.  Old Fort Bayou: Ferries & Bridges (1875-2002).   \n<https://www.oceanspringsarchives.net/old-fort-bayou-ferries-bridges-1875-2002>.  Accessed 20 September \n2018. \n11\n Bellande, Ray L.  Ocean Springs Archives.  Gulf Hills Resort.  <https://www.oceanspringsarchives.net/gulf-hills-\nresort>.  Accessed 20 September 2018. \n12\n   Bellande, Ray L.  Ocean Springs Archives.  Gulf Hills Resort.  <https://www.oceanspringsarchives.net/gulf-hills-\nresort>.  Accessed 20 September 2018. \n13\n   Bellande, Ray L.  Ocean Springs Archives.  Gulf Hills Resort.  <https://www.oceanspringsarchives.net/gulf-hills-\nresort>.  Accessed 20 September 2018. \n14\n Bellande, Ray L.  Ocean Springs Archives.  Gulf Hills Resort.  <https://www.oceanspringsarchives.net/gulf-hills-\nresort>.  Accessed 20 September 2018. \n15\n The Daily Picayune, July 24, 1892, p. 12. Accessed at the Biloxi Public Library. \n16\n The Biloxi Herald, April 4, 1891, p. 1. Accessed at the Biloxi Public Library. \n17\n The Biloxi Herald, November 14, 1891, p. 8. Accessed at the Biloxi Public Library. \n                                                           \n\n60 \n \n                                                                                                                                                                                           \n18\n Jackson County Board of Supervisors Minute Bk. 2, p. 548. Accessed at the Biloxi Public Library. \n19\n Bellande, Ray L.  Ocean Springs Archives.  Jackson County, Mississippi Natural Resources & Horn Island.  \n<https://oceanspringsarchives.net/jackson-county-mississippi-natural-resources-horn-island>.  Accessed 20 \nSeptember 2018. \n20\n Bellande, Ray L.  Ocean Springs Archives.  Hotels and Tourists Homes.  \n<https://www.oceanspringsarchives.net/hotels-and-tourist-homes>.  Accessed 20 September 2018. \n21\n Bellande, Ray L.  Ocean Springs Archives.  Gulf Hills Resort.  <https://www.oceanspringsarchives.net/gulf-hills-\nresort>.  Accessed 20 September 2018. \n22\n Gulf Hills Golf Club Website. < http://gulfhillsgolf.com/>.  Accessed 4 December 2018. \n23\n Landtrust for the Mississippi Coastal Plain. Old Fort Bayou Watershed description. <http://ltmcp.org/old-fort-\nbayou-watershed/>.  Accessed 20 September 2018. \n24\n Gulf Regional Planning Commission. Current Land Use Inventory GIS Database. (2013). Analysis by Gulf Coast \nCommunity Design Studio. \n25\n Gulf Regional Planning Commission. Future Land Use Inventory GIS Database. (2013). Analysis by Gulf Coast \nCommunity Design Studio. \n26\n WLOX. Business is Booming in St. Martin. 31 August 2018. <http://www.wlox.com/story/39004321/business-is-\nbooming-in-st-martin/>. Accessed 4 December 2018. \n27\n U.S. Census Bureau. Income, Poverty, and Health Insurance Coverage in the United States: 2017. (2018). < \nhttps://www.census.gov/newsroom/press-releases/2018/income-poverty.html>. \n28\n U.S. Department of Agriculture. Geography of Poverty. <http://www.ers.usda.gov/topics/rural-economy-\npopulation/rural-poverty-well-being/geography-of-poverty.aspx#.Uwyu5IW5FO1>.  Accessed 25 February 2014. \n29\n Glaster, George C. Consequences from the Redistribution of Urban Poverty during the 1990's: A Cautionary Tale. \n(2003). National Poverty Center Working Paper Series #03-9. \n<http://moodle.technion.ac.il/pluginfile.php/129000/mod_resource/content/0/Galster_A_Cautionary_Tale_conse\nquences_from_the_redistribution_of_urban_poverty_during_the_1990s.pdf>. \n30\n U.S. Census Bureau. (2010). 1990-2010 Decennial Census. Table QT-H1. General Housing Characteristics. \n31\n U.S. Fish and Wildlife Service. (2007). Mississippi Sandhill Crane National Wildlife Refuge Comprehensive \nConservation Plan. Pgs 9-12. \n32\n Plan for Opportunity. Water Assessment. Pg 18. \n33\n Stewart, Lindsey.  Mississippi Department of Environmental Quality, Office of Land and Water Resources. \nPersonal correspondence 5 December 2018. \n34\n United States Department of Agriculture. Natural Resource Conservation Service. Custom Soil Resource Report \nfor Hancock County, Mississippi, and Harrison County, Mississippi: Soil Survey for Rotten Bayou Watershed. \n<http://websoilsurvey.sc.egov.usda.gov>. Accessed 20 August 2014. \n35\n United States Department of Agriculture. Natural Resource Conservation Service. (2007). National Engineering \nHandbook. Part 630 Hydrology. Pg. 7-1. \n36\n United States Environmental Protection Agency. Western Ecological Division. Ecoregion Maps and GIS Resources. \n<www.epa.gov/wed/pages/ecoregions/htm>. Accessed 21 November 2014. \n37\n Bailey, Robert G. and James M. Omernik. (1997). Distinguishing between Watersheds and Ecoregions. Journal of \nthe American Water Resources Association. Vol. 33, No. 5. Pg. 937. \n38\n Bailey, Robert G. and James M. Omernik. (1997). Distinguishing between Watersheds and Ecoregions. Journal of \nthe American Water Resources Association. Vol. 33, No. 5. Pg. 937.Pgs 945-947 \n39\n United States Environmental Protection Agency. Western Ecological Division. Ecoregion Maps and GIS Resources. \n<www.epa.gov/wed/pages/ecoregions/htm>. Accessed 21 November 2014. \n40\n United States Environmental Protection Agency. Western Ecological Division. Ecoregion Maps and GIS Resources. \n<www.epa.gov/wed/pages/ecoregions/htm>. Accessed 21 November 2014. \n41\n United States Environmental Protection Agency. Western Ecological Division. Ecoregion Maps and GIS Resources. \n<www.epa.gov/wed/pages/ecoregions/htm>. Accessed 21 November 2014. \n42\n United States Environmental Protection Agency. Coastal Wetlands. \n<http://water.epa.gov/type/wetlands/cwt.cfm>. Accessed 1 December 2014. \n43\n Plan for Opportunity. Water Assessment. Pg 68. \n44\n State of Mississippi. Mississippi Code of 1972. Section 57-15-6. Pg VIII-4. \n\n61 \n \n                                                                                                                                                                                           \n45\n Mississippi Department of Marine Resources. Coastal Zone Management < \nhttp://www.dmr.state.ms.us/index.php/coastal-zone-management/wetland-permitting>.  Accessed 25 November \n2014. \n46\n Mississippi State University. Department of Geosciences. <http://geosciences.msstate.edu/scClimate.htm>. \nAccessed 25 May 2018. \n47\n Mississippi State University. Department of Geosciences. <http://geosciences.msstate.edu/scClimate.htm>. \nAccessed 25 December 20148. \n48\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 81. \n49\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 68. \n50\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 86. \n51\n CDM Smith, Inc. Prepared for Land Trust for the Mississippi Coastal Plain. Conservation Legacy: Conservation \nMapping Report. (2011). Pg. 3. <http://www.ltmcp.org/links/conservation-legacy/>. \n52\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 22. \n53\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 23. \n54\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 76. \n55\n Mississippi Department of Environmental Quality. 2006. Gulf Region Water and Wastewater Plan. Pg. 3-32.  \n56\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 23. \n57\n Stewart, Lindsey.  Mississippi Department of Environmental Quality, Office of Land and Water Resources. Email \ncorrespondence 7 December 2018. \n58\n Ohio State University. (2012). Mississippi Gulf Coast Water Assessment. Pg 46. \n59\n Stewart, Lindsey.  Mississippi Department of Environmental Quality, Office of Land and Water Resources. \nPersonal correspondence 5 December 2018. \n60\n Miles, Stephen. The Preserve Golf Club. Email communication 6 December 2018. \n61\n Mississippi Department of Wildlife, Fisheries and Parks (October 2008) 2009-2014 Statewide Comprehensive \nOutdoor Recreation Plan, table I. \n62\n Gresham Smith and Partners.  Prepared for Jackson County, Mississippi.  Jackson County Bicycle, Pedestrian and \nTrails Master Plan.  July 2018. \n63\n Necaise, Paul.  U.S. Fish and Wildlife Service. Coastal Biologist, Hancock County, MS. Email and personal \ncorrespondence 6 December 2018. \n64\n Mississippi Department of Environmental Quality. Mississippi Commission on Environmental Quality Regulations \nfor Water Quality Criteria for Intrastate, Interstate, and Coastal Waters. (2017). < https://www.mdeq.ms.gov/wp-\ncontent/uploads/2018/09/11-Miss.-Admin.-Code-Pt.-6-Ch.-2_Final_Approved-by-EPA-January-18-2017.pdf>. \n65\n BMI Environmental Services, LLC and Nutter & Associates, Inc. Prepared for Land Trust for the Mississippi Coastal \nPlain. (2018). Old Fort Bayou Fecal Coliform Bacteria Total Maximum Daily Load Reduction Plan. Pg 4.  \n66\n Mississippi Department of Environmental Quality. Mississippi Commission on Environmental Quality Regulations \nfor Water Quality Criteria for Intrastate, Interstate, and Coastal Waters. (2017). < https://www.mdeq.ms.gov/wp-\ncontent/uploads/2018/09/11-Miss.-Admin.-Code-Pt.-6-Ch.-2_Final_Approved-by-EPA-January-18-2017.pdf>. Pg \n20. \n67\n Tetra Tech, Inc. Prepared for Mississippi Department of Environmental Quality. (2011). Revised Draft Nutrient \nThresholds to Protect Aquatic Life Uses in Mississippi Non-Tidal Streams and Rivers. \n68\n Mississippi Department of Environmental Quality, TMDL/WLA Section. Fecal Coliform TMDL for the Back Bay of \nBiloxi and Biloxi Bay. (2002). Pg. xx. \n69\n BMI Environmental Services, LLC and Nutter & Associates, Inc. Prepared for Land Trust for the Mississippi Coastal \nPlain. (2018). Old Fort Bayou Fecal Coliform Bacteria Total Maximum Daily Load Reduction Plan. Pg 7. \n70\n BMI Environmental Services, LLC and Nutter & Associates, Inc. Prepared for Land Trust for the Mississippi Coastal \nPlain. (2018). Old Fort Bayou Fecal Coliform Bacteria Total Maximum Daily Load Reduction Plan. \n71\n Mississippi Soil and Water Conservation Commission.  Old Fort Bayou/Tuxachanie Creek Watershed Nonpoint \nSource Pollution Demonstration Project Final Report. (2006). Attachment 4. \n72\n U.S. Fish and Wildlife Service. (2007). Mississippi Sandhill Crane National Wildlife Refuge Comprehensive \nConservation Plan. \n73\n University of Oregon. Ecosystem Workforce Program. (2009). Keys to Success for Watershed Management \nOrganizations. Pg 6. \n\n62 \n \n                                                                                                                                                                                           \n74\n California Department of Conservation. Watershed Coordinator Grant Program. \n<http://www.conservation.ca.gov/dlrp/wp/grants/Pages/wcgp_intro.aspx>. Accessed 12 May 2015. \n75\n U.S. Fish and Wildlife Service. (2007). Mississippi Sandhill Crane National Wildlife Refuge Comprehensive \nConservation Plan. Pg 75. \n76\n Phillips, Jereme. Mississippi Sandhill Crane National Wildlife Refuge. Email Communication. 17 December 2018. \n77\n South Carolina Department of Health and Environmental Control. (2000)  South Carolina Coast-A-Syst: An \nEnvironmental Risk-Assessment Guide for Protecting Coastal Water Quality. < \nhttps://www.tompsc.com/DocumentCenter/View/798/coastAsyst_SCDHEC?bidId=>. Accessed 19 December 2018. \n78\n Missouri Department of Conservation. BMP Cost-Share Funds Available for Loggers and Landowners. 30 January \n2013.  < http://mdc.mo.gov/newsroom/bmp-cost-share-funds-available-loggers-and-landowners>. Accessed 12 \nJune 2015. \n79\n Utah State University Extension. Utah Forest News: Utah Forest Landowner Education Program Newsletter. Fall \n2000.  Volume 4, Number 4. <https://forestry.usu.edu/files/uploads/UFN/Fall00.pdf>.  Accessed 12 June 2015 \n80\n South Carolina Department of Health and Environmental Control. (2000)  South Carolina Coast-A-Syst: An \nEnvironmental Risk-Assessment Guide for Protecting Coastal Water Quality. < \nhttps://www.tompsc.com/DocumentCenter/View/798/coastAsyst_SCDHEC?bidId=>. Accessed 19 December 2018. \n81\n Mississippi Department of Environmental Quality. Surface Water Division. Basin Management and Nonpoint \nSource Branch. Email Communication. 19 December 2018. \n82\n Mississippi Department of Environmental Quality. (2011). Prepared by FTN Associates, Ltd. Mississippi Coastal \nNutrient Reduction Strategies. Pg 44. ",
  "metadata": {
    "id": "old-fort-bayou-watershed-plan-2019-4",
    "originalName": "Old_Fort_Bayou_Watershed_Plan_2019.pdf",
    "size": 4193554,
    "uploadedAt": "2025-10-06T00:10:49.384Z",
    "pageCount": 66,
    "info": {}
  }
}