{
  "id": "red-bud-catalpa-creek-watershed-phase-1-plan-2017",
  "rawText": "\n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 1 \n \nImplementation Plan for the \nRed Bud-Catalpa Creek Watershed \nPhase 1 \n1 FORWARD \nOn September 24, 2015, Mississippi State University (MSU) submitted its Water Resources \nManagement Plan for the Red Bud-Catalpa Creek Watershed (WRMP) to the Mississippi \nDepartment of Environmental Quality (MDEQ) for review and consideration of potential 319 \nNonpoint Source Pollution Prevention Program (NPS) funding support. After a review of the \nplan by MDEQ and the U.S. Environmental Protection Agency (EPA), the plan was not initially \nfunded; however, guidance was provided to MSU to address specific elements of the plan in \norder to meet MDEQ/EPA requirements. Following are EPA’s comments about the WRMP: \n1. The Watershed Plan does not meet the 9-key elements. \na. Proposed Management Measures (Element 3).  The Watershed plan has not \nprioritized the most critical areas that need to be addressed. Are all the critical \nareas in the watershed that contribute towards WQ degradation indicated? For \nexample, several agricultural areas were noted downstream in the watershed \n(see Watershed Plan, Page 45, Land Use map).  A comparative analysis is needed \n(Tiers 1, 2, & 3 prioritization; see “Checklist for Review of Watershed \nManagement Plans,” previously provided). \nb. (Element 3).  It is unclear what specific tasks and deliverables will the requested \n$200,000 be used to fund for FY16.  Is the $200,000 going towards to highest \npriority critical needs in the watershed (Tier 1, see Comment 1.a above).  \nc. Implementation Schedule (Element 6) and Measureable Milestones and Project \nOutcomes (Element 7).  The proposed watershed plan does not provide a \nscheduled order of implementation and milestones with anticipated completion \ndates. \nThis Implementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1 was developed to \naddress these comments (and elements) and ensure that the Information and Education \ncomponent (Element 5) and the Monitoring component (Element 9) are addressed to the \nsatisfaction of both MDEQ and EPA. It is hoped that the submission of this plan to MDEQ and \nEPA will result in the awarding of 319 NPS funding support for MSU’s Red Bud-Catalpa Creek \nWatershed Restoration and Protection Project and Watershed DREAMS (Demonstration, \nResearch, Education, Application, Management and Sustainability) Center.   \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 2 \n \n2 PROCESS FOLLOWED   \nThe process followed during development of the WRMP and this Implementation Plan for the \nRed Bud-Catalpa Creek Watershed Phase 1 was based upon guidance from EPA’s Handbook for \nDeveloping Watershed Plans to Restore and Protect Our Waters. This 6-step process is \nidentified in Table 2.1 with the supporting activities, and the locations where the narratives in \nthe WRMP and this plan can be found (in the Reference column).    \nTable 2.1 \nEPA’s 6 Steps to Effective Watershed Management \nStep Supporting Activities Reference \n1 Build partnerships  a. Identify key stakeholders a. WRMP, Chapters 7 and 8 \nb. Identify issues of concern b. WRMP, Chapter 10 \nWIP-1, Appendix C \nc. Set preliminary goals c. WRMP, Chapter 10 \nWIP-1, Appendix C \nd. Develop indicators d. WRMP, Chapter 10 \ne. Conduct public outreach e. WRMP, Chapter 8 \nWIP-1, Appendix C \n2 Characterize the \nwatershed \na. Gather existing data a. WRMP, Chapter 9 \nb. Create a watershed inventory b. WRMP, Chapter 9 \nc. Identify data gaps  \nc. Collect additional data if needed  \nd. Analyze data e. WRMP, Chapter 10 \nf. Identify causes and sources of \nimpairment* \nf. WRMP, Chapter 10 \ng. Estimate pollutant loads g. WRMP, Chapter 10 \n3 Set goals and identify \nsolutions \na. Set overall goals and management \nobjectives \na. WRMP, Chapter 10 \nb. Develop indicators/targets b. WRMP, Chapter 10 \nc. Determine load reductions needed* c. WRMP, Chapter 10 \nd. Identify critical areas d. WIP-1, Chapter 5 \ne. Develop management measures to \nachieve goals* \ne. WRMP, Chapter 11 \nWIP-1, Chapter 5 \n4 Design implementation \nprogram \na. Develop an implementation schedule* a. WIP-1, Chapter 7 \nb. Develop interim milestones to track \nimplementation of management \nmeasures* \nb. WIP-1, Chapter 8 \nc. Develop criteria to measure progress \ntoward meeting watershed goals* \nc. WRMP, Chapter 10 \n  \nd. Develop monitoring component* d. WRMP, Chapter 12 \nWIP-1, Chapter 9 \ne. Develop information/education \ncomponent* \ne. WRMP, Chapters 13, 15 \nWIP-1, Chapter 6 \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 3 \n \nf. Develop evaluation process f. WRMP, Chapter 10 \ng. Identify technical and financial \nassistance needed to implement plan* \ng. WRMP, Chapter 11 \nWIP-1, Appendix B \nh. Assign responsibility for reviewing and \nrevising the plan \nh. WRMP, Chapter 17 \n5 Implement watershed plan  a. Prepare work plans  \nb. Implement management strategies \nb. Conduct monitoring  \nc. Conduct information/education \nactivities \nd. Share results \n6 Measure progress and \nmake adjustments \na. Track progress  \nb. Make adjustments \n \nKey: * EPA Key Element of a Watershed Plan \nWRMP – Water Resources Management Plan for the Red Bud-Catalpa Creek Watershed \nWIP-1 – Implementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1 \n3 PHASED IMPLEMENTATION APPROACH \nA phased implementation approach is planned for habitat and water quality restoration and \nprotection activities in the Red Bud-Catalpa Creek Watershed.  \n \nPhase 1: Headwaters – South Farm \n1. Solicit resources and implement Phase 1 agricultural BMPs; \n2. Upgrade nonstructural management practices, where needed, to improve \nwater quality and ecosystem health; \n3. Conduct hydrologic analysis (field measurements, modeling), if funding \navailable; \n4. Conduct monitoring (pre- and post-implementation); and  \n5. Implement education and outreach.  \nHeadwaters – Urban Areas \n1. Engage and advance, where possible, collaborative Master Planning \nactivities and Catalpa Creek restoration and protection activities with \nMSU and the City of Starkville; and  \n2. Engage the City of Starkville and Oktibbeha County to address storm \nwater issues. \nBroad Watershed (HUC #031601040601) \n1. Solicit resources and finalize implementation plan; and  \n2. Assimilate and integrate multi-disciplinary data sets. \n \nPhase 2: Headwaters – South Farm \n1. Implement Phase 2 agricultural BMPs; \n2. Upgrade nonstructural management practices, where needed, to improve \nwater quality and ecosystem health (cont.); \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 4 \n \n3. Facilitate planning for stream restoration (structure/function): \na. Concept development and feasibility review,  \nb. Potential Demonstration Site #1 – Bridge at South Farm & East \nLine Roads, and \nc. Potential Demonstration Site #2 – Large sediment detention basin \n(“NRCS watershed lake”);  \n4. Conduct monitoring (pre- and post-implementation); and   \n5. Implement education and outreach.  \n  Headwaters – Urban Areas  \n1. Engage and advance, where possible, collaborative Master Planning \nactivities and Catalpa Creek restoration and protection activities with \nMSU and the City of Starkville (cont.); and  \n2. Engage City of Starkville and Oktibbeha County to address storm water \nissues (cont.). \nBroad Watershed (HUC #031601040601) \n1. Solicitation of resources and implementation of Phase 2 agricultural BMPs  \n \nConcurrent: Watershed DREAMS Center visioning, planning, leveraging, resource generation. \n \nFuture: Conceptualize future phases of project using the Water Resources Management \nPlan for the Red Bud-Catalpa Creek Watershed as reference.  \n \nThis Implementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1 focuses on the \nimplementation of Phase 1 activities. A subsequent plan will be developed for Phase 2 and \nfuture phases and both will be incorporated into a revised Water Resources Management Plan \nfor the Red Bud-Catalpa Creek Watershed.   \n4 KEY WATERSHED PLANNING ELEMENTS   \nIn its handbook, EPA describes 9 key elements of a watershed plan that are minimum \nrequirements for 319 NPS funding support and describes what each element means. This \nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1 builds upon the Water \nResources Management Plan for the Red Bud-Catalpa Creek Watershed by providing more \ndetails and specifics for watershed planning elements 3, 5, 6, 7, and 9 (noted below in bold \nfont).  \nElement 1:  Identification of causes and sources of impairments;  \nElement 2:  Expected load reductions;  \nElement 3:  Proposed management measures;  \nElement 4:  Technical and financial assistance needs;  \nElement 5:  Information and education;  \nElement 6:  Implementation schedule; \nElement 7:  Measurable milestones and project outcomes;  \nElement 8:  Load reduction evaluation; and  \nElement 9:  Monitoring.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 5 \n \n5 PROPOSED MANAGEMENT MEASURES (ELEMENT 3 OF EPA’S 9 KEY \nELEMENTS)  \n5.1 IDENTIFICATION OF CRITICAL MANAGEMENT AREAS \n \nA two-step process was used to identify critical management areas targeted for the \nimplementation of Phase 1 management practices. The first step in this process was the \nidentification of management areas of concern throughout the watershed. The second step \nfocused on identifying critical management areas in the headwaters of the watershed.  \nSTEP 1: IDENTIFICATION OF MANAGEMENT AREAS OF CONCERN.  Management areas of concern \nthat focused on attributes related to soil erosion, nutrient loadings, and stream processes were \nidentified throughout the Red Bud-Catalpa Creek Watershed. The results, screening \nmethodology, and supporting information developed to identify these areas in the Red Bud-\nCatalpa Creek Watershed are described in Appendix D of this plan. Factors and coverages \nconsidered for delineation of these areas included the following:   \n1. Land Slope and Runoff  Pathways; \n2. Water Stored by Soil; \n3. Soil Drainage Classification;  \n4. Soil Hydrologic Groups;  \n5. Watershed Runoff Potential;  \n6. Watershed Flooding Frequency;  \n7. Land Cover/Land Use;  \n8. Soil Erodibility Factor;  \n9. RUSLE Cover Management Factor; \n10. Erodibility Index;  \n11. Annual Soil Erosion Rates;  \n12. Soil Loss Tolerance;  \n13. Estimated Average Nitrogen Yield;  \n14. Estimated Average Phosphorus Yield; \n15. Site Verification; and \n16. Best Professional Judgment. \nThrough this process, management areas of concern were identified.  \nSTEP 2: DELINEATION OF CRITICAL MANAGEMENT AREAS.  In addition to the methodology \ndescribed in Appendix D, additional factors were considered for determining specific locations \nwithin the identified management areas of concern for the placement of best management \npractices (BMP) during Phase 1. This step included consideration of the following attributes \nbased upon best professional judgment:  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 6 \n \n1. Likely water quality benefit;  \n2. Willing landowners;  \n3. Desire to use Phase 1 BMPs to raise awareness (i.e., visibility and easy access/ability to \nuse as showcase sites);  \n4. Implementation of the recommendations of the TMDL (i.e., “it is recommended that \nwater bodies within [the watershed] be considered a priority for streambank and \nriparian buffer zone restoration and any sediment reduction BMPs, especially for road \ncrossings, agricultural activities, and construction activities);  \n5. Cost of BMPs must be within available funding levels;  \n6. Strategy to include range of BMP types in initial installation (not just the same BMP \ninstalled at different sites);  \n7. Usefulness in fulfilling the teaching/research mission of MSU as well as serve as \nleverage for the education and outreach chapter; \n8. Ease of showing effectiveness of the BMP(s) through monitoring;  \n9. Shorter length of time for anticipated results (i.e., within the grant period);  \nThe overarching desired considerations, and associated outcomes, are to reduce sediment to \nthe quantifiable level specified in the TMDL and achieve a ‘good’ IBI score at MDEQ’s \ndownstream biological monitoring site (or, at the least, to make documented progress in this \ndirection). The positioning of MSU’s South Farm in the headwaters of the watershed as a willing \nlandowner; the increased likelihood for leveraging of in-kind services; high visibility for the \ninstalled BMPs; opportunities to create experiential learning activities through planning, \ninstallation, monitoring, and education activities; proximity to pollutant sources; and resource \neligibility all led to the selection of three Critical Management Areas on the South Farm as the \nfocus of Phase 1 implementation.     \nMap 5.1.1 illustrates a portion of the headwaters of the watershed in which management areas \nof concern are identified as well as Critical Management Areas 1 and 2 (highlighted in yellow). \nDue to the lack of 1 meter LiDAR data, this same resolution is not currently available for Critical \nManagement Area #3. Field verification and photo documentation was used to support the \ndelineations of the three critical management areas for Phase 1. Presented later in this chapter \nis photo documentation of the identified critical management areas and sites where BMPs are \nproposed for Phase 1 implementation. Following is the narrative for Critical Management Area \n1 and 2. The narrative for Critical Management Area 3 begins on page 21.   \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 7 \n \nMap 5.1.1 \nManagement Areas of Concern within MSU’s South Farm \nwith Critical Areas 1 and 2 Outlined in Yellow\n \nCritical Management \nArea 1 \nCritical Management \nArea 2 \nManagement Areas \nof Concern \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 8 \n \n5.2 PROPOSED AGRICULTURAL BEST MANAGEMENT PRACTICES \n \nTo determine the BMPs that would likely result in quantifiable improvements in water quality, \nthe expertise of a variety of conservation professionals was sought. These included \nconservationists with USDA’s Natural Resources Conservation Service (NRCS), the Mississippi \nSoil & Water Conservation Commission (MSWCC), the Oktibbeha County Soil & Water \nConservation District (OCSWCD), environmental scientists with the MDEQ, and numerous \nadministrators, researchers, and farm management staff with MSU. Numerous meetings and \nsite visits were made to document the sources contributing to water quality and habitat \ndegradation and identify appropriate management measures that could improve water quality.   \nWithin the headwaters of the Red Bud-Catalpa Creek Watershed, 24 BMPs in three critical \nareas have been selected for implementation in Phase 1. The BMPs that are proposed for Phase \n1 implementation are identified below. Where possible, green infrastructure solutions will be \nused. \nCRITICAL MANAGEMENT AREA 1 – LIVESTOCK FORAGE AREA. Table 5.2.1 identifies the BMPs proposed \nfor implementation in the livestock forage area during Phase 1. Descriptions of these practices \nfollow Map 5.2.1. See Appendix A for additional details.  \nTable 5.2.1 \nCritical Management Area #1 – Livestock Forage Area \nProposed Phase 1 Best Management Practices \nNRCS Practice Site # \n1\n Estimated \nCosts to Fully \nImplement \nBMPs (100% \nBasis) \n2\n 319 NPS \nEligible Funding \n(60% of Costs to \nFully Implement \nBMPs) \n3 \nMatch \n561 – Heavy Use Protection (Beef Feeding \nArea) \n1f $5715 $3429  \n561 – Heavy Use Protection (Beef Feeding \nArea) \n1g 5715 3429 \n576 – Livestock Shelter Structure 2m 3940 2364 \n576 – Livestock Shelter Structure 2p 3940 2364 \n576 – Livestock Shelter Structure 2Q 3940 2364 \n512 – Native Grass Planting  5a 1693 1016 \n382 – Fencing \n4\n 6a 6666 4000 \n342 – Critical Area Planting (Heavy) Sites \naround \nfences \n1107 664 \nBank Stabilization (per NRCS engineering \ndesign) \nWest Line \nRoad \n52654 31592 \nEstimated Total – Critical Area #1 $85370 $51222* $34148 \n*Rounding may result in slight differences between column totals and multiplication products. \nMap 5.2.1 identifies Critical Area #1 and within this area the sites proposed for Phase 1. Other \nsites will be addressed in future phases.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 9 \n \n \nMap 5.2.1 – Critical Management Area 1 \nLivestock Forage Area \nProposed Phase 1 Best Management Practices \nCatalpa Creek \nTributary \nEngineering Design – \nStreambank Stabilization \n \n \nCritical Management Area 1 \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 10 \n \nNRCS Practice 561 – Heavy Use Protection Area. The stabilization of areas frequently and \nintensively used by people, animals or vehicles by establishing vegetative cover, surfacing with \nsuitable materials, and/or installing needed structures. To provide a stable, non-eroding surface \nfor areas frequently used by animals, people or vehicles and to protect and improve water \nquality.   \nNRCS Practice 576 – Livestock Shelter Structure. A portable framed structure with mesh fabric \nroof to provide shade for livestock. This practice applies to areas where animal productivity and \nwell-being is adversely affected by heat generated from sunshine or where livestock are \nexcluded from natural shade along stream banks or other water courses. This practice included \nas a part of a Resource Management System provides shaded areas for livestock, helps protect \nsurface waters from pollution, and assists the livestock from excessive heat.  \nNRCS Practice 342 – Critical Area Planting. Establishing permanent vegetation on sites that \nhave, or are expected to have, high erosion rates, and on sites that have physical, chemical or \nbiological conditions that prevent the establishment of vegetation with normal practices. The \npurpose of this practice is to stabilize the soil, reduce erosion and damage from sediment and \nrunoff to downstream areas, to improve water quality, to improve wildlife habitat, and to \nimprove visual resources.  \nNRCS Practice 512 – Biomass (Native Grass) Planting (legumes inter-seeding or cropland \nconversion). Establishing and reestablishing native species. To establish adapted compatible \nspecies, varieties, or cultivars, reduce soil erosion by wind and/or water. This specific \napplication will establish a buffer along the north and south sides of the tributary and improve \nwildlife habitat. \nNRCS Practice 382 – Fencing. Dividing or enclosing an area of land with a suitable structure that \nacts as a barrier to livestock. To subdivide grazing lands to create additional grazing cell that will \nallow the implementation of a prescribed grazing system. The fencing along site 6a is failing and \nneeds replacement. It is needed to keep cattle out of the tributary.  \nStream Bank Stabilization. This work will consist of placing rock riprap 20ft. upstream of an \nexisting 6ft. x 10ft. arched pipe on West Line Road at a tributary to Catalpa Creek. Also, 20ft. of \ngrouted rock riprap will be placed immediately downstream of the pipe, and then an additional \n20ft. of rock riprap without grout. However, green infrastructure options will also be \nconsidered.  \n \n \nThe following photographs document the conditions that exist where Phase 1 BMPs are \nproposed in Critical Management Area 1.  \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 11 \n \n       \n  \n  \nSite 1F       Site 1g \nNRCS Practice 561 – Heavy Use Protection           NRCS Practice 561 – Heavy Use Protection \n \n \n \n \n \n \nSite 2m      Site 2p \nNRCS Practice 576 – Livestock Shelter Structure   NRCS Practice 576 – Livestock Shelter Structure \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 12 \n \n   \n \n   \nSite 2Q       Site 6a \nNRCS Practice 576 – Livestock Shelter Structure          NRCS Practice 382 – Fencing \n \nSites Around Fences \nNRCS Practice 342 – Critical Area Planting (Heavy) \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 13 \n \n  \n  \nWest Line Road at Tributary    West Line Road at Tributary \nEngineering Design – Bank Stabilization    Engineering Design – Bank Stabilization \nSite 5a  \nNRCS Practice 512 – Native Grass Planting \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 14 \n \nWest Line Road at Tributary to Catalpa Creek \nEngineering Design – Stream Bank Stabilization \n \n \n \n \n \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 15 \n \nCRITICAL MANAGEMENT AREA 2 – BEEF RESEARCH UNIT. Table 5.2.2 identifies the BMPs proposed for \nimplementation during Phase 1 adjacent to the beef research unit where concentrated \nlivestock management operations occur. Descriptions of these practices follow. Refer to \nAppendix A for details. \nTable 5.2.2 \nCritical Management Area #2 – Beef Research Unit \nPhase 1 Proposed Management Measures \nNRCS Practice Site # \n1\n Estimated \nCosts to Fully \nImplement \nBMPs (100% \nBasis) \n2\n 319 NPS \nEligible Funding \n(60% of Costs to \nFully Implement \nBMPs)* \n3 \nMatch \n561 – Heavy Use Protection (Concentrated \nOperations) \n1j $48698 $29219  \n561 – Heavy Use Protection (Beef Runway) 1k 38862 23317 \n342 – Critical Area Shaping/Grading (Heavy) 3d 2214 1328 \n382 – Fencing \n4\n 6b 2879 1727 \n410 – Grade Stabilization Structure \n(Standard Cantilever) \n7a 6000 3600 \n410 – Grade Stabilization Structure \n(Standard Cantilever) \n7b 6000 3600 \n410 – Grade Stabilization Structure (Drop \nPipe/Riser) \n7c 6000 3600 \n410 – Grade Stabilization Structure (Check \nDams) \n7d 10000 6000 \nEstimated Total – Critical Area #2 $120653 $72392 $48261 \n*Rounding may result in slight differences between column totals and multiplication products. \nNRCS Practice 561 – Heavy Use Protection Area. The stabilization of areas frequently and \nintensively used by people, animals or vehicles by establishing vegetative cover, surfacing with \nsuitable materials, and/or installing needed structures. To provide a stable, non-eroding surface \nfor areas frequently used by animals, people or vehicles and o protect and improve water \nquality.   \nNRCS Practice 342 – Critical Area Shaping/Grading/Planting. Establishing permanent vegetation \non sites that have, or are expected to have, high erosion rates, and on sites that have physical, \nchemical or biological conditions that prevent the establishment of vegetation with normal \npractices. The purpose of this practice is to stabilize the soil, reduce erosion and damage from \nsediment and runoff to downstream areas, to improve water quality, to improve wildlife \nhabitat, and to improve visual resources.  \nNRCS Practice 382 – Fencing. Dividing or enclosing an area of land with a suitable structure that \nacts as a barrier to livestock. To subdivide grazing lands to create additional grazing cell that will \nallow the implementation of a prescribed grazing system.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 16 \n \nNRCS Practice 410 – Grade Stabilization Structure. A structure used to control the grade and \nhead cutting in natural or artificial channels. To stabilize the grade and control erosion in these \nsettings, to prevent the formation or advancement of gullies, and to enhance environmental \nquality and reduce pollution hazards. Individual structure types include standard cantilever \nstructures, drop pipes/risers, and check dams.  \nMap 5.2.2 identifies Critical Area #2 and within this area the sites proposed for Phase 1. Other \nsites will be addressed in future phases.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 17 \n \n  \nMap 5.2.2 – Critical Management Area 2 \nBeef Research Unit—Proposed Phase 1 Best Management Practices \nCatalpa Creek \nTributary \nCritical Management Area 2 \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 18 \n \nThe following photographs document the conditions that exist where Phase 1 BMPs are \nproposed in Critical Management Area 2.  \n  \n  \n \n  \n \n  \nSite 7a       Site 7a \nNRCS Practice 410 – Grade Stabilization   NRCS Practice 410 – Grade Stabilzation \nStructure (Standard Cantilever)   Structure (Standard Cantilever) \n \nSite 7b       Site 7b \nNRCS Practice 410 – Grade Stabilization   NRCS Practice 410 – Grade Stabilzation \nStructure (Standard Cantilever)   Structure (Standard Cantilever) \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 19 \n \n  \nSite 7c            Site 7c \n    NRCS Practice 410 – Grade Stabilization                       NRCS Practice 410 – Grade Stabilization \n               Structure (Drop Pipe-Riser)                    Structure (Drop Pipe-Riser) \n                                   Site 7d                                                                                           Site 7d \n     NRCS Practice 410 – Grade Stabilization                                  NRCS Practice 410 – Grade Stabilization \n                   Structure (Check Dam)                                                                Structure (Check Dam)                 \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 20 \n \n  \n                                      Site 1J                                                                                      Site 1k \n   NRCS Practice 561—Heavy Use Protection                          NRCS Practice 561—Heavy Use Protection            \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 21 \n \nCRITICAL MANAGEMENT AREA 3 – DAIRY GRAZING AREA. Table 5.2.3 identifies the BMPs proposed for \nimplementation during Phase 1 at a highly eroded dairy grazing area where dairy cows \ncongregate along and degrade the stream bed. Descriptions of these practices follow Map \n5.2.3. See Appendix A for details.  \nTable 5.2.3 \nCritical Management Area #3 – Dairy Grazing Area \nPhase 1 Proposed Management Measures \nNRCS Practice Site # \n1\n Estimated \nCosts to Fully \nImplement \nBMPs (100% \nBasis) \n2\n 319 NPS \nEligible Funding \n(60% of Costs to \nFully Implement \nBMPs)* \n3 \nMatch \n342 – Critical Area Planting (Heavy) 11a $2214 $1328  \n410 – Grade Stabilization Structure (Check \nDams) \n12a 10000 6000 \n382 – Fencing \n4\n 13a 17574 10544 \n391 – Riparian/Forest Buffer 14a 3979 2387 \n578 – Stream Crossing  15a 4440 2664 \n578 – Stream Crossing  15b 4440 2664 \n578 – Stream Crossing  15c 4440 2664 \nEstimated Total – Critical Area #3 $47087 $28252 $18835 \n*Rounding may result in slight differences between column totals and multiplication products. \nMap 5.2.3 identifies Critical Area #3 and within this area the sites proposed for Phase 1. Other \nsites (such as 10c and 10d) will be addressed in future phases.  \n \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 22 \n \n \nMap 5.2.3 – Critical Management Area 3 \nDairy Grazing Area \nProposed Phase 1 Best Management Practices \nRiparian Forest Buffer \nRiparian Forest Buffer \n15c – Stream Crossing \nCritical Management Area 3 \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 23 \n \nNRCS Practice 342 – Critical Area Shaping/Grading/Planting. Establishing permanent vegetation \non sites that have, or are expected to have, high erosion rates, and on sites that have physical, \nchemical or biological conditions that prevent the establishment of vegetation with normal \npractices. The purpose of this practice is to stabilize the soil, reduce erosion and damage from \nsediment and runoff to downstream areas, to improve water quality, to improve wildlife \nhabitat, and to improve visual resources.  \nNRCS Practice 382 – Fencing. Dividing or enclosing an area of land with a suitable structure that \nacts as a barrier to livestock. To subdivide grazing lands to create additional grazing cell that will \nallow the implementation of a prescribed grazing system.  \nNRCS Practice 391 – Riparian Forest Buffer. An area consisting predominantly of trees and/or \nshrubs located adjacent to and up-gradient from water sources or water bodies.   \nNRCS Practice 410 – Grade Stabilization Structure. A structure used to control the grade and \nhead cutting in natural or artificial channels. To stabilize the grade and control erosion in these \nsettings, to prevent the formation or advancement of gullies, and to enhance environmental \nquality and reduce pollution hazards. Individual structure types include standard cantilever \nstructures, drop pipes/risers, and check dams. Associated practices in this resource concern are \n342 and 460.    \nNRCS Practice 578 – Stream Crossing. A stabilized area or structure constructed across a stream \nto provide a travel way for livestock. Practice will provide access to another land unit; to \nimprove water quality by reducing sediment, nutrient, organic, and inorganic loading of the \nstream; and to reduce stream bank and streambed erosion. (This practice requires fencing off \nboth sides of the stream in which the stream crossing is installed).   \nThe following photographs document the conditions that exist where Phase 1 BMPs are \nproposed in Critical Management Area 3. Essentially, streambed restoration and protection will \nbe accomplished through critical area shaping/grading/planting, fencing, and establishing three \nstream crossings throughout this entire stream reach in addition to establishing a riparian \nforest buffer and a heavy use protection area. A smaller degraded streambed to the west will \nrequire critical area shaping/grading/planting and the installation of a series of check dams.   \n  \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 24 \n \n  \n \n  \n  \nSite 15a      Site 15b \nNRCS Practice 578 – Stream Crossing   NRCS Practice 578– Stream Crossing \nSite 15c      Site 14a \nNRCS Practice 578 – Stream Crossing  NRCS Practice 391– Riparian Forest Buffer \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 25 \n \n  \n \n  \n  \n  \nSite 13a      Site 13a \nWest Side of Creek     East Side of Creek \nNRCS Practice 382 – Fencing     NRCS Practice 382– Fencing \nSite 11a       Site 12a \nNRCS Practice 342 – Critical Area Shaping/  NRCS Practice 410 – Grade Stabilization \nGrading/Planting (Heavy)     Structure (Check Dams) \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 26 \n \nIn addition to the examples of erosion seen in the photographs above of Critical Area #3, a high \nlevel of sedimentation can be seen occurring downstream of a road culvert on the south \nboundary of the dairy grazing area (note the turbid water in the stream and sediment buildup \non the stream bank).  \n \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 27 \n \nESTIMATED COSTS OF PHASE 1 AGRICULTURAL BMPS.  Table 5.2.4 identifies all of the agricultural BMPs \nproposed for Phase 1 as well as their eligible cost share as determined by NRCS. Installation of \nthese BMPs will be provided by MSU as an in-kind contribution.  \nTable 5.2.4 \nCost Estimates of Phase 1 BMPs \nNRCS Practice Site # \n1\n Estimated \nCosts to Fully \nImplement \nBMPs (100% \nBasis) \n2\n 319 NPS \nEligible Funding \n(60% of Costs to \nFully Implement \nBMPs)* \n3 \nMatch \nCritical Area #1 – Livestock Forage Area \n561 – Heavy Use Protection (Beef Feeding Area) 1f $5715 $3429  \n561 – Heavy Use Protection (Beef Feeding Area) 1g 5715 3429 \n576 – Livestock Shelter Structure 2m 3940 2364 \n576 – Livestock Shelter Structure 2p 3940 2364 \n576 – Livestock Shelter Structure 2Q 3940 2364 \n512 – Native Grass Planting  5a 1693 1016 \n382 – Fencing \n4\n 6a 6666 4000 \n342 – Critical Area Planting (Heavy) \nAround fences \n1107 664 \nBank Stabilization (per NRCS engineering \ndesign) \nWest Line \nRoad \n52654 31592 \nEstimated Total – Critical Area #1 $85370 $51222 $34148 \nCritical Area #2 – Beef Research Unit \n561 – Heavy Use Protection (Concentrated Operations) 1j $48698 $29219  \n561 – Heavy Use Protection (Beef Runway) 1k 38862 23317 \n342 – Critical Area Shaping/Grading (Heavy) 3d 2214 1328 \n382 – Fencing \n4\n 6b 2879 1727 \n410 – Grade Stabilization Structure \n(Standard Cantilever) \n7a 6000 3600 \n410 – Grade Stabilization Structure \n(Standard Cantilever) \n7b 6000 3600 \n410 – Grade Stabilization Structure (Drop Pipe/Riser) 7c 6000 3600 \n410 – Grade Stabilization Structure (Check Dams) 7d 10000 6000 \nEstimated Total – Critical Area #2 $120653 $72392 $48261 \nCritical Area #3 – Dairy Grazing Area \n342 – Critical Area Planting (Heavy) 11a $2214 $1328  \n410 – Grade Stabilization Structure (Check Dams) 12a 10000 6000 \n382 – Fencing \n4\n 13a 17574 10544 \n391 – Riparian/Forest Buffer 14a 3979 2387 \n578 – Stream Crossing  15a 4440 2664 \n578 – Stream Crossing  15b 4440 2664 \n578 – Stream Crossing  15c 4440 2664 \nEstimated Total – Critical Area #3 $47087 $28252 $18835 \n    \nEstimated Total – Critical Areas 1, 2, & 3 23 Sites $253110 $151866 $101244 \n \n*Rounding may result in slight differences between column totals and multiplication products. \nNotes (on next page): \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 28 \n \n1\n ESTIMATED COSTS TO FULLY IMPLEMENT BMPS (100% BASIS).  The cost estimates provided by NRCS for these \nBMPs are based upon the FY2016 USDA/NRCS Base Cost Estimate and apply to agricultural producers \nthat have been farming for more than 10 years and do not qualify as a Beginning Farmer, Limited \nResource Farmer, or a Socially Disadvantaged Farmer. The Base Cost Estimate, compiled by USDA/NRCS \nfor Mississippi, Arkansas, and Louisiana, is a combined average cost estimate that typically represents \n50% of the costs to actually implement the practice in these three States. The estimated costs to fully \nimplement the Phase 1 BMPs listed in the preceding table represent 100% of the total costs (or NRCS’ \nBase Cost Estimate X 2).  \n2\n 319 ELIGIBLE FUNDING (60% OF COSTS TO FULLY IMPLEMENT BMPS).  These costs represent 60% of the \nestimated costs to fully implement the selected BMPs, which is the amount that is eligible for a 319 NPS \nfunding award (pursuant to other program requirements).  \n3\n 319 IN-KIND MATCH REQUIREMENT (40% OF IMPLEMENTATION COSTS).  319 NPS funding requires a 40% match \n(in-kind services or monetary contribution). It is anticipated that MSU will contribute in-kind services to \ninstall he designated BMPs and cover this requirement. \n4  \nFENCING REQUIREMENTS.  USDA/NRCS handles requests from agricultural producers that desire to \nsubstitute wooden post with metal pipes, angle iron, etc. by first requesting from the producer what is \ndesired for braces, H-braces, corner posts, and line (pull) posts. This information is then provided to the \nUSDA/NRCS State Grazing Land Specialist for consideration of a waiver to use the materials desired by \nthe producer. Normally, MDEQ requires that conservation practices implemented under 319 NPS funds \nfollow USDA/NRCS practice standards and specifications. Because of this, MDEQ’s approval would also \nbe required in the event a waiver is requested. \n \n5\n 20% ADMINISTRATIVE MANAGEMENT (INDIRECT) COSTS.  MDEQ and MSU have negotiated an indirect rate of \n20% of the total project components eligible for 319 NPS funding ($220,002) to offset MSU’s \nadministrative management costs. This amount is $44,000. \n6\n 319 NPS ELIGIBLE COSTS.  COSTS ELIGIBLE FOR 319 NPS FUNDING SUPPORT.  \n \nTYPES AND QUANTITY OF PHASE 1 AGRICULTURAL BMP APPLICATIONS.  Table 5.2.5 comprehensively \nidentifies all of the types agricultural BMP applications proposed for Phase 1 and the number of \neach type.  \nTable 5.2.5 \nCumulative Phase 1 BMPs \nPractice/Application # of Sites \n561 – Heavy Use Protection (Beef Feeding Area) 2 \n576 – Livestock Shelter Structure 3 \n512 – Native Grass Planting  1 \n382 – Fencing  3 \n342 – Critical Area Planting (Heavy) 2 \nStream Bank Stabilization 1 \n561 – Heavy Use Protection (Concentrated Operations) 1 \n561 – Heavy Use Protection (Beef Runway) 1 \n342 – Critical Area Shaping/Grading (Heavy) 1 \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 29 \n \n410 – Grade Stabilization Structure (Standard Cantilever) 2 \n410 – Grade Stabilization Structure (Drop Pipe/Riser) 1 \n410 – Grade Stabilization Structure (Check Dams) 2 \n391 – Riparian/Forest Buffer 1 \n578 – Stream Crossing  3 \n14 Total Practices/Applications 24 Total Sites \n \n5.3 PHASE 1 URBAN STORM WATER MITIGATION ACTIVITIES \n \nChapter 11.3 of the Water Resources Management Plan for the Red Bud-Catalpa Creek \nWatershed describes in detail components of MSU’s Master Plan (2010) that identify both \nstructural and nonstructural management practices to mitigate the harmful effects of urban \nstorm water. During 2015, MSU announced plans to update its Master Plan. As a component of \nthis Phase 1 watershed implementation plan, efforts will be made to engage MSU’s Master \nPlanning Committee to incorporate these proposed and future watershed activities into its \nplanning efforts.  \n \nCurrently, MSU is constructing a new entrance road to the southern portion of its campus. This \nroad will transect South Farm and the headwaters of the Red Bud-Catalpa Creek Watershed by \nconnecting Poor House Road with the south campus entry at Blackjack and Stone Boulevard \n(see Map 5.3.1). Proposed improvements include application of the Green Corridor concept \ncontained in the Master Plan. During implementation of Phase 1 of this watershed \nimplementation plan, coordination with the Mississippi Agriculture and Forestry Experiment \nStation’s (MAFES’) engineer, who also serves as the south entry road project manager, will \ncontinue to be a priority.  \n \nAn additional MSU Master Plan activity for which coordination and potential leveraging will be \na Phase 1 focus is developing a hydrologic model for Catalpa Creek. Such a model will have \nmultiple uses – siting and sizing a future storm water retention basin south of the Blackjack and \nStone Boulevard entrance, stream restoration design, and urban storm water campus planning. \n \nThe City of Starkville is currently in the process of updating its Master Plan. Efforts will be made \nto engage the City Engineer and identify mutual urban storm water management needs and \ndiscuss potential solutions. During Phase 1, Oktibbeha County representatives will also be \nengaged for the same purposes.     \n \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 30 \n \nMap 5.3.1 \nNew South Entrance Road to MSU Campus (Under Construction) \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 31 \n \nNew South Entrance Road to MSU Campus (Under Construction) \n  \n  \n \n5.4 PHASE 1 BROAD WATERSHED (HUC #031601040601) ACTIVITIES \n \nPhase 1 activities of this plan are not limited to implementation of agricultural BMPs in the \nheadwaters area of MSU’s South Farm. In fact, these activities also focus on the broad 12-digit \nwatershed, HUC #031601040601. Specifically, the following activities are planned to address \nthe entire watershed during Phase 1:  \n \n1. Continuous solicitation of watershed restoration and protection resources from a \nvariety of potential sources for future implementation activities by the Funding and \nIncentives Work Group and other interested parties (this includes annual U.S. \nDepartment of Agriculture Requests For Proposals, such as the Regional Conservation \nPartnership Program and Conservation Innovation Grant Program, as well as recurring \ncost-share programs, such as the Environmental Quality Incentive Program and Wildlife \nHabitat Incentive Program);  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 32 \n \n2. Assimilation and integration of multi-disciplinary data sets related to indicator species, \nfisheries, biology/habitat, water resources, and other watershed management interests; \n3. If resources are available, collection of data to support development of a hydrologic \nmodel;  \n4. If resources are available, development and implementation of social indicators and \ncivic engagement indicator surveys in watershed and metropolitan area;  \n5. Finalization of a phased implementation plan for the entire Red Bud-Catalpa Creek \nWatershed and incorporation into a revised Water Resources Management Plan for the \nRedbud-Catalpa Creek Watershed. \n5.5 WATERSHED DREAMS (DEMONSTRATION, RESEARCH, EDUCATION, APPLICATION, \nMANAGEMENT AND SUSTAINABILITY) CENTERS ACTIVITIES DURING PHASE 1 \n \nBecause of the significant interest in the Red Bud-Catalpa Creek Watershed Restoration and \nProtection Project and the recognition of the potential to leverage these efforts into an ongoing \nWatershed DREAMS (Demonstration, Research, Education, Application, Management and \nSustainability) Center, activities will be planned to advance MSU’s Watershed DREAMS concept \ninto fruition. In support of this concept, activities planned during Phase 1 are identified below:   \n1. Visioning;  \n2. Planning;  \n3. Broadening support among the watershed practitioners’ community; \n4. Engaging potential external stakeholders and users;  \n5. Identifying and generating resources; and \n6. Identifying and capitalizing on leveraging opportunities.  \n \nMSU’s Watershed DREAMS Center has the potential to be useful to a broad spectrum of \ninterests, including: \n \n Students through facilitated experiential learning activities – from secondary through \ncollege;  \n Educators – at all levels;   \n Researchers – who desire to design and nest new project concepts into a watershed \nsetting;  \n Conservation professionals – where training and CEUs can be made available through \nappropriate agencies;  \n Producers – who desire to learn the latest results and applications of research;   \n Policy-makers and legislators – to give them “hands-on” experience as they consider \nchallenging issues;   \n Community Service groups – to foster more watershed stewardship; and  \n Many more interests.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 33 \n \n6 INFORMATION AND EDUCATION (ELEMENT 5 OF EPA’S 9 KEY ELEMENTS) \n6.1 GOAL AND OBJECTIVES \n \nThe educational goal of this plan is to enhance awareness and knowledge of watershed issues \nin local, regional and national stakeholders and increase use of watershed \nconservation/management practices through educational programs associated with the \nimplementation and assessment of best management practices in the Red Bud-Catalpa Creek \nWatershed. This goal will be achieved through accomplishing the following objectives: \n \n Demonstrating the effectiveness and benefits of sediment, nutrient, pathogen and other \nBMPs and water management approaches to a diverse audience of stakeholders. \n Providing for information and technology transfer of current and future watershed \nmanagement applications to resource managers, water resources planners, agricultural \nproducers, urban and rural residents, University and secondary education students and \neducators and other stakeholders. \n Increased use of BMP and other watershed protection practices by producers, \nmunicipalities and rural/urban residents. \n \nGiven the complex nature of the management and recovery of the Red Bud-Catalpa Creek \nWatershed, a phased approach will be used to address initial concerns.  As practices are \nimplemented, monitoring is advanced and funding becomes available, the education/outreach \nprogram will be expanded to take full advantage of new opportunities and address other needs. \nLeveraging with existing programs at MDEQ and others affiliated with state and federal \nagencies and stakeholder organizations will be pursued. This document describes the first \nphase of activities for the Technology Transfer, Education/Outreach and Public Relations Team. \n6.2 ACTIVITIES AND TIMELINE \n \nTable 6.2.1 \nSummary of Phase 1 Activities \nTarget Audience Activity Project Year \nUniversity Faculty and \nStudents \n1. Recruit faculty and provide educational support materials \nfor experiential learning for undergraduate/graduate \nclasses; facilitate coordinated monitoring or modelling \nefforts by students that may contribute to watershed data \n2. Assess knowledge and perceptions of watershed issues of \ncollaborating faculty and university students \n3. Develop a virtual field trip of the Red Bud-Catalpa Creek \nWatershed featuring elements of watershed protection, \nrestoration and management (e.g., hydrology, storm water \neffects, soils, etc.) for use in diverse educational \napplications \n1 – 3 \n \n \n \n1 – 3 \n \n1 – 2 \n \n \n \n \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 34 \n \n4. Develop educational background materials (watershed \nmaps, photos, sample data sets, etc.) for distribution for \nclass use \n5. Develop and place educational signage at relevant sites \n(e.g., at implemented BMP’s) on University property within \nthe watershed \n6. Develop content and presentation format for 8 educational \ndisplay panels (approx. 3’x5’ each) on watershed function \nand protection for the Wetland Education Theater on the \nMSU campus \n7. Stream corridor clean-up by MSU student professional \ngroups \n2 – 3 \n \n \n1 – 3 \n \n \n \n \n \n1 \nYouth: \n– Schools \n– Youth Development \nGroups \n– Summer Camp \nParticipants \n \n \n1. Identify existing watershed educational programs for use \nfor youth outreach; identify gaps that may be addressed by \nthis project \n2. Develop and incorporate a 1/2-day watershed curriculum \nfor 4 annual summer camps \n3. Repair an existing, large-scale, trailer-mounted stream table \nowned by MSU for use in outreach efforts \n4. Develop and offer a one-day Field Day program on \nwatersheds featuring Catalpa Creek for local schools \n5. Assess knowledge and perceptions of watershed issues in \nselect youth groups \n6. Develop a virtual field trip of the Red Bud-Catalpa Creek \nwatershed featuring diverse elements of watershed \nprotection, restoration and management (e.g., hydrology, \nstorm water effects, soils, etc.) for use in diverse \neducational applications \n7. Develop content and presentation format for 8 educational \ndisplay panels (approx. 3’x5’ each) on watershed function \nand protection for the Wetland Education Theater on the \nMSU campus \n1 – 2 \n \n \n1 – 3 \n \n1 \n \n1, 3 \n \n1 – 3 \n \n1 – 2 \n \n \n \n \n1 – 3 \nEducators: \n– School Teachers \n– Youth-development \nleaders (e.g., FFA, 4-H, \nEnvirothon) \n \n1. Identify existing watershed educational programs for use in \nschools and extracurricular activities; identify gaps that may \nbe addressed by this project \n2. Develop and offer a 1-day workshop for youth formal and \ninformal educators on watershed function and protection \nfeaturing Catalpa Creek as a case study \n3. Repair an existing, large-scale, trailer-mounted stream table \nowned by MSU for use in outreach efforts \n4. Assess knowledge and perceptions of watershed issues of \nselect Mississippi youth educators \n5. Develop content and presentation format for 8 educational \ndisplay panels (approx. 3’x5’ each) on watershed function \nand protection for the Wetland Education Theater on the \nMSU campus \n1 – 2 \n \n \n2 \n \n \n1 \n \n2 \n \n1 – 3 \nResource Professionals: \n–  Extension Service \nAgricultural and Natural \nResources Agents \n– NRCS Personnel  \n1. Identify existing watershed educational material available \nfor professional development of land specialists; identify \ngaps that may be addressed by this project \n2. Develop and offer a 1/2-day in-service training for \nExtension Service personnel featuring Catalpa Creek as a \ncase study \n1 – 2 \n \n \n2 \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 35 \n \n3. Develop and offer a 2-day professional development \nworkshop for NRCS personnel on watershed protection and \nrestoration, incentive programs, BMP’s, etc. featuring \nCatalpa Creek as a case study \n4. Repair an existing, large-scale, trailer-mounted stream table \nowned by MSU for use in outreach efforts \n5. Assessment of knowledge and perceptions of watershed \nissues of MSU Extension Service agents and NRCS \npersonnel; compare with that of stakeholders as reported \nin the literature \n3 \n \n \n \n1 \n \n2-3 \nCivic Leaders 1. Conduct an informational meeting / listening session with \nrelevant city leaders on the Red Bud-Catalpa Creek \nWatershed issues related to urban planning, storm water \nmanagement, etc.  \n2. Assess knowledge and perceptions of watershed issues of \nselect civic leaders and planners within the Red Bud-Catalpa \nCreek Watershed \n3 \n \n \n \n3 \n \nNeeds Assessment of Stakeholders.  Effective education begins with an understanding of the \nknowledge base, perceptions, misconceptions and educational needs of the target audience.  \nTherefore, convenience surveys of community/municipal leaders, public educators (both formal \nand non-formal; K-16), secondary and post-secondary students and agriculture and natural \nresources agents from select organizations (i.e., NRCS, MSU Extension Service) will be \nconducted throughout Phase One to provide baseline information from which more intensive \nsurveys will be developed in Phase Two of the education/outreach plan.  Additional \nstakeholders such as watershed residents, developers and agricultural producers will be also \nincluded in similar surveys in later phases of the outreach/education plan. \n \nUniversity Outreach.  The contiguity of the Mississippi State University campus within the Red \nBud-Catalpa Creek Watershed provides the unique opportunity to provide relevant, experiential \nlearning to undergraduate and graduate students, thereby impacting watershed conservation \ninto the future and beyond the confines of this plan.  The close proximity of students, \ninstructors and researchers to watershed elements allows for demonstration (both of \nimpairments and mitigation approaches), case study, land use planning, research and \nmonitoring learning experiences.  \n \nPhase 1 activities of the education/outreach plan will include engaging relevant faculty and \ntheir undergraduate classes and graduate researchers in watershed experiential learning.  The \nRed Bud-Catalpa Creek Watershed will be used as a case study for water quality monitoring, \nhydrologic and geomorphological modeling, soil assessments, etc., thus simultaneously \npromoting learning and baseline data collection. Watershed knowledge and perceptions will be \nassessed in participating students and faculty to inform future educational needs and \napproaches.  \n \nA virtual field trip, educational signage at BMP’s and background data sets associated with the \nwatershed will also be developed to facilitate learning.  Furthermore, the Red Bud-Catalpa \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 36 \n \nCreek Watershed will be featured in the Wetland Education Theater scheduled for construction \non the MSU campus in 2017.  Eight, large display panels featuring educational text, \nphotographs and figures on watershed function and protection will be incorporated into this \nlarger project focused on the beauty and function of natural wetlands. Classes, tour groups and \ncasual campus visitors will benefit from the informal and experiential learning opportunities \nassociated with this new facility. \n \nYouth Outreach.  Mississippi State University has enjoyed a long and successful history in youth \neducation, primarily through programs such as 4-H and FFA which provide development of life \nskills and promote acquisition of subject area knowledge. Existing connections to youth \neducational programs (e.g., summer camps) and groups (e.g., area environmental classes and \nclubs) will be leveraged in Phase 1 of the education. A half-day focus on watersheds will be \nincorporated into four annual summer camps during each of the three project years. An \nexisting, trailer-based stream table will be renovated to provide a platform for demonstrating \nhydrological processes to youth and other audiences.   \n \nStudents from local schools will be invited to the MSU campus for a one-day Watershed Field \nDay featuring Catalpa Creek during two of the three project years. However, many schools lack \nthe financial support for field experiences; virtual field trips can provide many of the same \nfeatures and benefits without the associated costs in travel time and expense. We propose to \ndevelop in years 1 and 2 of the project a web-based learning tool based upon Catalpa Creek \nthat will highlight watershed function, protection and restoration. Curricula will be linked to the \nvirtual field trip to provide learning opportunities with diverse applications. \n \nFinally, students participating in these various outreach endeavors will be surveyed to \ndetermine their perceptions and knowledge of watershed issues. This information will \ncontribute to future assessments of motivations for and barriers against conservation-oriented \nbehaviors in young people that will be conducted in later phases of plan implementation. It will \nalso guide selection and/or development of educational curricula for future project phases. \n \nEducator Outreach.  Although there are positive gains to be made through outreach to \nindividuals and small groups, employing a “train-the-trainer” model is decidedly more efficient. \nTherefore, outreach to those with education responsibilities will be a key component of \nimplementation of the outreach and education efforts associated with this Implementation \nPlan for the Red Bud-Catalpa Creek Watershed Phase 1.   \n \nTeachers in public and private schools, youth development (e.g., 4-H and FFA) leaders and \nnatural resources educators are tasked with improving learner knowledge; this is often best \naccomplished by showing relevance of the content to the learner.  A one-day teacher workshop \ncentered on Catalpa Creek will provide for experiential learning in science, technology, \nengineering, and math (STEM) topics using a case-study approach. Repair on an existing trailer-\nbased stream trailer will allow for its incorporation to further expand learning about hydrology, \nstream modification, erosion and other physical factors at work in watersheds.   \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 37 \n \nEducators will also be asked to participate in surveys of their knowledge and perceptions of \nwatershed issues to allow for development and/or modification of curricula to meet \neducational needs.  \n \nAgents’ Professional Development.  Natural resources agents and personnel with groups such \nas the Natural Resources Conservation Service and the Extension Service interface with private \nland owners on conservation and management of natural resources. Watershed protection \nwithin agricultural settings remains a priority, yet not all of those tasked with working with the \npublic are fully informed of the challenges associated with watershed protection and/or \nrestoration and the diversity of conservation options available to mitigate issues.  Providing \ncurrent, research-based information on causes of watershed degradation, methods for \nrestoration (e.g., best management practices, incentive programs) and benefits of sound \nenvironmental stewardship will promote change and enhance the adoption and \nimplementation of sound management practices. \n \nCivic Leader Outreach.  Municipal and campus development in the headwaters of Catalpa \nCreek Watershed contributes to impairments in the watershed and to storm water \nmanagement issues. Engaging civic leaders will be imperative in alleviating pressures on Catalpa \nCreek. This project proposes to host at least one meeting with relevant city leaders to identify \ntheir familiarity with watershed concerns and to inform them of available options for \naddressing the issues of concern. \n6.3 PARTICIPANTS, ROLES, AND AFFILIATIONS \n \nTable 6.3.1 identifies the participants, roles, and affiliations of the Technology Transfer, \nEducation/Outreach and Public Relations Team. \nTable 6.3.1 \nParticipants, Roles, and Affiliations \nName Role Department/Affiliation \nBaker, Beth water quality \nevaluation/outreach \nWildlife, Fisheries and Aquaculture/Extension Service, \nMSU \nBurger, Leslie conservation/ \nenvironmental education \nWildlife, Fisheries and Aquaculture/Extension Service, \nMSU \nCade, Wally soil conservation \noutreach \nNatural Resources Conservation Service \nChapman, Janet watershed/basin \ncoordination \nMississippi Department of Environmental Quality \nCossman, Ron social indicators Social Science Research Center, MSU \nDowney, Laura program evaluation School of Human Sciences, MSU \nIngram, Richard water resources research \nand management \nWater Resources Research Institute \nJack, Linda FFA/Environmental \nScience instructor \nStarkville School District \nNeal, Kayla soil and water \nconservation \nOktibbeha County Soil and Water Conservation District \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 38 \n \nKelly, Lelia Master Gardener \nCoordinator/native plant \noutreach \nNorth MS Research and Extension Center/Extension \nService, MSU \nLemus, Rocky range management Plant and Soil Science, MSU \nLinhoss, Anna environmental \nengineering and water \nresources \nAgricultural and Biological Engineering, MSU \nOldham, Larry soil science outreach Plant and Soil Science/Extension Service, MSU \nPhilips, Tommy human development School of Human Science, MSU \nTagert, Mary Love water management \nscience \nAgricultural and Biological Engineering/Extension Service, \nMSU \nSmith, Brian complex system \nmodeling \nIndustrial and Systems Engineering \nSwortzel, Kirk agriculture education Agriculture and Extension Education, MSU \nVeeder, Deb watershed outreach MS Adopt-A-Stream, MS Wildlife Federation, MDEQ \n6.4 PROPOSED BUDGET \n \nTable 6.4.1 illustrates the proposed information and education budget. \nTable 6.4.1 \nProposed Information and Education Budget \nCategory Activity 60% of Costs  \n3 \nMatch \nSalaries \n Project Oversight  $4732  \nSummer Intern/Project Assistance $12079 \nCommodities \n Trailer Repairs $1000  \nBMP Signage 3000 \nMSU Classes – Educational Materials 4500 \nField Day for Local Schools – Materials and Support 2000 \nProfession Development: NRCS Training 5000 \nEducator Workshop 2500 \nIn-Service Training: Extension Agents 1000 \nWatershed Management Workshop 500 \nMunicipal Leaders’ Workshop    250 \nPublication Costs; Educational Materials, Surveys 3000 \nContractual \n Virtual field trip development $13900  \nInformation and Education   -----   Estimated Total Costs     $89102 $53461 $35641 \n \n \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 39 \n \n7 IMPLEMENTATION SCHEDULE (ELEMENT 6 OF EPA’S 9 KEY ELEMENTS) \nChapter 3 provides an overview of the phased implementation approach that is being designed \nfor the Red Bud-Catalpa Creek Watershed to restore and protect water quality and \nhabitat/ecosystem health, and Chapter 5 describes the proposed management measures  \n(implementation activities) planned for the watershed. This chapter provides a schedule for the \nimplementation of these activities during Phase 1. Activities planned for use of potential 319 \nNPS funding are noted with *.  \n \nMonths 1-3:    1. Establish pre-implementation monitoring to establish pre-project baselines*. \n \nMonths 1-12:   1. Prepare educational and outreach materials, and facilitate leveraging \n         opportunities for experiential learning applications*; \n2. Collect needed data to support development of a hydrologic model;  \n   3. Identify and assimilate South Farm nonstructural management \n      practices/plans to highlight MSU activities;  \n  4. Engage MSU Master Planning Committee to identify collaboration/leveraging \n      opportunities during south entry road construction and Master Plan revision;   \n    5. Engage City of Starkville and Oktibbeha County to discuss storm water  \n      management needs in the watershed;   \n    6. If resources are available, develop and implement social indicators and civic \n      engagement indicator surveys in watershed and metropolitan area; and  \n    7. Finalize phased implementation plan for the entire Red Bud-Catalpa \n      Creek Watershed (HUC #031601040601) and incorporate into a revised Water  \n      Resources Management Plan for the Red Bud-Catalpa Creek Watershed. \n \nMonths 12-24:  1. Implement Phase 1 agricultural BMPs in headwaters at South Farm*;  \n    2. Implement education and outreach plan*; and \n  3. Explore/advance collaboration and leveraging opportunities related to storm \n      water management with the MSU Master Planning Committee, City of \n      Starkville, and Oktibbeha County   \n   \nMonths 25-36:  1. Conduct post-implementation monitoring*;  \n   2. Assess water quality and habitat/ecosystem health restoration and \n      protection progress; \n   3. Implement education and outreach plan*; and \n  4. Prepare and submit final Phase 1 report \n \nMonths 1-36:   Solicit additional resources to support monitoring, modeling and  \n  implementation activities for the entire Red Bud – Catalpa Creek Watershed  \n \nConcurrent:   Visioning, planning, identifying and generating potential resources, and \nidentifying leveraging opportunities for MSU’s Watershed DREAMS   \n(Demonstration, Research, Education, Application, Management and \nSustainability) Center  \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 40 \n \n8 MEASURABLE MILESTONES AND PROJECT OUTCOMES (ELEMENT 7 OF \nEPA’S 9 KEY ELEMENTS)  \nThe identification of measurable milestones and project outcomes are required as Element 7 of \nEPA’s 9 Key Elements of a Watershed Plan.   \n8.1 MEASURABLE MILESTONES \nChapter 7 provides a schedule for the implementation of Phase 1 activities. Chapter 8 \nestablishes interim, measurable milestones for determining whether the planned BMPs or \nother implementation activities are being implemented on schedule and for measuring \nprogress in implementing this plan. The Phase 1 activities listed below will potentially be \nsupported by 319 NPS funding. \n \nMilestone 1 End of Month 3 Pre-implementation monitoring has been implemented. \n \nMilestone 2 End of Month 12 Educational and outreach materials are prepared, and \nleveraging opportunities for experiential learning planned. \n \nMilestone 3 End of Month  18 All Phase 1 agricultural BMPs are installed in first critical \narea at South Farm; all planned education and outreach \nactivities for this period have been completed according to \nschedule. \n \nMilestone 4 End of Month  21 All Phase 1 agricultural BMPs are installed in second critical \narea at South Farm; all planned education and outreach \nactivities for this quarter have been completed according \nto schedule.  \n \nMilestone 5 End of Month  24 All Phase 1 agricultural BMPs are installed in third critical \narea at South Farm; all planned education and outreach \nactivities for this quarter have been completed according \nto schedule. \n \nMilestone 6 End of Month  24 Post-implementation monitoring has been implemented. \n \nMilestone 7 End of Month 36 Final report is submitted to MDEQ. \n \n8.2 MEASURABLE OUTCOMES  \nChapter 10 of the Water Resources Management Plan for the Red Bud-Catalpa Creek \nWatershed provides significant narrative and information on the water quality biotic integrity \nstatus within the watershed. Also included is a lengthy section that describes an integrated \nrestoration and protection goals and targets related to sediment, pathogens, nutrients, habitat, \nand social indicators.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 41 \n \n9 MONITORING (ELEMENT 9 OF EPA’S 9 KEY ELEMENTS) AND MODELING \n9.1 PRE- AND POST-BMP IMPLEMENTATION MONITORING \nThe purpose of this monitoring plan is to assess the ecological integrity of critical areas for \nrestoration in the Catalpa Creek Watershed pre- and post-best management practice (BMP) \nimplementation. Monitoring activities will be performed on Mississippi State University owned \nlands adjacent to the Catalpa Creek Watershed. Monitoring is being performed to conduct pre- \nand post-conservation practice implementation water quality measurements in small-scale \nwatersheds utilizing edge-of-field/in-stream monitoring.  Three reference sites under similar \nland use and agricultural management within the same priority watershed will also be \nmonitored to evaluate the effectiveness of these practices for reduction of sediment and \nnutrients. While sediment is the primary impairment of concern in this watershed, parameters \nto be analyzed at the Mississippi Department of Environmental Quality include Total Suspended \nSolids, Ammonia, Total Kjeldahl Nitrogen, Total Nitrite-Nitrate Nitrogen, Total Nitrogen, and \nTotal Phosphorus.   \n \nDue to land use in critical areas as well as the presence of developed TMDLs for pathogens in \nthe larger HUC in which the Red Bud-Catalpa Creek Watershed is located, replicate samples will \nalso be collected for microbial analysis at the U.S. Department of Agriculture – Agriculture \nResearch Service, Genetics and Sustainable Agriculture Unit. Water from each replicate will be \nanalyzed with few exceptions as stated in Brooks et al. (2012) for the presence of Escherichia \ncoli (USEPA 1103.1, 2002), staphylococci, enterococci (USEPA 1106.1, 2002), and Clostridium \nperfringens. Briefly, aliquots of water will be passed through membrane filter (0.45 um) and \nplaced onto appropriate media. E. coli will be plated to mTEC agar at 44.5C overnight, \nstaphylococci onto manitol salt agar incubated at 35C for 48 hours, enterococci plated to mENT \nagar incubated at 35C for 48 hours, and C. perfringens plated to CP chromoselect agar \nincubated anaerobically at 44.5C overnight. Selected isolates will be collected and further \nsubjected to confirmation using colony polymerase chain reaction (PCR) and appropriate \nprimers. Additionally, fecal samples will be collected from the surrounding grazing and poultry \noperations. Similar methods will be applied to these samples. All sites will be pre-\nmonitored/baseline monitored for one year or at least ten sample events prior to BMP \nimplementation. After implementation, BMPs will be monitored for the same amount of at \nleast ten events or one year. \nSITE DESCRIPTION \nMonitoring sites will be downstream of the group of practices (i.e., Critical Management Areas) \nlisted in Table 9.2.1.  \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 42 \n \nTable 9.2.1 \nMonitoring Sites \nPractices BMP Site # \nMonitoring Site #1 – Critical Management Area 1 (Livestock Forage Area) \n561 – Heavy Use Protection (Beef Feeding Area) 1f \n561 – Heavy Use Protection (Beef Feeding Area) 1g \n576 – Livestock Shelter Structure 2m \n576 – Livestock Shelter Structure 2p \n576 – Livestock Shelter Structure 2Q \n512 – Native Grass Planting  5a \n382 – Fencing  6a \n342 – Critical Area Planting (Heavy) Sites around fences \nEngineering Design – Stream Bank Stabilization West Line Road \nMonitoring Site #2 – Critical Management Area 2 (Beef Research Unit) \n561 – Heavy Use Protection (Concentrated Operations) 1j \n561 – Heavy Use Protection (Beef Runway) 1k \n342 – Critical Area Shaping/Grading (Heavy) 3d \n382 – Fencing 6b \n410 – Grade Stabilization Structure (Standard Cantilever) 7a \n410 – Grade Stabilization Structure (Standard Cantilever) 7b \n410 – Grade Stabilization Structure (Drop Pipe/Riser) 7c \n410 – Grade Stabilization Structure (Check Dams) 7d \nMonitoring Site #3 – Critical Management Area 3 (Dairy Grazing Area) \n342 – Critical Area Planting (Heavy) 11a \n410 – Grade Stabilization Structure (Check Dams) 12a \n382 – Fencing  13a \n391 – Riparian/Forest Buffer 14a \n578 – Stream Crossing  15a \n578 – Stream Crossing  15b \n578 – Stream Crossing  15c \nTotal 24 \nWATER QUALITY MONITORING \nSystem description.  Site specific monitoring equipment will be the following: \n Pre-measured flow-structure: ditch/pipe section/box \n Depth sensor: OTT PLS pressure level sensor SDI 12 compatible; 0-4m \n Area velocity sensor:  Starflow UNIDATA ultrasonic Doppler 2m range \n Automated sampler: SD900 SIGMA Composite sampler \n Manual Rain Gauge at one sampling location; additional precipitation from MSU \nweather station \n Power Source: Solar Panel 12V, 30W Pole/House mounted with Solar 1205 12V/5A \ncharge controlled and a 12V deep cycle marine battery \n Housing: Framed 6x6’ house. \n \nSampling Protocol. (See QAPP for full details.) Monitoring will take place year round and the \ngoal of the project is to obtain runoff data from every attainable event. Events on these \nparticular sites will only be rainfall as pasture lands are non-irrigated and there is minimal \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 43 \n \nchance of snow melt. Field crews will check samplers after every storm event to determine if \nsamples were collected. Within 24 hours of storm event cessation, field crews will be on site \nand undertake the following tasks: \n \n1. Open automated sampler and pour required samples into sampling containers for lab \nanalysis. \n Samples will include: \n– 1 L sample for inorganics (no acid preservation) \n– 1 L sample for inorganics (acid preserved) \n– 1 L Field duplicate from one random sampling station \n– 1 L container for turbidity measurements \n– 1 L sample for microbial analysis (no preservation) \n2. Fill a 1 L sampling container with DI water as a field blank \n3. Empty composite sampler and rinse twice with DI water \n4. Replace composite sampler and reset sampler \n5. Check sample intake for obstructions or debris \n6. Check manual rain gauge and record rainfall amount \n7. Once over all equipment for defects, tears, obstructions etc. \n8. Collect physical water quality parameters of samples, including: pH, DO, Specific \nConductance, and temperature \n9. Measure Turbidity immediately following sample collection  \n10. Fill out field data sheet, including chain of custody form for MDEQ \n \nAll runoff event samples will be analyzed for the following constituents: \n \n Ammonium – NH\n4\n-N \n Nitrate+Nitrite – NO\n3\n+NO\n2\n \n Total Kjeldahl Nitrogen – TKN \n Total phosphorus – TP \n Total suspended solids – TSS \n Total Organic Carbon-TOC \nVEGETATION ASSESSMENTS \nVegetation will be considered a major ecological assessment factor, where vegetation \ncomposition will be measured pre- and post-BMP implementation to serve as a condition \nindicator. Specifically, this metric is defined as the percent cover of the native plant species, \nrelative to total cover (sum of plant species). This method will be adapted from Faber-\nLangendoen et al. (2011) and applied to survey the impacted area of each tributary where \nBMPs will be implemented. Vegetation surveys will be conducted using a 1 meter\n2\n area to \nperform grid sampling across the entire area of the BMP site. Fixed belt transects in each of \nthree zones will be sampled in each BMP site. The transects will be 1 meter wide and \npositioned in the upper, middle, and lower elevations of the stream cross section. Species \ndiversity will be quantified as species richness (Magurran 2013) and evenness (Simpson’s Index: \nSmith and Wilson 1996).  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 44 \n \n \nIt is the intention of the Planning and Implementation Team to work with MAFES personnel to \nactively promote the management of invasive species throughout the growing season. The \nimpact of this effort will depend on the ability of team members to establish functional working \nrelationships, which has been actively encouraged by MAFES administration. This work will \nengage graduate and undergraduate students in the sampling effort.  Photographic \ndocumentation will also occur at each transect beginning at construction. \n \nTable 9.2.2 \nPre- and Post-BMP Implementation Monitoring (Funded by 319 NPS Award) \n \nProject Needs \nTotal \nCost \nPre-BMP \nImplementation \nPost-BMP \nImplementation \n60% of Costs \n(Federal \nContribution) \nMatch \nTransportation of Samples to Jackson \n $1438 $1437 $2875  \n$9783 \nEquipment (6 samplers/flow meters) \n In-kind In-kind In-kind \nSupplies (sampling jugs/labels)  300 300 600 \nUndergraduate Stipend  5000 5000 10000 \nNutrient Analysis   TBD  TBD \nMicrobial Analysis (10/sample x 10) \n 600 600 1200 \nTOTALS    24458 $14675  \n \n9.2 ASSESSING AND PREDICTING IN-STREAM PROCESSES IN THE CATALPA CREEK WATERSHED \nABSTRACT \nExcessive erosion and the transport and deposition of sediment in surface waters are major \nwater-quality problems in Mississippi. Researchers in the state have shown that a significant \nportion of sediment loads exported from the watershed are contributed by streambeds and \nmostly from active unstable streambanks. The main channel of the Catalpa Creek has been \nlisted as impaired due to sediments from headwaters to the outlet. The Water Resources \nManagement Plan for the Red Bud-Catalpa Creek Watershed and Implementation Plan for the \nRed Bud-Catalpa Creek Watershed Phase 1 were formulated to restore and protect the \necosystem health, ecosystem services and quality of life, and water resources within the \nwatershed; and create experiential learning activities for students, educators, and practitioners. \nTo develop remedial measures and future BMPs within the Catalpa Creek Watershed for \nreducing water quality impairment, and a stream restoration design to improve stream \nmorphology, biological integrity and function of the main stream and tributaries, it is necessary \nto identify stressors, sediment sources and loads currently transported, and critical zones for \nupland and in-stream management and/or restoration within the entire watershed. \nHypothesizing in-stream processes are important mechanisms driving sediment supply into the \nstreams and an important portion of the sediment budget for the Red Bud-Catalpa Creek \nWatershed. This research will focus on the identification, assessment, evaluation and prediction \nof in-stream processes within the study watershed. To address the research objectives three \nsub-studies will be undertaken using a combination of methods including field reconnaissance \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 45 \n \nand detailed data collection, laboratory analysis, and channel modeling. Modeling results can \nhelp to determine critical areas to be potentially considered for future management and \nrestoration activities, as well as to optimize a design for a desired outcome and to understand \nwhat results might be expected. Project results will be transferred to a broad group of \nacademic, technical and research stakeholders, supported in collaboration with private, federal \nand state agencies. \nNATURE, SCOPE, AND OBJECTIVES \nStabilization of active streambanks and reestablishment of hydrologic connectivity between \nstream channel habitats and floodplain areas is relevant to improve stream corridor health. \nAlthough stabilizing streambanks along the main channel might seem a logical mitigation \nstrategy to enhance upstream and downstream water quality, detailed numerical modeling of \nalternative mitigation strategies is imperative to reduce uncertainty in the effects of any \nrestoration efforts. It is not common for stream restoration efforts to lead to further \ninstabilities if properly planned and analyzed (Pollen et al., 2005).  \n \nThe present investigation is based on a collaborative effort between MSU and USDA’s \nAgricultural Research Service-National Sedimentation Laboratory (ARS-NSL) to develop a better \nunderstanding of the biological and physical characteristics of Catalpa Creek and the factors \naffecting the occurrence of morphological adjustments (e.g., type of threats, \nstreambank/streambed erosion rates, sediment contribution from streambanks, restoration \ndesigns). The effort is ultimately expected to support implementation of management practices \nin the watershed and future restoration activities in Catalpa Creek. \n \nThis research will focus on the identification, assessment, evaluation and prediction of instream \nprocesses within the study watershed. Specific objectives include i) to evaluate spatial and \ntemporal variation of suspended sediment transport rates, and an initial assessment of \ndominant mechanisms driving sediment supply and exportation within and from the Catalpa \nCreek; ii) to quantify in-stream erosion/deposition rates and determine the conditions and \nfactors affecting those rates on different areas within the Catalpa Creek Watershed; and iii) to \nassess the application of the USDA-ARS CONservational Channel Evolution and Pollutant \nTransport System (CONCEPTS) model to predict in-stream processes and develop a sediment \nbudget, and evaluate stream restoration design scenarios along the Catalpa Creek. \nMETHODS, PROCEDURES, AND FACILITIES \nTo address the research objectives, this project will undertake three sub-studies using a \ncombination of methods including field reconnaissance and detailed data collection, laboratory \nanalysis, and channel modeling in order to assess the actual contribution of in-stream processes \nto sediment loads within the Red Bud-Catalpa Creek Watershed. \n \nSub-study 1. Analysis of spatial and temporal variation of suspended sediment transport rates \nand initial assessment of dominant mechanisms driving sediment supply and exportation for the \nCatalpa Creek. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 46 \n \n \nThe project will start on March 1st, 2017. Initial field reconnaissance will help to identify   \npotential locations to develop systematic survey assessments to characterize physico-chemical \n(water quality), hydrological (flow analysis) and biological and habitat (macroinvertebrates) \nconditions. The biological and habitat assessment will be performed in collaboration with the \nstaff of the Mississippi Wildlife Foundation’s Adopt-A-Stream Program in Mississippi (supported \nby MDEQ’s 319 NPS Program). Automatic monitoring stations will be set-up at three different \nlocations along the main channel (upper 4 miles) to collect stormflow water samples and water \nflow velocity and depth measurements. Routine base flow grab samples will be collected \nweekly from at least 15 locations along the main channel and tributaries of the Catalpa Creek. \nInsitu testing will include the assessment of the physio-chemical (e.g. pH, temperature, total \ndissolved solids, dissolved oxygen concentration) and hydraulic (e.g. flow velocity and depth) \ncharacteristics of the flow. Grab samples will be subjected to laboratory analyses at the Kelly \nGene Cook Environmental Lab to determine suspended sediment concentrations of all collected \nwater samples. Relationships between flow discharge and sediment loads (sediment rating \ncurves) will be constructed and related to the stage of channel evolution as proposed by Simon \n(1989). Establishing these relationships will initially indicate the spatial variation in suspended \ntransport efficiency, trends and possible mechanisms driving sediment supply and exportation \nalong and from the creek (e.g., streambed erosion, streambank erosion, and/or aggradation). \n \nSub-study 2. Assessment of in-stream erosion or deposition rates along the main channel reach \nand main tributaries. \n \nApproximately 20 cross-section transects will be initially surveyed along the upper 4 miles on \nthe main channel and tributaries by using a Real Time Kinematic (RTK) GPS system (TOPCON \nHiperlite Plus) at the beginning of the study. Selected cross sections will include active and \nstable streambanks. Transects will be resurveyed after stormflow events or monthly, if \nstormflow events are not observed in a shorter period of time. The depth of streambank \nwidening or contraction, and the changes in streambed elevation will be estimated for each \nsurvey. Volume and mass of eroded streambank and streambed material will be assessed by \ncomparing cross section changes in different surveying dates. A total event, seasonal and \nannual load will be estimated considering individual transects and the entire reach in \nevaluation.  \n \nSub-study 3. Assessing the application of the computational model CONCEPTS and HECRAS, to \npredict in-stream processes, develop a sediment budget within the Catalpa Creek watershed, \nand evaluate stream restoration design scenarios. \n \nThe computational model CONCEPTS will be evaluated (calibrated) on the surveyed stream \nsegments to assess model performance and capability to simulate temporal and spatial \nstreambanks and streambed changes and sediment transport along the entire studied reach. \nThe model will be set up using information collected from Sub-studies 1 and 2. Additional \ninformation needed to set up the model, such as streambank and streambed material \ncharacteristics (e.g. particle size distribution, bulk density, organic matter content) and \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 47 \n \nstreambank stability parameters (e.g., critical shear stress, erodibility, soil cohesion, friction \nangle) will be collected in-situ at each individual cross section, for each individual side.  \n \nResearchers from ARS-NSL will support this task by lending the required testing equipment (i.e. \njet test device, bore-hole shear test device) and training the project team in their use and \nresults management. The calibrated model will be tested for proposed stabilization scenarios \non most active streambanks. A sediment budget will be assessed by using the subroutine \nSediment Impact Analysis Methods (SIAM) included in the Hydrologic Engineering Center-River \nAnalysis System (HEC-RAS) model. \nSTATEMENT OF RESULTS, BENEFITS, AND/OR INFORMATION EXPECTED TO BE GAINED \nThe proposed research effort first intends to provide qualitative and quantitative identification, \nand temporal and spatial variability and distribution of hydraulic and channel characteristics, \nstages of channel evolution, representative in-stream processes (e.g. streambank undercutting \nand instability, streambed erosion or deposition, and sediment transport and sediment supply), \nand the definitive identification of these processes as the driving mechanism of sediment \nsupply within, and from the watershed. Collected and generated information will be used to \nproduce a calibrated model for hydraulic, sediment transport and channel evolution conditions \nand a sediment budget for the Catalpa Creek, which will become important pieces to plan the \ndevelopment of a stream restoration design that will aim at long-term to improve stream \nmorphology, biological integrity, and function of the Catalpa Creek. \n \nIn addition with the benefits described above, the project will be valuable for the development \nof maintenance and operation plans for in-stream BMPs, justification for continued \ngovernment and private expenditures in conservation, reduced labor costs associated with \nsurvey tasks such as pre-/post-construction surveys and cut/fill analysis. The project activities \nand results will be presented and transferred to a broad group of stakeholders including \nwatershed citizens, the entire MSU campus community, Starkville schools, and private, state \nand federal agencies related to the quality improvement of the Catalpa Creek, an EPA 319(h) \npriority watershed. Generated publications will include research reports, peer-reviewed \njournals papers and professional conference presentations and proceedings. \n \nPROJECT TERM, AMOUNT OF FUNDING, AND FUNDING SOURCE \nThe term of this project is March 1, 2017-February 28, 2018. The total funding level of this \nproject is $65,818. Non-federal funding is $44,155. Funding is provided through MWRRI’s 104b \nWater Resources Research Grant Program.   \n9.3 APPLIED USE OF UNMANNED AERIAL VEHICLES IN SURFACE WATER PROTECTION   \nABSTRACT \nErosion represents a significant detriment to Mississippi’s surface waters, as a source of both \nchemical (i.e., phosphorus) and physical (i.e., sediments) pollutants. Accordingly, erosion \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 48 \n \ncontrol will be necessary for maintaining the quality of Mississippi’s surface water resources, \nand identifying and monitoring erosion in critical areas will enable stakeholders to better \nmanage the State’s water resources by addressing a key source of degradation. The objective of \nthis research is to evaluate the accuracy of erosion calculations derived from Structure from \nMotion (SfM) captured with unmanned aerial vehicles (UAVs). The research project will \ncombine results from SfM assessments of erosion with ground-truthed measurements of \nerosion to determine the accuracy of this approach for use in calculating erosion values, and \nextend this approach to evaluate the ability of SfM to monitor erosion over time. Derived \nvalues will be incorporated into existing models (e.g., BSTEM, CAESAR-Lisflood) to determine if \nSfM data are a valid model input. Data will be collected from MSU-owned and managed \nresearch properties where significant erosion has been identified; some of these sites are \nwithin an EPA-designated 319(h) priority watershed. The result of this research is a scientific \nvalidation of the accuracy of erosion calculations derived from UAV-collected SfM assessments. \nWhen used appropriately, UAVs have the potential to enable rapid assessment of landscapes \nwith reduced labor costs. The research serves as a proof-of-concept project to develop a \nmethod by which UAVs could be employed to identify, quantify, and monitor erosion in \ndrainage channels and other eroded areas. This would enable federal, state, and local agencies \nto utilize this technology to more efficiently monitor, remediate, and regulate degradation of \nsurface waters. Outputs from this research project include transfer of information on the \nappropriate data collection strategies for UAV-based SfM assessments, as well as best practices, \nalong with methods, estimates of accuracy, and any necessary cautions. This data will be \ncommunicated to stakeholders through scientific exchange and interaction, in addition to the \nestablished University Extension network. \nNATURE, SCOPE, AND OBJECTIVES OF PROJECT \nThe objective of this research is to evaluate the accuracy of erosion calculations derived from \nStructure from Motion (SfM). Structure from Motion is a technique which relies on the concept \nof parallax to estimate 3D surfaces from 2D images. This technique has more recently been \naccomplished with UAVs to create digital surface models for other applications. At present, SfM \nis gaining acceptance as a low-cost alternative to other methods which estimate surface \ntopography (e.g., LIDAR, terrestrial laser scanning). The research project will combine results \nfrom SfM assessments of erosion with ground-truthed measurements of erosion to determine \nthe accuracy of this approach for use in calculating erosion values, and extend this approach to \nevaluate the ability of SfM to monitor erosion over time. Derived values will be incorporated \ninto existing models to determine if SfM data are a valid model input. Because of the nature of \nthe data, imagery is being collected which may show surface water quality impacts from \nerosion. This data will be investigated for the potential to perform pollution monitoring and \ntracking, but this is not the primary purpose of this research. \nMETHODS, PROCEDURES, AND FACILITIES \nAn investigation is proposed to be performed at MSU research locations, including Foil, \nAndrews, Bearden, and Leveck research properties, all located near the main campus in \nStarkville, MS. All locations have drainage ditches and additional areas of the property which \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 49 \n \nexhibit erosion, evidenced by channel incision and sidewall cutting; in some cases this erosion is \nquite substantial (Figure 1). In fact, the Bearden and Leveck locations are located in the Red \nBud-Catalpa Creek Watershed, which was recently designated as an EPA 319(h) priority \nwatershed. This system is listed as impaired under Section 303(d) of the Clean Water Act for its \nsediment load, among other pollutants, making these locations ideal testbeds. \n \nA multirotor UAV will be utilized to perform SfM analysis and monitoring of erosion over the \ncourse of the study period. Imagery will be taken with a significant (70%) frontal and side \noverlap between successive images to create a dense point cloud of images. Identifiable \nstructures in each image (e.g., telephone poles, plot markers, sewer caps) will be used to align \nthe images properly. Geographic coordinates for these structures can be used to further \nincrease the accuracy of the alignment, thus target research locations will be marked and \ngeotagged appropriately. UAV missions will be conducted at no less than monthly intervals for \nthe first 10 months of the study period, with the remaining two months reserved for data \nanalysis and information transfer. \n \nConcurrent with UAV imagery collection, field data will be collected to provide ground-truthing \ninformation. Cross-section transects along the channels of Sand and Catalpa Creeks near active \ngullies, and morphological characteristics of these channel cuts will be surveyed using a Real \nTime Kinematic (RTK) GPS system at points of interest at the beginning and end of the UAV data \ncollection period (months 0 and 10), and after individual rainstorm events during the first 10 \nmonths of the research. The depth of streambank widening or contraction, and the displaced \nvolume of soil in gullies will be estimated for each survey. Volume and mass of eroded \nstreambank and streambed material will be assessed by comparing cross-section changes \nbetween surveys. Displaced volume of soils in gullies will be estimated using the direct \ncomputation method included in the Part 650 - Engineering Field Handbook of the USDA \nNatural Resources Conservation Service National Engineering Handbook (NRCS, 2012). \nAdditional information, such as streambank and streambed material characteristics (e.g. \nparticle size distribution, bulk density, organic matter content) and streambank stability \nparameters (e.g.. critical shear stress, erodibility, soil cohesion, friction angle) will be collected \nin-situ at each individual cross-section, for each individual side, as these are necessary for \nmodel incorporation.  \n \nAdditional physical measurements will be taken in the field to monitor dimensionality of sheet, \nrill, and gully erosion identified as study sites. Markers will be also placed which passively \nillustrate erosion, and which will be captured in UAV imagery as well. In order to accomplish the \nprimary research objective, field and SfM measurements will be compared to evaluate the \nagreement between the two methods. To capture the ability of this method to monitor erosion \nover time, change detection analysis will be performed on the time series of SfM surfaces to \ndetermine the extent and location of erosion, and monitor development of additional erosion \nin these research areas. Field data collected will be used to validate change detection analysis. \nIn order for an agency of other stakeholder to derive value from erosion estimates, the data \nmust be readily usable for decision making. Accordingly, we propose to evaluate the ability of \nSfM erosion surfaces to be incorporated into existing models which offer predictive capacity. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 50 \n \nThe selected models include BSTEM and CAESAR-Lisflood. Both models are driven by surface \nelevation models and site characteristics related to soil parameters. BSTEM (Bank Stability and \nToe Erosion Model) is a model developed by the National Sedimentation Laboratory in Oxford, \nMississippi (Simon et al., 2000), in order to predict streambank retreat due to both fluvial \nerosion and geotechnical failure. To model bank stability, BSTEM calculates a factor of safety \n(FoS) using three different limit equilibrium-method models: horizontal layers, vertical slices, \nand cantilever shear failure. As many river management situations require information on the \nstability of the channel banks, the use of the tool may facilitate predicting the effect that \nchanges in riparian land use, or designing new channels, may have on the stability of studied \nchannels. CAESAR (Cellular Automation Evolutionary Slope and River)-Lisflood (Coulthard et al., \n2012; Coulthard et al., 2013) is a downscaled landscape evolution model which has been \nselected based on its key advantages. First, using a landscape evolution model in lieu of a soil \nerosion model results in better simulation of fluvial erosion and deposition. Second, a \nlandscape evolution model better represents dynamic interactions between topography, flow, \nand sediment transport, which are missed by some soil erosion models (Coulthard et al., 2012). \nMoreover, the CAESAR-Lisflood model is free and open-source, available to anyone with the \nscientific capacity to collect the necessary data. \nSTATEMENT OF RESULTS, BENEFITS, AND/OR INFORMATION EXPECTED TO BE GAINED \nThe result of this research is a scientific validation of the accuracy of erosion calculations \nderived from UAV imagery. The research serves as a proof-of-concept project to develop a \nmethod by which UAVs could be employed for this purpose. This project has broad and limitless \napplicability. This is because (1) the issue of erosion is ubiquitous in managed landscapes and \n(2) UAVs are immediately accessible in the marketplace to anyone with sufficient (as low as \n$500) funds. This research creates enabling technology for future research endeavors and use \nby stakeholders for necessary data collection to drive their decision making ability. The long-\nterm benefits include those items previously listed under section 13. Some additional benefits \ninclude development of maintenance and operation plans for BMPs, justification for continued \ngovernment and private expenditures in conservation, and reduced labor costs associated with \nsurvey tasks such as pre-/post-construction surveys and cut/fill analysis. In short, assessing \nerosion with UAVs would be a significant application of UAV technology with tangible economic \nbenefits that could be implemented in the near-term future. \n \nThe leveraged skills of the investigators include backgrounds in agricultural, civil, and \nenvironmental engineering, along with soil science and agronomy. Each investigator has also \nparticipated in research on water quality and the applied use of geospatial technologies. The \ncross-disciplinary research approach of this project (speaking more academically) also fills \nknowledge gaps noted in recent scientific literature which call for more attention to spatially \nexplicit research on soil erosion which considers anthropogenic influences (Svoray et al., 2015), \nspecifically at fine-spatial and medium-temporal scales (Ciampalini et al., 2012), and an \nidentified need (Guzmán et al., 2013) for inexpensive, rapid analysis approaches that quickly \nprocess a large number of samples for tracer-based soil erosion studies. This is accomplished by \nutilizing an inherently-spatial model, and also finer-scale spatial and temporal erosion research, \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 51 \n \nas the UAVs can be flown on demand (temporal) and at low altitudes (spatial); because of the \nnature of the images taken, geographic information systems can be employed to perform \nanalyses on the impact of land use and management. It also provides an inexpensive, rapid \nassessment tool which overcomes the limits of tracer studies by eliminating the need for tracer \ndata. This additionally fills a research gap within the technical side of the project which calls for \nmore investigation into the accuracy of the proposed methods (detailed in section 15) in \ndifferent environments (Fonstad et al., 2013; Mancini et al., 2013). \n \nPROJECT TERM, AMOUNT OF FUNDING, AND FUNDING SOURCE \nThe term of this project is March 1, 2017-February 28, 2018. The total funding level of this \nproject is $45,676. Non-federal funding is $30,423. Funding is provided through MWRRI’s 104b \nWater Resources Research Grant Program.   \n \n9.4 HYDRAULIC MODEL TO SUPPORT CONSERVATION AND ECOSYSTEM RESTORATION EFFORTS \nWITHIN AN IMPAIRED, PRIORITY WATERSHED  \nABSTRACT \nOver the past several years, there has been an increased awareness on the part of Mississippi \nAgriculture and Forestry Experiment Station (MAFES) administration and faculty that remedial \nactions must be taken to address erosion and flooding issues associated with Catalpa Creek, the \nmajor outflow channel and drainage system emanating from the main campus of MSU and \nthrough the H.H. Leveck Animal Research Facility. Under leadership from the Mississippi Water \nResources Research Institute (MWRI) at MSU, in conjunction with MAFES, 21 units on campus \nhave contributed to a comprehensive watershed management plan to restore the Red Bud-\nCatalpa Creek Watershed, demonstrating MSU’s ability to be a leader in conservation \ndemonstration, teaching, and research. With the recent designation of this watershed as an \nEPA 319(h) priority watershed, there are expectations of monitoring and assessment on the \npart of MSU. Many state agency personnel have identified a hydraulic model as a needed \nplanning and implementation component of conservation efforts on MSU-owned properties. \nThis research will focus on the identification, assessment, evaluation and prediction of in-\nstream processes within the study watershed, so that such a hydraulic model can be developed. \nThis research will generate information and tools necessary to inform targeted placement of \nBMPs, as well as predict and monitor improvements to impairments within Catalpa Creek, \nenabling future efforts in demonstration, research, and experiential learning for MSU. This \nsupports the mission and vision set forth in the watershed management plan which was \nauthored by MSU as a first step in obtaining EPA 319(h) funding for this watershed. \n \nThe PI (Dr. Tim Shauwecker) and Co-PI (Dr. Joby Czarnecki) for this proposal are members of the \nSteering Committee for the overall watershed project. Additionally, the PI is co-chair of the \nPlanning and Implementation Team and the Co-PI is co-chair of the Funding and Incentives \nTeam. The recent efforts of this multi-disciplinary team have resulted in the designation of the \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 52 \n \nRed Bud-Catalpa Creek Watershed as an EPA 319(h) priority watershed, and an anticipated \naward from the Mississippi Department of Environmental Quality and U.S. EPA to restore water \nquality within the watershed. This anticipated 319(h) award represents an investment in excess \nof $450,000 from MDEQ/EPA and MSU. Several documents have been established which guide \nthis process, among these are a comprehensive water resources management plan and this \nimplementation plan for the first phase of effort. This process is designed to promote MSU as \nan exemplary example of functional conservation, which also provides demonstration, \nresearch, and experiential learning opportunities.  \n \nDuring the first phase, 14 different NRCS-described best management practices will be installed \nat 24 locations in the headwaters of the watershed on the Leveck and Bearden research \nfacilities. Phase 1 installations target infield erosion sources which represent intermittent \ntributaries to Catalpa Creek. However, within the main channel of Catalpa Creek, there is a \nsignificant problem with flooding and back flow, contributing to channel incision, streambed \noutcrop, undercutting, streambank instability, and turbidity/sediment issues. Additional \nconservation efforts will be necessary to address these issues. It is the expectation of EPA \n319(h) funded projects that monitoring and assessment will occur in tandem with installations \nof best management practices, so that success stories can be generated which assign economic \nand ecologic value to investments in conservation. One crucial element in this process is \ndevelopment of an accurate hydraulic model. This model is necessary to predict how remedial \nmeasures will affect water quality impairment, and will aid in placement of best management \npractices which improve morphology, biological integrity and function of the main channel of \nCatalpa Creek. This model relies on identification of stressors, sediment sources and loads, and \ncritical zones. Further, an understanding of in-stream processes (streambank undercutting and \ninstability, bed erosion or deposition, and sediment transport) is crucial for addressing \nimportant mechanisms which contribute to sediment loading and an important portion of the \nsediment budget for the Red Bud-Catalpa Creek Watershed. Sediments are one of the major \nimpairments for which this watershed is listed under the section 303(d) of the Clean Water Act, \nand in order to provide the information MSU will be obligated to report, a hydraulic model is \nindispensable. \n \nAPPROACH \nThis research will focus on the identification, assessment, evaluation and prediction of instream \nprocesses within the study watershed. Specific objectives include i) to evaluate spatial and \ntemporal variation of suspended sediment transport rates, and an initial assessment of \ndominant mechanisms driving sediment supply and exportation for the Catalpa Creek; ii) to \nquantify in-stream erosion/deposition rates and determine the conditions and factors affecting \nthose rates on different areas within the Catalpa Creek watershed; and iii) to assess the \napplication of the computational model Hydrologic Engineering Center River Analysis System \n(HEC-RAS), to predict in-stream processes an develop a sediment budget within the Catalpa \nCreek watershed. To address the research objectives, the present research will undertake three \nsub-studies using a combination of methods including field reconnaissance and detailed data \ncollection, laboratory analysis, and channel modeling in order to assess the actual contribution \nof in-stream processes to sediment loads within the Red Bud-Catalpa Creek Watershed. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 53 \n \n \nSub-study 1. Analysis of spatial and temporal variation of suspended sediment transport rates \nand initial assessment of dominant mechanisms driving sediment supply and exportation for the \nCatalpa Creek. \n \nAutomatic water samplers will be set-up at three different locations along the main channel \n(upper 4 miles) to collect stormflow water samples and water flow velocity and depth \nmeasurements. Routine base flow grab samples will be collected weekly from at least 15 \nlocations along the main channel and tributaries of the Catalpa Creek. In-situ testing will include \nthe assessment of the physio-chemical (e.g., pH, temperature, total dissolved solids, dissolved \noxygen concentration) and hydraulic (e.g. flow velocity and depth) characteristics of the flow. \nGrab samples will be subjected to laboratory analyses at the Kelly Gene Cook Environmental \nLab to determine suspended sediment concentrations and turbidity of all collected water \nsamples. Relationships between flow discharge and sediment loads (sediment rating curves) \nwill be constructed and related to the stage of channel evolution as proposed by Simon (1989). \nRelationships would bring an initial indication of the spatial variation in suspended transport \nefficiency along the creek and trends and possible mechanisms along the creek (e.g. streambed \nerosion, streambank erosion, aggradation) driving sediment supply and exportation. Because \nmany of the erosion problems within Catalpa are driven by management practices which \nremove beneficial vegetation, vegetative cover is perceived to play a pivotal role in regulating \nsediment supply. Thus, another avenue of data collection under this sub-study will be to assess \nthe relationship between vegetative cover and streambank erosion. Vegetative cover in a 1-m \nwide belt transect, running parallel to each confluence of tributary and main channel, will be \nquantified in February, June, and October to observe and monitor community competition. \nMultivariate and canonical correspondence analysis will be used to determine the relationships \nbetween soil characteristics, vegetative cover, and streambank erosion. \n \nSub-study 2. Assessment of in-stream erosion or deposition rates on periodically surveyed cross \nsections on the incised streambanks along the 4 miles channel reach and main tributaries. \n \nApproximately 18 cross-section transects will be initially surveyed along the upper 4 miles on \nthe main channel by using a Real Time Kinematic (RTK) GPS system (TOPCON Hiperlite Plus) at \nthe beginning of the study. Selected cross sections will include at least 20 transects considering \nactive and stable streambanks. Transects will be resurveyed after a stormflow event occurs. The \ndepth of streambank widening or contraction will be estimated for each survey and related. \nVolume and mass of eroded streambank and streambed material will be assessed by comparing \ncross section changes in different of surveying dates. A total annual load will be estimated \nconsidering individual transects and the entire reach in evaluation. \n \nSub-study 3. Assess the application of the computational model HEC-RAS, to predict in-stream \nprocesses and develop a sediment budget within the Catalpa Creek watershed. \n \nThe computational model HEC-RAS will be evaluated (calibrated and validated) on the surveyed \nreach segment to assess model performance and capability to simulate temporal and spatial \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 54 \n \nstreambanks and streambed changes and sediment transport along the entire studied reach. \nThe model will be setup using information collected from Sub-studies 1 and 2. Additional \ninformation, such streambank and streambed material characteristics (e.g. particle size \ndistribution, bulk density, organic matter content) and streambank stability parameters (e.g. \ncritical shear stress, erodibility, soil cohesion, friction angle) will be collected in-situ at each \nindividual cross section, for each individual side. The calibrated model could be tested for \nproposed stabilization scenarios on most active streambanks. A sediment budget will be \nassessed by using the subroutine SIAM included in HEC-RAS. \n \nANTICIPATED OUTCOME \nThis research will generate information and tools necessary to inform targeted placement of \nbest management practices, as well as predict and monitor improvements to impairments \nwithin Catalpa Creek, enabling future efforts in demonstration, research, and experiential \nlearning for MSU. The generated information and calibrated model will be an important piece \nin the overall long term goals of developing a stream restoration design which improves stream \nmorphology, biological integrity and function of the Catalpa Creek. In addition to the hydraulic \nmodel, the vegetation information collected can also be used to develop management goals \nand timelines for riparian habitat restoration along the main channel. This supports the mission \nand vision set forth in the watershed management plan which was authored by MSU as a first \nstep in obtaining EPA 319(h) status for this watershed. \n \nPOTENTIAL IMPACT \nFirst and foremost, this project is intended to be a step towards remediating impairments, \nprotecting soil and water resources, and restoring the ecosystem services of Catalpa Creek and \nits tributaries on MSU-owned properties and private lands. Beyond the obvious, this project, as \nconceptualized, creates significant opportunities for MSU. These include taking self-initiative to \nmitigate a documented water quality problem rather than allowing the problem to persist and \nrisk the potential for an externally-mandated solution; creating opportunities for significant \nfederal, state and private investment into the project; generating new opportunities for applied \nresearch to develop innovative approaches to address water resources challenges; highlighting \nMSU’s capacity in the water resources restoration and protection arena for managers and \npolicy-makers; and developing innovative experiential learning activities for students and \neducators. Additionally, the project will create experiential learning opportunities for four \nundergraduate students.  \n \nPROJECT TERM, AMOUNT OF FUNDING, AND FUNDING SOURCE \nThe term of this project is January 1-December 31, 2017. The funding level of this project is \n$33,300. Funding is provided through MAFES’ Special Research Initiative (SRI).   \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 55 \n \n9.5 ASSESSING SOIL EROSION WITH UNMANNED AERIAL VEHICLES FOR PRECISION CONSERVATION   \nABSTRACT \nSoil erosion is a primary conservation concern due to impacts to soil health, land productivity, \nand surface water quality. Despite the increased implementation of conservation practices on \nthe landscape, erosion remains a threat to agricultural sustainability. To fill a knowledge gap in \nthe body of work on soil erosion, an unmanned aerial vehicle (UAV) will be utilized to perform \nStructure from Motion (SfM) analysis and monitoring of erosion over the course of the study \nperiod. Structure from Motion is a technique which relies on the concept of parallax to estimate \n3D surfaces from 2D images. An investigation is proposed to be performed at local MAFES \nResearch locations, including Foil, Andrews, Bearden, and Leveck research centers. All locations \nhave drainage ditches and additional areas of the property which exhibit erosion, evidenced by \nchannel incision and sidewall cutting; in some cases this erosion is quite substantial. SfM \nsurfaces will be examined using change detection analysis, as well as modeling approaches, to \nvalidate the use of UAV-collected SfM data as a tool for quantifying erosion. Additional field \ndata will be collected to validate SfM 3D surfaces and model outputs. This proof-of-concept \nstudy addresses the need for more spatially-explicit erosion research and also provides an \ninexpensive, rapid assessment tool which overcomes the limits of tracer studies. This project \nhas broad and limitless applicability with few barriers to transferability, and should a successful \noutcome be achieved, the method could be widely adopted. \nRELEVANT BACKGROUND \nSoil erosion is a primary conservation concern due to impacts to soil health, land productivity, \nand surface water quality. Many best management practices (BMPs) are advocated for either \nreducing erosion (e.g. cover crops, reduced or no-till farming) or trapping resultant sediment in \nrunoff (e.g., vegetated buffer strips, slotted inlet pipes). Despite the increased implementation \nof BMPs on the landscape, erosion remains a threat to agricultural sustainability (Montgomery, \n2007). Quantitative studies on erosion are necessary to provide a basis for effective \nconservation and land management strategies (Guzmán et al., 2013).  \n \nThis research proposal is motivated by several knowledge gaps noted in recent scientific \nliterature. In short, more attention must be given to spatially-explicit research on soil erosion \nwhich considers anthropogenic influences, such as land use and management (Svoray et al., \n2015), specifically at fine-spatial and medium-temporal scales (Ciampalini et al., 2012). At the \nsame time, Guzmán et al. (2013) identified a need for inexpensive, rapid analysis approaches \nthat quickly process a large number of samples for tracer-based soil erosion studies, noting that \ntracer studies are currently hampered by the uncertainty associated with the conversion of \ntracer concentration into erosion rates. The proposed research supposes both knowledge gaps \ncan be addressed with Structure from Motion (SfM) techniques and downscaled landscape \nevolution models.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 56 \n \nAPPROACH \nAn investigation is proposed to be performed at local MAFES Research locations, including Foil, \nAndrews, Bearden, and Leveck research centers. All locations have drainage ditches and \nadditional areas of the property which exhibit erosion, evidenced by channel incision and \nsidewall cutting; in some cases this erosion is quite substantial (Error! Reference source not \nfound.). Additionally, these locations are subject to a diverse mix of land management practices \ndue to their use as research facilities for a variety of different applications. This offers an \nopportunity for multiple investigations into the role management plays in preventing or \npromoting erosion.  \n \nTaking advantage of MSU’s investment in UAV resources, a multirotor aircraft will be utilized to \nperform SfM analysis and monitoring of erosion over the course of the study period. Structure \nfrom Motion is a technique which relies on the concept of parallax to estimate 3D surfaces from \n2D images. This technique has more recently been accomplished with unmanned aerial vehicles \n(UAV) to create digital surface models. Data are taken with a significant (70%) frontal and side \noverlap between successive images to create a dense point cloud of images. Identifiable \nstructures in each image (e.g., telephone poles, plot markers, sewer caps) are used to align the \nimages properly. Geographic coordinates for these structures can be used to further increase \nthe accuracy of the alignment, thus target research locations will be marked and geotagged \nappropriately. At present, SfM is gaining acceptance as a low-cost alternative to other methods \nwhich estimate surface topography (e.g., LIDAR, terrestrial laser scanning). To perform the \nproposed research, SfM surfaces will be created for locations over time. Change detection \nanalysis will be performed on the time series of SfM surfaces to determine the extent and \nlocation of erosion, and monitor development of additional erosion in these research areas. \nField data will be collected to validate change detection analysis. \n \nRecently SfM was evaluated for its potential to estimate bank erosion in agricultural drainage \nditches and results were favorable for the use of SfM to not only identify eroded areas, but also \nto quantify sediment erosion and deposition volumes (Prosdocimi et al., 2015). In order to \nevaluate deposition and movement, SfM data will be utilized with the Cellular Automation \nEvolutionary Slope and River (CAESAR)-Lisflood model (Coulthard et al., 2012; Coulthard et al., \n2013), a downscaled landscape evolution model. Although there are multiple model options \navailable, this specific model has been selected based on three key advantages. First, using a \nlandscape evolution model in lieu of a soil erosion model results in better simulation of fluvial \nerosion and deposition. Second, a landscape evolution model better represents dynamic \ninteractions between topography, flow, and sediment transport, which are missed by some soil \nerosion models (Coulthard et al., 2012). Third, CAESAR-Lisflood has low initial input variables, \nrequiring only a digital elevation model, rainfall data, and soil particle size. SfM will be used to \nderive the digital elevation model, rainfall data will be gathered with rain gauges which will be \ninstrumented on-site, and field data will be taken to obtain soil particle size. Additional field \ndata will be collected to validate SfM 3D surfaces and CAESAR-Lisflood model outputs.  \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 57 \n \nThis proof-of-concept study addresses the need for more spatially-explicit erosion research by \nutilizing an inherently-spatial model, and also finer spatial and temporal scale erosion research \nbecause the UAVs can be flown on demand (temporal) and at low altitudes (spatial). It also \nprovides an inexpensive, rapid assessment tool which overcomes the limits of tracer studies by \neliminating the need for tracer data. Additionally, because of the nature of the images taken, \ngeographic information systems can be employed to perform analyses on the impact of land \nuse and management. \nANTICIPATED OUTCOME  \nWith this approach, MSU will be uniquely positioned to conduct future research endeavors into \nprecision conservation (i.e., strategic placement of BMPs on the landscape for maximum \nconservation benefit). It will also be possible to provide monitoring and assessment of BMP \nefficacy for multiple types of BMPs, allowing MSU researchers and extension personnel to assist \nagency personnel and landowners with precision placement of BMPs and quantification of \nconservation outcomes from BMP installation. This information is crucial for development of \nmaintenance and operation plans for BMPs and also to justify continued government and \nprivate expenditures in conservation. This study will also serve as a proof of concept for the use \nof UAVs, and specifically SfM, to supply necessary input data at a low-cost for models requiring \nspatially-explicit topography data. \nPOTENTIAL IMPACT  \nThis project has broad and limitless applicability. This is because (1) the issue of erosion is \nubiquitous in managed landscapes and (2) UAVs are immediately accessible in the marketplace \nto anyone with sufficient (as low as $500) funds. Moreover, the CAESAR-Lisflood model is free \nand open-source, available to anyone with the scientific capacity to collect the necessary data. \nThus there are few barriers to transferability, and should a successful outcome be achieved, the \nmethod could be widely adopted. \n \nSpeaking more practically, beyond the agriculture need, if it can be shown that the accuracy of \nSfM surfaces is sufficient, the engineering industry could greatly reduce labor costs associated \nwith survey tasks such as pre-/post-construction surveys and cut/fill analysis. This could include \nmining and restoration activities as well. This would be a significant application of UAV \ntechnology with tangible economic benefits that could be implemented in the near-term \nfuture.  \n \nPROJECT TERM, AMOUNT OF FUNDING, AND FUNDING SOURCE \nThe term of this project is January 1-December 31, 2017. The funding level of this project is \n$17,980. Funding is provided through MAFES’ Special Research Initiative (SRI).  \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 58 \n \n9.6 MONITORING TIMELINES \nTable 9.6.1 describes the proposed monitoring timelines. \nTable 9.6.1 Proposed Monitoring and Modeling Timeline \nA.  Pre- and Post-BMP Implementation Monitoring \nPerformance Date Activity \nMonths 1-3  Monitoring System Installation \nMonths 1-12  Pre-BMP Implementation Monitoring (all locations) \nMonth 12  Annual Report Submittal \nMonths 13-24  BMP Implementation – Cease Monitoring during Construction \nMonths 25-36  Post-BMP Implementation Monitoring (all locations) \nMonth 36  Annual Report Submittal \nMonth 36 Final Report to MDEQ/EPA \n \nB.  Assessing and Predicting In-Stream Processes in the Catalpa Creek Watershed \nTask 3/17 4/17 5/17 6/17 7/17 8/17 9/17 10/17 11/17 12/17 1/18 2/18 \nInitial Survey             \nStream Recon             \nAuto Mon Setup             \nGrab Sampling             \nAuto Sampling             \nLab Analysis             \nX-Section Resurvey*             \nBanks/Bed Charact             \nData Analysis             \nModel Setup/Calib             \nSim Restoration \nScenarios \n            \nReporting             \nInfo Transfer**             \n \nC.  Applied Use of Unmanned Aerial Vehicles in Surface Water Protection \nTask 3/17 4/17 5/17 6/17 7/17 8/17 9/17 10/17 11/17 12/17 1/18 2/18 \nBaseline Survey             \nBaseline Flight             \nMonitoring Flight             \nMonitoring Survey             \nPost Flight             \nData Analysis             \nReporting             \nInfo Transfer**             \n \nD.  Hydraulic Model to Support Conservation and Ecosystem Restoration Efforts within an Impaired, Priority Watershed  \nPerformance Date Activity \nTBD TBD \n \nE.  Assessing Soil Erosion with Unmanned Aerial Vehicles for Precision Conservation \nPerformance Date Activity \nTBD TBD \n* Resurvey will be completed when stormflow events occur.    **Combines MWF and NSL trainings and workshops, academic \ncourse Stream Reconnaissance (Fall 2017). Also considers presentation of results at MWRRI Conference in April 2018.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 59 \n \n9.7 COORDINATION & LEVERAGING PLAN \nA key strategy of the Catalpa Creek Watershed Restoration & Protection Project and DREAMS \n(Demonstration, Research, Education, Application, Management and Sustainability) Center is \nthe coordination of activities and leveraging of resources. The five monitoring and modeling \nprojects described in this section are being funded contemporaneously which will allow for the \npotential coordination and leveraging of these projects to achieve the maximum benefit for the \nawarded funding and execution of this plan. Table 9.8.1 is an analysis of this potential.  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 60 \n \nTable 9.7.1 \nProject Coordination & Leveraging Analysis \nProject SRI - Hydraulic Model MWRRI - Streambank Erosion SRI – SfM Accuracy MWRRI – SfM Best Practices \nTime Frame Jan 1, 2017 – Dec 31, 2017 Mar 1, 2017 – Feb 28, 2018 Jan 1, 2017 – Dec 31, 2017 Mar 1, 2017 – Feb 28, 2018 \nNo Cost Extension N/A 6-12 months N/A  \nStudents Team Up to 4 undergrads \n(1 LAC, 1 CEE, 1 ABE, 1WF/FO) \n1 graduate (2 years) \n1 research associate (25%) \n2 undergrads 2 undergrads \nStudent Work Cross section surveying Cross section surveying  Cross section surveying \nGrab sampling Grab sampling   \nVegetation surveying    \n Material sampling   \nLab analysis Water lab analysis  Water lab analysis \n Materials lab analysis Materials lab analysis Materials lab analysis \n  Soil cores and composition \nanalysis  \n \nModeling Modeling  Modeling \nField/Lab Tasks    UAV UAV \n  Assessment sediment yield main  \nstream 1\nst\n year \nAssessment sediment yield tributaries \nstream/tributaries 2 or more years \n Assessment upland erosion and \nincoming loads \nAssessment streambank erosion \nrates main stream 1\nst\n year \nAssessment streambank erosion rates \nmain stream and tributaries 2 or more \nyears \n \n  \nCharacterizing streambank and \nstreambed material \nCharacterizing streambank and \nstreambed material \n Site characterization   \nCharacterizing vegetation    \n    Monitoring of study sites  Monitoring of sentinel sites \n    Significant field measurements for \n  accuracy comparison \n \nModeling Tasks Hydraulic modeling main stream \n(HEC-RAS) \nHydraulic/channel evolution modeling \n(CONCEPTS in HEC-RAS) \n  \nAssessment sediment budget main \nstream 1\nst\n year (SIAM in HEC-RAS) \nAssessment sediment budget main \nstream/tributaries (SIAM in HEC-RAS) \n  \n  Deposition and removal of \nsediment over long time horizons \n \n  Change detection Develop a method and accuracy \nrating for use of SfM surfaces in \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 61 \n \ntypical models (e.g., CAESAR-\nLisFlood, BSTEM) \n Stream Restoration Scenarios   \nField Equipment \nDeployed \n3 autosamplers main stream 3 autosamplers tributaries instead of \n3 autosamplers main stream \nNone 1 ISCO?? \nLaboratory Testing \nand Analysis \nAutomatic sampling \nTSS TSS  TSS \nGrab sampling \nTSS TSS  \n  \nTurbidity Turbidity  \n  \npH pH  \n  \nElectric conductivity Electric conductivity  \n  \nSalinity Salinity   \nMaterial sampling \n  Particle size distribution Particle size distribution  Particle size distribution \n   Particle size distribution \n  Bulk density Bulk density  \n   Bulk density \n Cohesion  \n   Cohesion \n Friction angle  \n   Friction angle \n Jet testing  Jet testing \n \nPrincipal Investigators (PIs) and cooperators for all five of the projects are members of both the Planning and Implementation Team and the \nHydrology/Modeling Work Group for the overall project, and development of these individual monitoring projects/proposals was conducted \nthrough collaboration among these members.    \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 62 \n \n9.8 MONITORING AND MODELING BUDGET FOR PHASE 1 PROJECT \nTable 9.8.1 identifies the proposed monitoring budget. \nTable 9.8.1 \nProposed Monitoring and Modeling Budget for All Phase 1 Projects \nA. Pre- and Post-BMP Implementation Monitoring ((Funded by 319 NPS Award) \nCategory \nFederal Contribution \n(NPS 319) \nMatch \nTotal  \nTransportation of Samples to Jackson \n$2875   \nEquipment (6 samplers/flow meters) \nIn-kind \nSupplies (sampling jugs/labels) 600 \nUndergraduate Stipend 10000 \nNutrient Analysis  TBD \nMicrobial Analysis (10/sample x 10) \n1200 \nTotal $14675 $9783 $24458 \n*B.  Assessing &Predicting In-Stream Processes in the Catalpa Cr Watershed (Funded by MWRRI/USGS 104b Award) \nCategory \nFederal \nContribution (USGS) \nState/MWRRI \nContribution \nMSU/3\nrd\n Party \nContribution \n \nTotal \nDirect Costs $21663 $10043 14998 \n$65818* \nFacilities and Administrative Costs \n0 4570 15544 \nTotal $21663 $14613 $29542 \n*C.  Applied Use of Unmanned Aerial Vehicles in Surface Water Protection (Funded by MWRRI/USGS 104b Award) \nCategory \nFederal \nContribution (USGS) \nState/MWRRI \nContribution \nMSU/3\nrd\n Party \nContribution \nTotal \nDirect Costs $15253 $5568 $10571 \n$45680* \nFacilities and Administrative Costs \n0 9474 4814 \nTotal $15253 $15042 $15385 \nD.  Hydraulic Model to Support Conservation and Ecosystem Restoration Efforts within an Impaired, Priority Watershed \n(Funded by MAFES) \nCategory \nFederal \nContribution \nState/MWRRI \nContribution \nMAFES \nContribution \nTotal \nSalaries   $20800 \n$33300 \nCommodities   12500 \nTotal 0 0 $33300 \nE.  Assessing Soil Erosion with Unmanned Aerial Vehicles for Precision Conservation (Funded by MAFES SRI Award) \nCategory \nFederal \nContribution \nState/MWRRI \nContribution \nMAFES \nContribution \nTotal \nSalaries $14780   \n$17980 \nCommodities 3200   \nTotal $17980 0 0 \nTotal Monitoring and Modeling Budget \nCategory \nFederal Contribution \n(319 NPS, USGS, SRI) \nOther (319 NPS Match, State/MWRRI, \nMSU/3\nrd\n Party, MAFES) \nTotal \nTotal $69571 $117665 $187236 \n*These 104b awards are not eligible for match under section 319 as they have already been allocated under a different funding source. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 63 \n \n10 CONCLUSION \nIn conclusion, this Implementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1 \ndescribes the specific initial management activities planned for the Red Bud-Catalpa Creek \nWatershed Restoration and Protection Project and addresses the comments made by MDEQ \nand EPA as a result of evaluation of MSU’s Water Resources Management Plan for the Red Bud-\nCatalpa Creek Watershed. Included in this Phase 1 plan are descriptions of the recommended \nEPA watershed planning process that was followed, MSU’s phased implementation approach, \nprioritized critical management areas, proposed agricultural BMPs and urban storm water \nplanning activities, information and education plan, implementation schedule, measurable \nmilestones and project outcomes, monitoring plan, budgets for these activities, and input from \nwatershed stakeholders.   \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 64 \n \nREFERENCES \n \nBrooks, J. P., Adeli, A., McLaughlin, M. R., & Miles, D. M. (2012). The effect of poultry manure \napplication rate and AlCl3 treatment on bacterial fecal indicators in runoff. Journal of water and \nhealth, 10(4), 619-628. \nFaber-Langendoen, D., Hedge, C., Kost, M., Thomas, S., Smart, L., Smyth, R., Drake, J. and \nMenard, S., 2011. Assessment of wetland ecosystem condition across landscape regions: A \nmulti-metric approach. NatureServe, Arlington, VA.+ Appendices. \n \nMagurran, A.E. 2013. Measuring Biological Diversity. Wiley-Blackwell, 264 pages. \n \nSmith, B. and J. B. Wilson. 1996. A Consumer's Guide to Evenness Indices. Oikos 76(1): 70-82 \n \nUSEPA 2008: Handbook for Developing Watershed Plans to Restore and Protect Our Waters, \nEPA 841-B-08-002. USEPA, Washington, DC.  \n \nUSEPA 2002 Method 1103.1 Escherichia coli (E. coli) in water by membrane filtration using \nmembrane thermotolerant Escherichia coli agar (mTEC). EPA 821-R-02-020. USEPA, \nWashington, DC. \n \nUSEPA 2002 Method 1106.1: Enterococci in water by membrane filtration using membrane-\nEnterococus esculin iron agar (mE-EIA). EPA 821-R-02-0211. USEPA, Washington, DC. \n \nWater Resources Management Plan for the Red Bud-Catalpa Creek Watershed, 2015 \n(unpublished).  \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 65 \n \nPracticeSite #Total Unit SizeUnit Unit CostBMP Cost60% of BMP Cost\n561-Heavy Use Area Protection1f4500sqft$1.27$5,715$3,429\n561-Heavy Use Area Protection1g4500sqft1.27$5,715$3,429\n576-Livestock Shelter Structure2m1000sqft3.94$3,940$2,364\n576-Livestock Shelter Structure2p1000sqft3.94$3,940$2,364\n576-Livestock Shelter Structure2Q1000sqft3.94$3,940$2,364\n512-Native Grass Planting5a$1,693$1,016\n382-Fencing6a2200ft3.03$6,666$4,000\n342-Critical Area Planting (Heavy)3f-sites around fences$1,107$664\nBank StabilizationWest Line Road$52,654$31,592\nEstimated Total for Critical Area #1$85,370$51,222\n561-Heavy Use Protection1j38345sqft1.274869829219\n561-Heavy Use Protection1k30600sqft1.273886223317\n342-Critical Area Shaping/Grading (Heavy)3d1acre22141328\n382-Fencing6b950sqft3.0328791727\n410-Grade Stabilization Structure7a60003600\n410-Grade Stabilization Structure7b60003600\n410-Grade Stabilization Structure7c60003600\n410-Grade Stabilization Structure7d100006000\nEstimated Total for Critical Area #212065372392\n342-Critical Area Planting (Heavy)11a1acre22141328\n410-Grade Stabilization Structure12a100006000\n382-Fencing13a5800ft3.031757410544\n391-Riparian/Forest Buffer14a7.5acre39792387\n578-Stream Crossing15a1000sqft4.4444402664\n578-Stream Crossing15b1000sqft4.4444402664\n578-Stream Crossing15c1000sqft4.4444402664\nEstimated Total for Critical Area #34708728252\nBMP Total All Critical Areas24 BMP sites$253,110$151,866\nCRITICAL AREA #2  Beef Unit Conservation Practices\nCRITICAL AREA #3  Dairiy Unit Conservation Practices\nRed Bud-Catalpa Creek Watershed Phase 1 BMPs\nAppendix A\nNRCS  Conservation Specifications for Phase I Best Management Practices\nCost are most currently available to MDEQ as of February 15, 2017\nCRITICAL AREA #1    Beef Unit Conservation Practices\n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 66 \n \nStreambank Stabilization Site – West Line Road \nMaterials   Quantities       Unit Cost   Total Cost    \nRock Riprap   325.0 Tons       $120/Ton   $39,000 \nConcrete Grout   19.0 Cu. Yd.       $250/Cu. Yd.   $  4,750 \nGeotextile   476.0 Sq. Yd.       $4/Sq. Yd.   $  1,904 \nExcavation   300.0 Cu. Yd.        $10/Cu. Yd.    $  3,000 \nEarth Fill   200.0 Cu. Yd.       $20/Cu. Yd.   $  4,000 \n           $52,654  \n \n \n \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 67 \n \nAppendix B \nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1 \nCumulative Budget for 319 NPS Award \n \nA.  Phase 1 BMP Implementation Funded by 319 NPS Award \nNRCS Practice Site # \n1\n Estimated \nCosts to Fully \nImplement \nBMPs (100% \nBasis) \n2\n 319 NPS \nEligible Funding \n(60% of Costs to \nFully Implement \nBMPs)* \n3 \nMatch \nRequirement \nCritical Area #1 – Livestock Forage Area \n561 – Heavy Use Protection (Beef Feeding Area) 1f $5715 $3429  \n561 – Heavy Use Protection (Beef Feeding Area) 1g 5715 3429 \n576 – Livestock Shelter Structure 2m 3940 2364 \n576 – Livestock Shelter Structure 2p 3940 2364 \n576 – Livestock Shelter Structure 2Q 3940 2364 \n512 – Native Grass Planting  5a 1693 1016 \n382 – Fencing \n4\n 6a 6666 4000 \n342 – Critical Area Planting (Heavy) Around \nfences \n1107 664 \nBank Stabilization (per NRCS engineering \ndesign) \nWest Line \nRoad \n52654 31592 \nEstimated Total – Critical Area #1 $85370 $51222 $34148 \nCritical Area #2 – Beef Research Unit \n561 – Heavy Use Protection (Concentrated \nOperations) \n1j $48698 $29219  \n561 – Heavy Use Protection (Beef Runway) 1k 38862 23317 \n342 – Critical Area Shaping/Grading (Heavy) 3d 2214 1328 \n382 – Fencing \n4\n 6b 2879 1727 \n410 – Grade Stabilization Structure (Standard \nCantilever) \n7a 6000 3600 \n410 – Grade Stabilization Structure (Standard \nCantilever) \n7b 6000 3600 \n410 – Grade Stabilization Structure (Drop \nPipe/Riser) \n7c 6000 3600 \n410 – Grade Stabilization Structure (Check Dams) 7d 10000 6000 \nEstimated Total – Critical Area #2 $120653 $72392 $48261 \nCritical Area #3 – Dairy Grazing Area \n342 – Critical Area Planting (Heavy) 11a $2214 $1328  \n410 – Grade Stabilization Structure (Check Dams) 12a 10000 6000 \n382 – Fencing \n4\n 13a 17574 10544 \n391 – Riparian/Forest Buffer 14a 3,979 2387 \n578 – Stream Crossing  15a 4440 2664 \n578 – Stream Crossing  15b 4440 2664 \n578 – Stream Crossing  15c 4440 2664 \nEstimated Total – Critical Area #3 $47087 $28252 $18835 \nEstimated Total – Critical Areas 1, 2, & 3 24 Sites $253110 $151866 $101244 \n \n*Rounding may result in slight differences between column totals and multiplication products. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 68 \n \n \nB.  Phase 1 Information and Education Funded by 319 NPS Award \nCategory Activity 60% of Cost*  \n3 \nMatch \nRequirement \nSalaries  \n Project Oversight  $4732 \nSummer Intern/Project Assistance $12079 \nCommodities \n Trailer Repairs $1000 \nBMP Signage 3000 \nMSU Classes – Educational Materials 4500 \nField Day for Local Schools – Materials and Support 2000 \nProfession Development: NRCS Training 5000 \nEducator Workshop 2500 \nIn-Service Training: Extension Agents 1000 \nWatershed Management Workshop 500 \nMunicipal Leaders’ Workshop    250 \nPublication Costs; Educational Materials, Surveys 3000 \nContractual \n Virtual field trip development $13900 \nEstimated Total – Information and Education           $89102 $53461 $35641 \n \nC.  Phase 1 Monitoring Funded by 319 NPS Award \nProject Needs \nPre-BMP \nImplementation \nPost-BMP \nImplementation \n60% of Costs* \n3 \nMatch \nRequirement \nTransportation of Samples to Jackson $1438 $1438 $2876  \nEquipment (6 samplers/flow meters) In-kind In-kind In-kind \nSupplies (sampling jugs/labels) 300 300 600 \nUndergraduate Stipend 5000 5000 10000 \nNutrient Analysis  TBD TBD TBD \nMicrobial Analysis (10/sample x 10) 600 6000 1200 \nEstimated Total – Monitoring             $24458 $14675 $9783 \n \nD.  Administrative Management (Indirect) Costs Funded by 319 NPS Award \n20% Admin Management (Indirect) Costs \n5   \non Projects Total of $220,002 44000 $29333 \n \n \n*Rounding may result in slight differences between column totals and multiplication products. \n   \n \n \n \n \n \nTotal Phase 1 Project Costs Funded by 319 NPS Award \n Total Estimated \nCosts\n \n6 \n60% of Costs* \n3 \nMatch \nRequirement \nA. Phase 1 BMP Implementation $253110 $151866 $101244 \nB. Phase 1 Information and Education 89102 53461 35641 \nC. Phase 1 Monitoring 24458 14675 9783 \nD. Phase 1 Administrative Management (Indirect) Costs 73333 44000 29333 \nEstimated Total Phase 1 Project Costs $440003 $264002 $176001 \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 69 \n \nTotal Phase 1 Budget and Investment All Projects \nFunding Sources \nFederal \nContribution \n(319 NPS, USGS, \nMAFES SRI) \nNon-Federal \nContribution \n(319 NPS BMP \nMatch, \nState/MWRRI, \nMSU/3\nrd\n Party, \nMAFES) \nTotal \nMDEQ/EPA 319 NPS Program $264000* $176000* 440000* \nMWRRI 104b Water Research Grant Program (2 grants)  36916 74582 111498 \n \nMAFES/Special Research Initiative Grant Program 17980 33300 51280 \n $318896 $283882 $602778 \n*Rounded amounts were used in writing the 319 grant. \n \n1\n ESTIMATED COSTS TO FULLY IMPLEMENT BMPS (100% BASIS).  The cost estimates provided by NRCS for these \nBMPs are based upon the FY2016 USDA/NRCS Base Cost Estimate and apply to agricultural producers \nthat have been farming for more than 10 years and do not qualify as a Beginning Farmer, Limited \nResource Farmer, or a Socially Disadvantaged Farmer. The Base Cost Estimate, compiled by USDA/NRCS \nfor Mississippi, Arkansas, and Louisiana, is a combined average cost estimate that typically represents \n50% of the costs to actually implement the practice in these three States. The estimated costs to fully \nimplement the Phase 1 BMPs listed in the preceding table represent 100% of the total costs (or NRCS’ \nBase Cost Estimate X 2).  \n2\n 319 ELIGIBLE FUNDING (60% OF COSTS TO FULLY IMPLEMENT BMPS).  These costs represent 60% of the \nestimated costs to fully implement the selected BMPs, which is the amount that is eligible for a 319 NPS \nfunding award (pursuant to other program requirements).  \n3\n 319 IN-KIND MATCH REQUIREMENT (40% OF IMPLEMENTATION COSTS).  319 NPS funding requires a 40% match \n(in-kind services or monetary contribution). It is anticipated that MSU will contribute in-kind services to \ninstall the designated BMPs and cover this requirement. \n4  \nFENCING REQUIREMENTS.  USDA/NRCS handles requests from agricultural producers that desire to \nsubstitute wooden post with metal pipes, angle iron, etc. by first requesting from the producer what is \ndesired for braces, H-braces, corner posts, and line (pull) posts. This information is then provided to the \nUSDA/NRCS State Grazing Land Specialist for consideration of a waiver to use the materials desired by \nthe producer. Normally, MDEQ requires that conservation practices implemented under 319 NPS funds \nfollow USDA/NRCS practice standards and specifications. Because of this, MDEQ’s approval would also \nbe required in the event a waiver is requested. \n \n5\n 20% ADMINISTRATIVE MANAGEMENT (INDIRECT) COSTS.  MDEQ and MSU have negotiated an indirect rate of \n20% of the total project components eligible for 319 NPS funding ($220,002 to offset MSU’s \nadministrative management costs. This amount is $44,000. \n6\n 319 NPS ELIGIBLE COSTS.  COSTS ELIGIBLE FOR 319 NPS FUNDING SUPPORT.  \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 70 \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 71 \n \nAppendix C \nInput Received During 9/28/15 Evening Meeting \nof Catalpa Creek Watershed Stakeholders \n \nPresentation to Stakeholders \n Catalpa Creek Restoration and Protection Project and Watershed D.R.E.A.M.S. Center \nQuestions Asked to Stakeholders \n What water or ecosystem-related concerns do you have in the Catalpa Creek \nWatershed? How are you being affected? \n What would you like to see addressed through this project? What are your priorities? \n What challenges or barriers will this project face? What are your ideas to overcome \nthese?  \n Would you like to become involved in this project? In what way? \n What agricultural landowners might be interested in cost-share opportunities to reduce \nerosion from your lands?  \n What agricultural landowners might be interested in cost-share opportunities to \nimprove the ecosystem and habitat on your lands? \n What governmental entities are interested in supporting this project? \n What opportunities are you aware of that could be leveraged with this project? Who \nwould be the contact?  \n Are there statements or other comments you would like to make about this project? \nGeneral Stakeholder Thoughts and Comments \n What is the creek’s history of channelization? \n– Evaluate land use changes over time \n– Research railroad construction  \n– Research Board of Supervisors’ minutes \n Tributary streams need to be identified to assist stakeholder identification.  \n There is great potential for fisheries because of soil/water quality.  \n– Good fisheries currently exist in some reaches of Catalpa Creek. \n– Doctoral and other fisheries research characterization data exists (past MSU \nproject with MDEQ funding).  \nStakeholder Concerns (and Selected Responses)  \n Sources of debris and contaminants from upstream  \n Cropping near creek sides (certain sections of the creek has a limestone base)  \n Fishing pressure (trespassing)  \n– Potential impact on private property along creek  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 72 \n \n Will there be site visits to properties?  \n– Response: No mandate exists for these voluntary financial assistance programs. \nNRCS will provide assistance in response to private landowners’ requests. MSU \nwill assess its landholdings to identify any pollutant sources and restoration \nneeds.  \n Will stream buffers/BMPs be implemented on MSU property?  \n– Response: MSU/MAFES administration is very keen in making improvements in \nwater quality, habitat/ecosystem health, and stream structure/function.  \n Contamination of water from MSU dairy  \n Education and funding needed to assist private landowners implement BMPs  \n Dead animal bones (no meat) – apparent intentional disposal near creek  \n Algal blooms  \n Invasive species  \n MSU Master Plan elements may not be feasible or implementable (e.g., 100-foot stream \nbuffers, covered culverts). \n– Response: This is an opportunity to integrate urban storm water management \nconcepts identified in the Master Plan and agricultural watershed-based \nplanning, and to advance these integrated approaches through implementation \nactions.    \n Stream bank erosion and loss of riparian zone   \nHow Stakeholders Are Being Affected \n Loss of streamside trees due to bank failure  \n Decreased fishing quality/experience \nNeeds \n Funding  \n Cost-share opportunities (e.g., NRCS) \n Involve all stakeholders and keep this evening’s meeting participants involved in the \nfuture.  \nSolutions \n Make CP-22 cost share program available through local SWCD/NRCS office for \nstreamside buffers.  \nPartnerships/Leveraging   \n City anticipates upgrades to storm water infrastructure over the next 10 years near \nheadwaters at Oddfellows Cemetery and Cotton District.  \n Facilitate education opportunities for city officials to learn available storm water options \nand coordinate planning with MSU. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 73 \n \n October 19, 2015 – Charrette at Starkville Sportsplex for stakeholder input as part of \nupdate to City’s plan, which includes storm water management.   \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 74 \n \nAppendix D \n \nDetermination of Management Areas of Concern \nto Establish Best Management Practices within the Catalpa Creek Watershed \n \nIdentification of management areas of concern includes the assessment of soil erosion and the \ndetermination of existing and target nutrient loads. As the first procedure identifies more \ndetailed areas of management, the second brings results at the level of sub watershed. The \nupper 4 miles of the main stream were identified as a critical management zone to control in-\nstream processes. Definition of this area comes from visual identification and professional \njudgment. \n \nGeneralities. Soils within the Catalpa Creek watershed are moderately well drained along most \nof the major part of the northern area of the watershed, where the higher slopes are observed \nand the soils could store up to 3 cm of water. This last condition makes the soils have a medium \nto high runoff potential during periods of continuous stormflow events. \n \nAlong  the  southern  area  and  some  areas  along  the  northeastern  part  of  the  watershed, \nsomewhat poorly drained soils are predominant with a capability to store up to 5.25 cm of water. \nHydrologic soil groups C and D are predominant for the entire watershed, which combined with \nthe very high capability of the soils to retain soil moisture and become and remain in saturation, \nmakes the runoff potential along these areas range from medium to very high. \n \n  \nLand Slope and Runoff Accumulation Paths within the Watershed \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 75 \n \n \nSoil Water Storage Capability \n \nSoils Drainage Class \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 76 \n \n \nSoils Hydrologic Groups \n \n \nWatershed Runoff Potential \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 77 \n \n \nWatershed Flood Frequency \n \n \n \n \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 78 \n \nManagement Areas of Concern for Soil Erosion Control  \n \nManagement areas of concern for soil erosion control within the Catalpa Creek watershed were \ndetermined based on the assessment of annual soil erosion rates (A) by using the RUSLE2 \nalgorithm (A=RKLSCP) on a geographical information system (ArcGIS). The erosion rates were \ngenerated for the different areas of the watershed, by combining information about \npredominant land cover/land use (C factor), the susceptibility of each soil map unit to be \neroded (K factor), the topographic characteristics of the fields (LS factor), and assuming no \nmanagement practices are currently performed in the area (P=1). The factor relating the energy \nof the precipitation (R) was obtained by using the rainfall erosivity calculator tool from EPA for \nthe area of study. (http://www.epa.gov/npdes/rainfall-erosivity-factor-calculator-small-\nconstruction-sites#getTool). \n \nOnce the annual erosion rates are estimated, they are compared to the soil loss tolerance (T) \nfor each soil map unit. The T factor is defined as the maximum rate of annual soil erosion that \nwill permit crop productivity to be sustained economically and indefinitely on the land. The T \nfactors are integer values from 1 through 5 tons/acre/year. The lowest is for shallow or fragile \nsoils, and the highest is for deep soils that are least susceptible to be degraded by erosion. \nAreas with annual erosion rates higher than the soil loss tolerance are included in the list of \ncritical management zones for soil erosion control. \n \nSoils within the watershed are mostly medium textured to fine soils with moderate to high \nsusceptibility for erosion. This is reflected in the distribution of the values of the soil erodibility \nfactor (K) within the watershed, which mostly range from 0.24 to 0.48, reflecting soils \nmoderately susceptible to detachment and they produce moderate to very high runoff. Most of \nthe soils within the watershed (84%) have a predominant soil loss tolerance (T) higher than 4 \nton/acre/year.  \n \nThe highest soil loss tolerance rates for the soils in the watershed contrast with the \nidentification of an important area of the watershed (80%) ranked as highly erodible land (HEL). \nA HEL is defined based on an erodibility index, a soil map unit (soil series) with an erodibility \nindex of 8 or greater is a HEL. The erodibility index for a soil map unit is determined by dividing \nthe potential erodibility for the soil map unit (R*K*LS), where R represents the precipitation \nenergy, K is the soil erodibility and LS is the factor related to the gradient and length of the \nslope), with the soil loss tolerance (T).  \n \n  \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 79 \n \n \nLand Cover/Land Use \n \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 80 \n \nSoil Erodibility Factor (K) \n \n \nCover Management Factor (CP) Assuming No Management Practices (P=1) \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 81 \n \n \nErodibility Index Factor (Highly Erodible Lands) \nBecause lands under pastures/hay  are the most predominant land use/land cover condition \nwithin the Catalpa Creek watershed, annual soil erosion rates appear to be predominantly low \n(smaller than 5 ton/acre), while soil erosion rates higher than 15 ton/acre were mostly \nobserved from developed areas and cultivated crops. \n \nThe management areas of concern for erosion control were determined by identifying areas \nwith annual soil losses higher than the soil loss tolerance for the corresponding map unit. From \nthe 28,928 acres in the watershed, approximately 7.6% of the area (2200 acre) was included \nwithin the critical management zones for erosion control. Around 650 acres correspond to \nareas under cultivated crops, 430 acres to areas under pastures/hay, 325 acres to shrub/scrub \nlands, and other 330 acres to developed areas and unpaved roads. \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 82 \n \n \nAnnual Soil Erosion Rates \n \nSoil Loss Tolerance for Different Soil Map Units \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 83 \n \n \nManagement Areas of Concern for Erosion Control within the Red Bud-Catalpa Creek Watershed \nManagement Areas of Concern for Erosion Control \nManagement Areas of Concern for Erosion Control \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 84 \n \n \nManagement Areas of Concern for Erosion Control for Different Land Use/Land Cover Types \nwithin the Red Bud-Catalpa Creek Watershed \nManagement Areas of Concern for Erosion Control \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 85 \n \n \nManagement Areas of Concern in the Upper Headwaters \nof the Red Bud-Catalpa Creek Watershed \nManagement Areas \nof Concern \n \nManagement Areas of Concern for Erosion Control \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 86 \n \nManagement Areas of Concern in the Mid-Headwaters \nof the Red-Bud Catalpa Creek Watershed  \n \nManagement Areas \nof Concern \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 87 \n \nDetermination of the C Factor for the Different Land Cover Types of the Watershed (Source: Reale, \n2012; from http://www.unm.edu/~jreale/term_project.htm accessed March, 28 2016) \n \nClass Definition C-Factor \nWater                                        Open Water 0.00 \nDeveloped Low Intensity Residential 0.24 \nDeveloped High Intensity Residential 0.24 \nDeveloped Commercial/Industrial/Transportation 0.24 \nBarren Bare Rock/Sand/Clay 0.50 \nBarren Quarries/Strip Mines/Gravel Pits 0.50 \nBarren Transitional     0.50 \nForested Upland Deciduous Forest 0.006 \nForested Upland Evergreen Forest 0.006 \nForested Upland Mixed Forest 0.006 \nShrub Land Shrub Land 0.06 \nNon-natural Woody Orchards/Vineyards/Other 0.37 \nHerbaceous Upland Grasslands/Herbaceous 0.06 \nHerbaceous Planted/Cultivated Pasture/Hay 0.37 \nHerbaceous Planted/Cultivated Row Crops 0.37 \nHerbaceous Planted/Cultivated Small Grains 0.37 \nHerbaceous Planted/Cultivated Fallow 0.37 \nHerbaceous Planted/Cultivated Urban/Recreational Grasses 0.10 \nWetlands Woody Wetlands 0.00 \nWetlands Emergent Herbaceous Wetlands 0.00 \n \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 88 \n \nManagement Areas of Concern for Nutrient Impairment \nTo determine the management areas of concern for nutrient impairment, estimated existing \nloads and nutrient targets were calculated from the NLCD land cover/land use distribution \nwithin the different tributary watersheds in the Catalpa Creek. \nNutrient loads from the different land cover/land use types were calculated by multiplying the \nland use category size (area) by the estimated nutrient load as proposed by Shields et al (2008) \nand frequently evaluated by MDEQ. \nEstimated average annual total N load delivered to streams (Source: Shields, et al, 2008) \nLand Use/Land Cover Estimated Average Annual N Yield \n(Mg/km\n2\n) \nEstimated Average Annual P Yield \n(Mg/km\n2\n) \nForest 0.043 0.024 \nPasture 0.3 0.50 \nCropland 2.0 1.0 \nUrban 0.11 0.014 \nWater 0.10 0.10 \nWetland 0.10 0.10 \nBarren 0.043 0.024 \n \nThe relevant information for each sub watershed used to estimate the target load (e.g. area, \naverage annual flow) was extracted from the NHDPLUS Dataset. Nutrient target loads were \nestimated based on EPA guidance for calculation of targets when considering all available data. \nThe reference concentrations were 0.7 mg/l and 0.1 mg/l of TN and TP, respectively.  \nThe difference between estimated existing loads and target loads is used to determine the \nnutrient reduction from each sub watershed, which becomes a critical management zone if an \nexisting load exceeds the target. \nA total of 2727.5 acres along the northern headwaters, out of the entire watershed area \n(28,928 acres), especially those areas including the Mississippi State University Campus and the \nresearch farm, are part of the management areas of concern with most important contribution \nof nutrients (both, P and N) and highest rates of reduction needed to achieve the proposed \ntargets. The most critical area is mostly urban (MSU Campus), as the other subwatersheds have \nvery mixed land uses, but with a predominance of pasture/hay systems. \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 89 \n \n \nTotal Nitrogen Load from Subwatersheds within the Red Bud-Catalpa Creek Watershed \nTotal Phosphorus Load from Subwatersheds within the Red Bud-Catalpa Creek Watershed \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 90 \n \n \nTotal Nitrogen Load Reduction (kg/day) within the Red Bud-Catalpa Creek Watershed \n \nTotal Phosphorus Load Reduction (kg/day) within the Red Bud-Catalpa Creek Watershed \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 91 \n \nManagement Areas of Concern for Stream Processes \n \nStream processes have been well identified along different segments on the upper four miles of \nthe main stream of the Catalpa Creek and some of its tributaries. Active eroding streambanks, \nstreambed scouring and streambank undercutting processes are importantly increasing the \nload of sediments carried by the stream. The presence of sand and gravel bars observed a few \nfeet upstream of road crossings and stream junctions, and inside of bend way segments are \nconsequences of the erosion activity observed along the segments upstream. As discussed in \nthe Water Resources Management Plan for the Red Bud-Catalpa Creek Watershed, at the \nboundary of the university’s research farm, the stream maintains its incised conditions, but an \nincrease in its sinuosity is evidenced by the frequent presence of segments with sequential \npatterns of rills and pools, and a reduction in the channel slope and the streambank sides’ \nslopes. \n \nA preliminary assessment completed by undergraduate students of the Civil and Environmental \nEngineering Department evidenced that sediment concentrations and turbidity along the main \nchannel are high, while pH and dissolved oxygen levels are lower at downstream locations \ncompared to measurements from a monitoring station located at the Campus boundaries on \nBlackjack Road. After leaving the campus, sediment concentrations and turbidity decreased, but \nan increasing trend was observed between transects 1.3 miles and 2.5 miles, where active \nstreambanks were more frequently observed.  \n \n \n \n \n  \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 92 \n \n \n \n \n \nActive Streambanks along the Upper 4 Miles of the Main Stem of Catalpa Creek \n(Images from Bing.com) \n\nImplementation Plan for the Red Bud-Catalpa Creek Watershed Phase 1_2/28/17 93 \n \n \nActive Stream Banks along the Upper 4 miles of the Main Stem of Catalpa Creek \n(Images from Bing.com) \n \n \n \nStream Bank Instability Downstream of a Dam on a Catalpa Creek Tributary \n(Images from Bing.com) ",
  "metadata": {
    "id": "red-bud-catalpa-creek-watershed-phase-1-plan-2017",
    "originalName": "Red_Bud_Catalpa_Creek_Watershed_Phase_1_Plan_2017.pdf",
    "size": 7850741,
    "uploadedAt": "2025-10-06T01:30:57.359Z",
    "pageCount": 93,
    "info": {}
  }
}