{
  "id": "booths-creek-bayou-pierre-watershed-plan",
  "rawText": "\n\nBooths Creek-Bayou Pierre GY 2018 \n1 \n \nBooths Creek-Bayou Pierre Watershed Plan \n9 Key Elements \nHUC 080602030502 \nMWS 6028 \nGY18 Proposed Project Area \nOctober 3, 2017  \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Booths Creek-Bayou Pierre Watershed is located in Claiborne County, MS, and is a \ntributary in the South Independent Stream River Basin.  This watershed is 29,299 acres and \ncontains many different land use types, including forest (60%), pasture/grassland (13%), \nscrub/barren (11%), wetland (4%), cropland (5%) and urban (5%) as is depicted in Figure 1.  The \narea is mostly known for hunting and other recreational activities such as four-wheeling and \npicnicking on the sandbars.  Bayou Pierre is the major water body in the watershed although \nsmaller tributaries, like Booths Creek and Storm Creek, flow into Bayou Pierre.   \n \nWithin the Booths Creek-Bayou Pierre Watershed, there have been several TMDLs developed \nfor different pollutants.  Bayou Pierre, water body segment 602812, has a completed TMDL for \npH.    Also on Bayou Pierre (MS449M), there is a TMDL for pathogens.  Storm Creek, segment \n602811, is currently listed on the 2016 303(d) List of Impaired Water Bodies for Biological \nImpairment.    \n \nIn order to make water quality assessments on wadeable streams outside of the Mississippi \nAlluvial Plain, MDEQ uses a calibrated and verified index of biological integrity (IBI) referred \nto as the Mississippi Benthic Index of Stream Quality (M-BISQ).   Using biological community \ndata and comparing it to the attainment thresholds from the M-BISQ, Storm Creek was assessed \nas not attaining (segment ID# 602811) Aquatic Life Use Support.  MDEQ has a strong team of \nscientists and engineers focused on evaluating water quality data and identifying stressors in \nwater bodies that have been listed as being biologically impaired using benthic \nmacroinvertebrate community data.  If biological community data indicate that a water body \nsegment is impaired, an investigative, stressor identification analysis using strength-of-evidence \napproach is conducted to determine the cause(s) of the impairment.  Such causes may range from \nspecific pollutants (e.g. Total Nitrogen) to other causes of pollution such as sedimentation, \nhabitat loss or hydrologic alteration.  In most cases, nonpoint sources contribute, or are the \nprimary causes of impairment.  MDEQ relies upon all available monitoring and assessment data \nand conducts additional monitoring to gather the necessary data and information to help \ndetermine both the causes and sources of impaired waters.  The U.S. Environmental Protection \nAgency (EPA) Stressor Identification Process and Stressor Identification Guidance Document \n(USEPA, 2000), is used to identify most probable stressors causing biological impairment to \nprovide the information necessary to develop required TMDLs that will guide restoration \nactivities.     \n \nThere are 29 point sources (42 outfalls) in the watershed that flow into the impaired segment. \nCurrently, there are 18 that are active and 11 that are inactive. It is noted that an inactive point \nsource is a NPDES facility that is not in use or is closed. An inactive point source may be \n\nBooths Creek-Bayou Pierre GY 2018 \n2 \n \nreactivated when needed. There are data available for only 11 of the point sources (active and \ninactive). Most all of the discharge monitoring report (DMR) data submitted by these facilities \nare within the 6.0 S.U. to 9.0 S.U. range for pH which is within the limits of the water quality \nstandard.  The specific causes of the low pH for this water body are not known, but are believed \nto be a combination of point source discharges and storm water discharge over acidic soils \n(TMDL Report, 2014). \n \n  \n\nBooths Creek-Bayou Pierre GY 2018 \n3 \n \n \n \nFigure 1: Booths Creek-Bayou Pierre Watershed Landuse Map, 2011 NLCD \n\nBooths Creek-Bayou Pierre GY 2018 \n4 \n \nElement b: Expected Load Reduction \n \nBayou Pierre (602812) was on MS’s 2014 Section 303(d) list of Impaired Waters with the listed \ncause identified as pH.  The TMDL segment of Bayou Pierre is a total of 6.04 miles (Figure 2).  \nBayou Pierre (MS449M) is 14.27 miles and extends beyond the boundaries of the Booths Creek-\nBayou Pierre Watershed: however, the 6.56 miles of Bayou Pierre within the watershed was \nimpaired for pathogens.   \n \nThe nonpoint sources causing or contributing to pH violations are unknown. The potential \nnonpoint sources include, but are not limited to, low pH in storm water runoff, groundwater \ninfiltration, and acid rain deposition.  Soils in this area are known to have low pH.  Best \nmanagement practices that treat sedimentation would keep acidic soils from entering streams and \ntherefore contributing to the pH issue.  The load allocation for this TMDL suggests that the pH \nof waters originating from any nonpoint sources in the watershed shall be no less than 6.0 S.U. \nand no greater than 9.0 S.U. if possible based on the natural conditions found in the watershed.  \nAs for the pathogen contributions from nonpoint sources, the TMDL recommends that cattle \naccess to streams should be limited.  \n \nThe NRCS has a list of approved BMPs to address sediment and pathogens and this list will be \nused to identify candidate BMPs in Booths Creek-Bayou Pierre watershed. \n \n  \n\nBooths Creek-Bayou Pierre GY 2018 \n5 \n \n \nFigure 2: Segment MS 602812 Bayou Pierre   \n\nBooths Creek-Bayou Pierre GY 2018 \n6 \n \nElement c: Proposed Management Measures \n \nCoordinating partners with NRCS include the Mississippi Association of Conservation Districts \n(MACD), the Mississippi Soil and Water Conservation Commission (MSWCC), the Mississippi \nDepartment of Environmental Quality (MDEQ), and the local Soil and Water Conservation \nDistricts (SWCDs) within the counties of the National Water Quality Initiative area.  Through a \ncollaborative effort to identify water quality concerns and needs within this watershed, these \nagencies feel the following management measures will help ensure success.  Those measures are \nas follows:  \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDL(s); \n4. Ease of showing effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the Initiative period); \n \nAt present, Bayou Pierre has TMDLs for pH and pathogens.  Based on previous experience in \nwatersheds with similar impairments, our partners recommend installation of the following \nBMPs to help mitigate pH and pathogen issues in the Booths Creek-Bayou Pierre watershed \nhelping the stream recover: fencing, watering facilities, heavy use areas, stream crossings, ponds, \nsediment basins, and nutrient management practices just to name a few. \n \nUpon receipt of funding, NRCS state office will coordinate with the field office staff in the \nperspective counties to target implementation on agricultural lands within the watershed, giving \ncropland and pastureland the highest priorities.  A map depicting the landuse can be found in \nFigure 1.   \n \nElement d: Technical and Financial Assistance \n \nAs part of NWQI, NRCS will be providing all technical and financial assistance to landowners \nfor BMP implementation.  Provided below is an estimate of project BMP costs: \n \nCode Practice Units Cost \n \nEstimated \nUnits  Total \n314 Brush Management ac $44.70            500  $22,350.00 \n315 Herbaceous Weed Control  ac $113.27            500  $56,635.00 \n327 Conservation Cover  ac $452.43 \n         \n1,192  $539,296.56 \n328 Conservation Crop Rotation  ac $3.93 \n         \n1,192  $4,684.56 \n329 \nResidue and Tillage Management, No Till/Strip Till/Direct \nSeed  ac $14.85 \n         \n1,192  $17,701.20 \n338 Prescribed Burning ac $43.90 \n       \n13,261  $582,157.90 \n340 Cover Crop  ac $72.93 \n         \n1,192  $86,932.56 \n342 Critical Area Planting  ac $165.43              50  $8,271.50 \n350 Sediment Basin cuyd $4.03 \n       \n25,000  $100,750.00 \n\nBooths Creek-Bayou Pierre GY 2018 \n7 \n \nCode Practice Units Cost \n \nEstimated \nUnits  Total \n351 Water Well Decommissioning ft $122.48 \n         \n1,000  $122,480.00 \n356 Dike cuyd $3.66 \n         \n5,000  $18,300.00 \n362 Diversion ft $2.06 \n         \n1,000  $2,060.00 \n378 Pond cuyd $4.40 \n       \n17,500  $77,000.00 \n381 Silvopasture Establishment ac $316.33 \n         \n1,000  $316,330.00 \n382 Fence ft $2.27 \n       \n32,000  $72,640.00 \n386 Field Border  ac $430.93            200  $86,186.00 \n391 Riparian Forest Buffer  ac $346.61              50  $17,330.50 \n393 Filter Strip  ac $129.94              50  $6,497.00 \n410 Grade Stabilization Structure  no $11,980.66              25  $299,516.50 \n412 Grassed Waterway  ac $1,825.54              50  $91,277.00 \n430 Irrigation Pipeline ft $27.35 \n         \n1,000  $27,350.00 \n441 Irrigation System, Microirrigation ac $2,175.52              20  $43,510.40 \n442 Irrigation System, Sprinkler ea $34,762.34                2  $69,524.68 \n449 Irrigation Water Management ac $34.95            200  $6,990.00 \n468 Lined Waterway or Outlet sqft $6.04 \n         \n1,000  $6,040.00 \n484 Mulching ac $1,376.59              10  $13,765.90 \n511 Forage Harvest Management ac $19.53            200  $3,906.00 \n512 Forage and Biomass Planting ac $316.82            200  $63,364.00 \n516 Livestock Pipeline ft $1.65 \n         \n2,000  $3,300.00 \n528 Prescribed Grazing  ac $36.86 \n         \n2,951  $108,773.86 \n533 Pumping Plant BMP $1,385.92            215  $297,972.80 \n554 Drainage Water Management ea $62.68            200  $12,536.00 \n561 Heavy Use Area Protection sqft $2.96 \n       \n41,500  $122,840.00 \n578 Stream Crossing sqft $9.71 \n         \n1,000  $9,710.00 \n580 Streambank and Shoreline Protection ft $171.71            100  $17,171.00 \n587 Structure for Water Control in $394.96            100  $39,496.00 \n590 Nutrient Management ac $3.92 \n         \n1,400  $5,488.00 \n591 Amendments for the Treatment of Agricultural Waste ksqft $28.92            100  $2,892.00 \n595 Integrated Pest Management ac $111.33 \n         \n1,000  $111,330.00 \n600 Terrace ft $1.64            400  $656.00 \n607 Surface Drain, Field Ditch cuyd $1.59 \n       \n10,000  $15,900.00 \n612 Tree/Shrub Establishment ea $0.34 \n       \n40,000  $13,600.00 \n614 Watering Facility gal $2.55 \n         \n5,000  $12,750.00 \n\nBooths Creek-Bayou Pierre GY 2018 \n8 \n \nCode Practice Units Cost \n \nEstimated \nUnits  Total \n620 Underground Outlet ft $9.01 \n         \n1,000  $9,010.00 \n642 Water Well ft $21.24 \n         \n5,000  $106,200.00 \n644 Wetland Wildlife Habitat Management ac $7.34            812  $5,960.08 \n656 Constructed Wetland ac $8,327.17                2  $16,654.34 \n \nTotal \n   \n$3,675,087.34 \n \nIn  addition  to  these  costs,  provided  below  is  an  estimate  for  monitoring  and  education  and \noutreach  costs  for  watershed  plan  implementation,  administration,  and  watershed  plan  revision, \nas well as hosting and facilitating team meetings.   \n \nActivity         Estimated Cost \nEducation/Outreach         $10,000 \nMonitoring          $20,000 \n \nElement e: Information and Education` \n \nNRCS will have the lead in coordinating the information and education for this NWQI.  The \nMDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Booths Creek-Bayou Pierre watershed project by tailoring them to \naddress the sedimentation.  A positive approach is used to reach the full diversity of people in the \ncommunity with projects that foster a “sense of place”, a “sense of pride in community”, and a \nsense of the native plants, animals, and general ecology of their region, as well as, the history of \nthe community and a sense of economics.  Stakeholders and coordinators join together to \nparticipate in problem-solving, brainstorming, plan development, training workshops, festival \nevent planning, soil and water conservation field days, tree boards, poster, art and writing \nprojects and other activities that promote collaboration and ownership of the watershed, as well \nas, solutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/ post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nBooths Creek-Bayou Pierre watershed is listed below: \n \n Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n\nBooths Creek-Bayou Pierre GY 2018 \n9 \n \n Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Booths Creek-Bayou Pierre Watershed. \n  Watershed Harmony Mobile Classroom - for age’s kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n Storm Drain Marking - projects for scouts, environmental clubs, and citizen groups. \n “Train the Trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n \nElement f: Implementation Schedule \n \nIn the event of National Water Quality Initiative funding being awarded for this HUC 12 sub-\nwatershed plan, NRCS will: \n1. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.   \n2. Work with the Claiborne County SWCD, MSWCC, and MDEQ to inform landowners \nand operators within the watershed about the project and work to secure commitments \nfrom priority area landowners and operators who are willing to participate in the project.  \n3. Work to secure commitments from landowners in the priority areas within the sub-\nwatershed that are contributing significant pollutant loads.  All BMPs shall be installed in \naccordance with the guidelines developed in the latest edition of the NRCS Technical \nField Manual, or other approved guidelines.   \n4. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion and \nimplementation of an effective and efficient plan to monitor baseline water quality \nconditions in the watershed and track changes in water quality over time resulting from \nthe BMPs implemented through this project.   \n5. Conduct inspections of BMPs during construction. \n6. Collect relevant GPS coordinates of all installed BMPs and incorporate this information \ninto a GIS format.  All geospatial data shall be collected in a manner consistent with the \nFederal Geographic Data committee-endorsed standards.   \n7. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. \n8. Report measured or estimated nonpoint source pollutant load reduction, acreage affected, \npre-and post- site conditions, and GIS data using forms included in Attachment A and \nRUSLE2. \n\nBooths Creek-Bayou Pierre GY 2018 \n10 \n \nElement g: Milestones and Outcomes \n \nMilestone Outcome \nCoordinate with the MDEQ, MSWCC,  and the \nClaiborne Co. Soil and Water District to secure \ncommitments from priority area landowners in \nBooths Creek-Bayou Pierre watershed \nTarget priority areas for BMPs \nInitiate watershed monitoring  Baseline condition monitoring \nImplement BMPs BMP installation \nBegin education outreach activities  Education outreach events scheduled \nBegin monitoring to collect data on post-BMP \nwater quality \nPost-BMP Monitoring \nUse RUSLE2 on each BMP to compute soil \nsavings \nShow an annual soil savings for the \ninitiative \nUse Region 5 model on each BMP to show \nnutrient reduction \nShow an annual nutrient reduction for the \ninitiative \n \nGoal: Reduce the pathogen, sediment, and nutrient loads entering Bayou Pierre from agricultural \npractices in the Booths Creek-Bayou Pierre Watershed.   \n \nElement h: Load Reduction Evaluation \n \nAccording to the State of Mississippi Water Quality Criteria for Intrastate, Interstate, and \nCoastal Waters, Bayou Pierre is classified for Fish and Wildlife Use and Recreation.  As such \nwaters in this classification must meet the aquatic life designate use and the contact recreation \ndesignated use.  The narrative standard for aquatic life use is that waters shall be free from \nmaterials attributable to municipal, industrial, agricultural, or other dischargers producing color, \nodor, taste, total suspended solids, or other conditions in such degree as to create a nuisance, \nrender the waters injurious to public health, recreation, or to aquatic life and wildlife, or \nadversely affect the palatability of fish, aesthetic quality, or impair the waters for any designated \nuses.   The following thresholds will be used to measure compliance with water quality criteria:  \nParameter Threshold \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of 4.0 mg/L \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific \nConductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold less than 1500 \nmg/L \nE. coli Culturable e.coli should not exceed a geometric mean of 126 per 100 ml \n \n \n\nBooths Creek-Bayou Pierre GY 2018 \n11 \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements.  Mississippi uses a calibrated and verified index of biotic integrity to \nmake water quality assessment decisions.  This index, the Mississippi Benthic Index of Stream \nQuality (M-BISQ) was originally developed in 2000 and has undergone three recalibration \nefforts to refine the sensitivity of the index.  As part of the index development process, the state \nwas divided into unique bioregions.  Within each bioregion, the index has a defined attainment \nthreshold that is used to determine if the biological community measures collected at a site are \nrepresentative of good water quality that can support a balanced benthic macroinvertebrate \ncommunity.  If the score is above the attainment threshold for the bioregion, the site is assessed \nas attaining the aquatic life use designation.  Booths Creek-Bayou Pierre is in the South Bluff \nand West bioregions and the attainment thresholds are 55.7 and 43.7 respectively.  Along with \noverall MBISQ scores, the in-stream habitat surveys will also be used to determine change over \ntime.     \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Booths Creek-Bayou Pierre \nwatershed.   In the event data indicate little or no positive change, a Stressor Analysis will be \nconducted to determine if any new or additional stressors are preventing improvements to water \nquality.  If any new stressors are identified, the Watershed Implementation Team will identify \nfuture actions/activities to address those stressors. \n \nElement i: Monitoring \n \nPrior to BMP installation, water quality chemical and biological monitoring was conducted and \nwill serve as baseline data for the project along with any historical data available on streams in \nthe Booths Creek-Bayou Pierre watershed. Monitoring stations for Segment MS 602812 are \nshown in Figure 2.  MDEQ has collected biological data on Storm Creek and Booths Creek, both \ntributaries to Bayou Pierre.  Post-BMP monitoring locations will be selected using best \nprofessional judgment and will be targeted to reflect water quality downstream of BMP activity.  \nOnce BMP installation is complete, and there has been sufficient time for the stream to stabilize, \npost BMP monitoring will be initiated.  Post BMP monitoring will be conducted in a way that \nallows for comparison with the pre-implementation data.  Because recovery periods of streams \ncan be dependent on type and amount of BMPs installed, more than 1 year of post BMP data \nmay be needed to observe a change in water quality.  In some cases, it may take 5 or more years \nto see full benefits of BMPs. All data collection efforts will be conducted using trained personnel \nfollowing established Standard Operating Procedures and adhering to agency Quality Assurance \nprotocols.   \n\nBooths Creek-Bayou Pierre GY 2018 \n12 \n \n \n \nAppendix A: \nR5 Load \nEstimation \nForms \n \n \n\nBooths Creek-Bayou Pierre GY 2018 \n13 \n \n \n\nBooths Creek-Bayou Pierre GY 2018 \n14 \n \n \n\nBooths Creek-Bayou Pierre GY 2018 \n15 \n \n \n\nBooths Creek-Bayou Pierre GY 2018 \n16 \n \n \n\nBooths Creek-Bayou Pierre GY 2018 \n17 \n \n ",
  "metadata": {
    "id": "booths-creek-bayou-pierre-watershed-plan",
    "originalName": "Booths_Creek_Bayou_Pierre_Watershed_Plan_2017.pdf",
    "mergedFrom": [
      "booths-creek-bayou-pierre-watershed-plan-2017.json"
    ],
    "pageCount": 17,
    "mergedAt": "2025-10-02T06:41:26.603Z",
    "length": 21789
  }
}