{
  "id": "carmichael-creek-town-creek-9-key-element-plan-2019",
  "rawText": "\n\nCarmichael Creek – Town Creek Watershed  2019 \n1 \n \nCarmichael Creek 9 Key Element Watershed Plan \nHUC 031601020403 (MWS 8051) \nGY19 Project Area \nMay 2, 2019 \n \nElement a: Identification of Causes and Sources of Impairment \nThe Carmichael Creek-Town Creek Watershed is located just south of Tupelo, Mississippi (MS).  \nMost of the 26,002-acre watershed lies primarily within Lee County in northeast Mississippi and \nis part of the Tombigbee River Basin.  According to the 2011 National Land Cover Database \n(NLCD), the landuse in this watershed is comprised of approximately 36% (9379 acres) forestry, \n20 % (5319 acres) cropland, and 16% (4253 acres) pasture/grassland (Figure 1). \n \nThe water-use classification for streams in the Carmichael Creek - Town Creek Watershed, as \nestablished by Regulations for Water Quality Criteria for Intrastate, Interstate, and Coastal \nWaters (11 Miss. Admin. Code Pt. 6, Ch. 2), is Fish and Wildlife. Waters with this classification \nare intended for fishing and propagation of fish, aquatic life, and wildlife. Waters included in the \nFish and Wildlife Classification should also be suitable for secondary contact, which is defined \nas incidental contact with water including wading and occasional swimming.   \n \nThe largest water body in the Carmichael Creek-Town Creek Watershed is Town Creek and \nserves as the receiving stream for the majority of the drainage in the watershed.  Other named \nstreams include Carmichael Creek and Leeper Creek; both flowing into Town Creek.  The Town \nCreek Drainage Area (DA), segment MS013TE, has a long history with Mississippi’s Section \n303(d) List of Impaired Water Bodies.  This water body segment was initially listed as evaluated \non the 1996 Section 303(d) List as impaired for pesticides, nutrients, siltation, and organic \nenrichment (O.E.)/low dissolved oxygen (D.O.).  The entire drainage area was considered as an \n“evaluated” §303(d) listing versus a “monitored” listing as there were no water quality data to \nverify impairment status of the water bodies in the watershed.  The OE/Low DO impairment was \nlater removed from the 303(d) listing for Town Creek using monitoring data that showed the \nwater quality standards for DO were being attained in Town Creek.  \n \nThe Mississippi Department of Environmental Quality (MDEQ) has conducted statewide \nbiological monitoring using benthic macroinvertebrates as the indicator to develop a regionally-\ncalibrated Index of Biological Integrity (IBI) for wadeable streams. This index, known as the \nMississippi Benthic Index of Stream Quality (M-BISQ), was used in the biological assessment of \nthe State’s wadeable streams and rivers.  In 2012, Cowpenna Creek (805112), a tributary to \nCarmichael Creek and thence Town Creek, was assessed as biologically impaired and added to \nthe Section 303(d) List.  The stream name was corrected in 2014 to reflect Leeper Creek as the \nactual water body name.  Leeper Creek, segment 805112, remains on the list of impaired waters \nand is currently being scheduled for a stressor identification study to determine the cause of \nimpairment to the stream.  Once that study is completed, and a primary probable cause of \nimpairment is determined, a total maximum daily load (TMDL) will be developed for the \nidentified cause(s) of impairment. Once the stressor process and resulting TMDL is completed \nfor Leeper Creek, the watershed plan may be modified if new conservation practices are needed \nto address the impairment. Figure 1 shows the location of the impaired segments within the \nCarmichael Creek-Town Creek Watershed.  \n\nCarmichael Creek – Town Creek Watershed  2019 \n2 \n \n \n \nFigure 1: Landuse Distribution and Impaired Segments in Carmichael Creek - Town Creek Watershed\n\nCarmichael Creek – Town Creek Watershed  2019 \n3 \n \nThere are several TMDLs for Town Creek (MS013TE).  Although the full extent of the segment \nspreads beyond the Carmichael Creek-Town Creek watershed boundary, the TMDL allocations \napply to the segment of Town Creek that falls within the watershed.  Town Creek segment \nMS013TE has TMDLs developed for nutrients (total nitrogen and total phosphorus), sediment, \nDDT and toxaphene that have been submitted to the United States Environmental Protection \nAgency (USEPA) Region IV.  \n \nMississippi does not have water quality standards for allowable nutrient concentrations in \nstreams; however, MDEQ is currently working in conjunction with a Nutrient Technical \nAdvisory Group (TAG) on the development numeric nutrient criteria. According to the Nutrient \nTotal Maximum Daily Load for Town Creek (MDEQ, 2009), an annual concentration of 0.7 mg/l \nis an applicable target for total nitrogen (TN) and 0.10 mg/l for total phosphorus (TP) for water \nbodies located in ecoregion 65. MDEQ used these preliminary target values for TMDL \ndevelopment which are subject to revision after the development of numeric nutrient criteria.  \nDuring TMDL development, the Town Creek watershed evaluation indicated the impairment \nwas due to phosphorus and nitrogen from point and nonpoint sources. The estimated existing \necoregion concentrations indicate reductions of nitrogen and phosphorus can be accomplished \nwith installation of best management practices and reductions to point sources in the watershed.  \nTo meet the target nutrient concentrations, the TMDL calls for a Total Phosphorus (TP) \nreduction of 80% and Total Nitrogen (TN) reduction of 13%.  \n \nThere were 15 National Pollutant Discharge Elimination System (NPDES) regulated municipal \nand industrial wastewater treatment plants (WWTPs) evaluated as part of the TMDL \ndevelopment in the area included in the TMDL modeling exercise for nutrients (Town Creek \nWatershed Hydrologic Unit Code (HUC) 03160102).  The largest discharger in the TMDL area \nis the Tupelo Publically-owned Treatment Works (POTW).  As a result, the TMDL recommends \n13% reduction to the Tupelo POTW point source loading for TN and an 80% reduction of TP.   \nThere are no MS4 (Municipal Separate Storm Sewer System) permits within the TMDL area.  It \nshould be noted, of the 15 facilities identified in the TMDL, only 2 are located in the smaller \ndrainage that represents the Carmichael Creek – Town Creek Watershed (HUC 031601020403).  \nSee below for the facilities that are located in this watershed with NPDES permits that include \nlimits for TN and TP daily loading as pounds (lbs) per day and daily flow discharge shown as \nmillion gallons per day (MGD): \n \nTable 1: List of Permitted Facilities in Watershed with Nutrient Allocation \nFacility Permit Flow \nMGD \nTN Load \nlbs/day \nTP Load \nlbs/day \nMS Department of Wildlife, \nFisheries, and Parks, Tombigbee \nState Park \nMS0033464 0.0075 0.072 0.033 \nPlantersville POTW MS0020940 0.27 25.91 11.72 \n*The TMDL did not recommend TN and TP load reductions for these facilities. \n \nNon-point source (NPS) loading of nutrients in a water body results from the transport of the \npollutants into receiving waters by overland surface runoff, groundwater infiltration, and \natmospheric deposition. The two primary nutrients of concern are nitrogen and phosphorus. Total \nnitrogen is a combination of many forms of nitrogen found in the environment. Inorganic \n\nCarmichael Creek – Town Creek Watershed  2019 \n4 \n \nnitrogen can be transported in particulate and dissolved phases in surface runoff. Dissolved \ninorganic nitrogen can be transported in groundwater and may enter a water body from \ngroundwater infiltration.  Finally, atmospheric gaseous nitrogen may enter a water body from \natmospheric deposition.  Unlike nitrogen, phosphorus is primarily transported in surface runoff \nwhen it has been sorbed by eroding sediment. Phosphorus may also be associated with fine-\ngrained particulate matter in the atmosphere and can enter streams as a result of dry fallout and \nrainfall (USEPA, 1999).  However, phosphorus is typically not readily available from the \natmosphere or the natural water supply (Davis and Cornwell, 1988). As a result, phosphorus is \ntypically the limiting nutrient in most non-point source dominated rivers and streams, with the \nexception of watersheds which are dominated by agriculture and have high concentrations of \nphosphorus contained in the surface runoff due to fertilizers and animal excrement or watersheds \nwith naturally occurring soils which are rich in phosphorus (Thomann and Mueller, 1987). \n \nWatersheds with a large number of failing septic tanks may also deliver significant loadings of \nphosphorus to a water body. All domestic wastewater contains phosphorus which comes from \nhumans and the use of phosphate containing automatic dishwashing detergents.  \n \nThe implementation of best management practice (BMP) activities should reduce the nutrient \nload entering Town Creek. This will provide improved water quality for the support of aquatic \nlife in the water bodies, and will result in the attainment of the applicable water quality standards \n \nTown Creek has another TMDL entitled Total Maximum Daily Load Tombigbee River Basin \nDesignated Streams in HUC 03160102 (Town Creek) for Impairment Due to Sediment, (MDEQ, \n2006).  This TMDL was completed for clean sediment. The State of Mississippi Water Quality \nCriteria for Intrastate, Interstate, and Coastal Waters (11 Miss. Admin. Code Pt. 6, Ch. 2) \n(MDEQ, 2016) regulation does not include a numerical water quality standard for aquatic life \nprotection due to sediment. The narrative standard for the protection of aquatic life is sufficient \nfor justification of TMDL development, but does not provide a quantifiable TMDL target. The \ntarget for this TMDL is based on reference sediment yields developed by the Channel and \nWatershed Processes Research Unit (CWPRU) at the U.S. Department of Agriculture, \nAgricultural Research Service, National Sedimentation Laboratory (NSL). \n \nThe CWPRU developed reference sediment yields, or targets, for each level III ecoregion within \nMississippi.  These yields were derived from the empirical analysis of historical flow and \nsuspended sediment concentrations for stable streams in each level III ecoregion.  For the \nCarmichael Creek – Town Creek watershed, the estimated allowable range of sediment loads for \nstable streams is 0.0004 to 0.0018 tons per acre per day at effective discharge.  Also based on \nthis analysis, a range of unstable values was assigned to the listed waterbodies within HUC \n03160102 based on the level III ecoregion unstable stream values.  The unstable range is \nrepresentative of the existing loads that would be expected for water bodies within HUC \n03160102.  The unstable range for water bodies within HUC 03160102 is 0.002 to 0.054 tons per \nacre per day at the effective discharge.  The unstable yields are larger than the target yields; \ntherefore, a reduction is recommended for HUC 03160102.  Based on the ranges of stable and \nunstable yield values, a reduction of 77% to 97% is recommended in HUC 03160102. \n\nCarmichael Creek – Town Creek Watershed  2019 \n5 \n \n \nThere are 2 facilities in watershed with NPDES permits that include limits for Total Suspended \nSolids (TSS) loads and daily Flow discharge.  \n  \nTable 2: Permitted Facilities with TSS Limits \nFacility Permit \nFlow \nMGD \nTSS \n(lbs/day) \nMS Department of Wildlife, \nFisheries, and Parks, Tombigbee \nState Park \nMS0033464 0.0075 6 \nPlantersville POTW MS0020940 0.27 203 \n \nThe TMDL did not require a reduction in TSS at those facilities because the analysis determined \nthose sources provide negligible loadings of suspended solids to the receiving waters compared \nto wet weather sources (e.g., NPDES regulated construction activities and nonpoint sources). \nAlso, the TSS component of a NPDES permitted facility is different from the pollutant addressed \nwithin this TMDL. The TSS component of the permitted discharges is generally composed more \nof organic material, and therefore, provides less direct impact on the biologic integrity of a \nstream (through settling and accumulation) than would stream sedimentation due to soil erosion \nduring wet weather events. The pollutant of concern for the TMDL is sediment from landuse \nrunoff and in-channel processes.  \n \nAs of March 2003, discharge of storm water from construction activities disturbing more than \none acre must obtain an NPDES permit. The purpose of the NPDES permit is to eliminate or \nminimize the discharge of pollutants (sediment) from construction activities. Since construction \nactivities at a site are of a temporary, relatively short term nature, the number of construction \nsites covered by the general permit varies. The target for these areas is the same range as the \nTMDL target for the watershed. The wasteload allocation (WLAs) provided to the NPDES \nregulated construction activities will be implemented as BMPs as specified in Mississippi’s \nGeneral Stormwater Permits for Small Construction, Construction, and Phase I & II MS4 \npermits. Properly designed and well-maintained BMPs are expected to provide attainment of \nwater quality standards.  There are no MS4 permits within Tombigbee River Basin HUC \n03160102. \n \nSimilar to nutrients and other pollutants, NPS loading of sediment in a water body results from \nthe transport of the material into receiving waters by the processes of mass wasting, head cutting, \ngullying, and sheet and rill erosion.  Sources of sediment include:  agriculture, silviculture, \nrangeland, construction sites, roads, urban areas, mass wasting areas, gullies, and surface mining.  \nAs such, sediment serves as a transport vehicle for a myriad of other pollutants including toxics. \nThe DDT and toxaphene TMDL for Town Creek concluded these legacy pesticides as sediment-\nrelated pollutants subject to the implementation of the same best management practices to reduce \nsediment runoff as proposed in this watershed plan.  \n \nElement b: Expected Load Reduction \n   \nThe sediment TMDL developed for Town Creek (MS013TE) and applicable for waters within \nthe Carmichael Creek – Town Creek watershed concluded that yields would need to be reduced \n\nCarmichael Creek – Town Creek Watershed  2019 \n6 \n \nby 77-97% in order to reflect stable conditions.  The United States Department of Agriculture \n(USDA) Natural Resource Conservation Service (NRCS) has a list of approved BMPS to address \nsedimentation and this list will be used to identify candidate BMPs in Broken Pumpkin Creek \nwatershed. \n \nAt the time of nutrient TMDL development for Town Creek, and is presently the case, MDEQ \ndoes not have numeric nutrient criteria.  Nutrients were addressed through an estimate of a \npreliminary total phosphorous concentration target and a preliminary total nitrogen concentration \ntarget. Based on the estimated existing and target TN and TP concentrations, the TMDL \nrecommended a 13% reduction of the point and nonpoint TN loads and an 80% reduction of the \npoint and nonpoint TP loads entering the water body to meet the preliminary target of 0.70 mg/l \nTN and 0.10 mg/l TP.  The target values are subject to revision upon the adoption of numeric \nnutrient criteria or recommendations from the Nutrient Technical Advisory Group.   \n \nNon-point loading of nutrients and organic material in a water body results from the transport of \nthe pollutants into receiving waters by overland surface runoff, groundwater infiltration, and \natmospheric deposition. Unlike nitrogen, phosphorus is primarily transported in surface runoff \nwhen it has been sorbed by eroding sediment. \n \nThe NRCS has a list of approved BMPs to address nutrients and sedimentation.  This list will be \nused to identify candidate BMPs in the Carmichael Creek – Town Creek watershed. \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Association of Conservation Districts \n(MACD), the Mississippi Soil and Water Conservation Commission (MSWCC), the Natural \nResource Conservation Service (NRCS), and the local Soil and Water Conservation Districts \n(SWCDs) throughout the state.  These SWCDs are typically housed within USDA Service \nCenters co-located with NRCS offices.  These USDA Service Centers handle federal assistance \nprograms offered through the Farm Bill.  As part of these services, SWCD staff communicate \nregularly with the local landowners and operators within the watershed as they work to support \nsign-ups for Farm Bill initiatives.  Staff from MSWCC and the SWCD depend upon assistance \nfrom their NRCS partners in determining landowner interest in the watershed because they are \non the farms and in the fields with the landowners, understand the needs at the local level, and \nhave knowledge of the amount of unfunded applications for federal program assistance which \nmeet Section 319 eligibility requirements.   \n \nBased on their analysis, installation of the following BMPs would mitigate sediment issues in the \nCarmichael Creek – Town Creek watershed, helping the stream recover: fencing, watering \nfacilities, heavy use areas, stream crossings, ponds, sediment basins, establishment of permanent \nvegetation, forage and biomass planting, and nutrient management practices (lime and fertilizer).  \nAs stated above in Element a, much of the forest has recently been converted to pasture in this \nwatershed.  As such, BMPs will be prioritized for implementation in the newly converted pasture \nareas.  Factors considered for determining specific locations for the placement of BMPs included \nthe following attributes based upon best professional judgement: \n \n\nCarmichael Creek – Town Creek Watershed  2019 \n7 \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDL (i.e., “It is recommended that \nwater bodies within [the watershed] be considered a priority for streambank and \nriparian buffer zone restoration and any sediment reduction BMPs, especially for road \ncrossings, agricultural activities, and construction activities); \n4. Ease of showing effecti\n\nveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the grant period); \n \nUpon receipt of funding, MDEQ will coordinate with field staff from MSWCC in Lee County to \ntarget implementation in priority areas, then move to other areas as funds allow.  A map \ndepicting the landuse can be found in Figure 1.   Additional considerations for prioritization of \nBMPs include the positioning of BMPs with willing landowners; the increased likelihood for \nleveraging of in-kind services; and proximity to pollutant sources to receiving streams.    \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project who may contribute match include MSWCC, Lee County Soil and Water \nConservation District, NRCS, United States Geological Survey (USGS) for additional \nmonitoring, and/or local landowners and operators.  For project implementation, administration, \nmanagement, and watershed plan revision, as well as hosting and facilitating team meetings, \nMDEQ plans to work under a memorandum of agreement (MOA) with the MSWCC to \nimplement this project.  Project partners provided the funding amounts used to estimate costs for \nBMP installation.  Provided below is summary of estimated costs for potential BMPs and overall \nproject implementation: \n\nCarmichael Creek – Town Creek Watershed  2019 \n8 \n \n \nCost Estimate: Full Project Implementation: \n \nPractice Name Unit \nNo of \nUnits \nUnit Cost \nEstimated \nCost \nHerbaceous Weed Management ac 325 $64.80 $21,060.00 \nCover Crop ac 1000 $55.86 $55,860.00 \nCritical Area Planting ac 55 $483.84 $26,611.20 \nSediment Basin cu yd 4250 $3.34 $14,195.00 \nDiversion cu yd 9750 $2.40 $23,400.00 \nFence ft 20000 $2.22 $44,400.00 \nField Border ac 10 $631.20 $6,312.00 \nGrade Stabilization Structure ea 45 $15,000.00 $675,000.00 \nLand Clearing ac 20 $530.65 $10,613.00 \nForage and Biomass Planting ac 325 $109.48 $35,581.00 \nLivestock Pipeline ft 10000 $1.91 $19,100.00 \nPrescribed Grazing ac 500 $57.13 $28,565.00 \nHeavy Use Area Protection ft 15000 $3.23 $48,450.00 \nStream Crossing ft 3750 $11.07 $41,512.50 \nStreambank and Shoreline \nProtection \nft 6000 $198.60 $1,191,600.00 \nWatering Facility gal 5325 $2.81 $14,963.25 \nUnderground Outlet ft 5000 $5.39 $26,950.00 \n*Monitoring \n      \n$140,328.00 \n*Technical Assistance \n      \n$100,000.00 \n*Education/Outreach \n      \n$69,500.00 \n*Project Management, Implementation, \nCoordination, Plan Revision \n      \n$150,000.00 \nTotal Estimated Project Cost \n   \n$2,744,001 \n* -Denotes fields that are estimated upon five incremental funding cycles of the project  \n \nDue to the magnitude of this project, it will need to be incrementally funded.  In order to fully \naddress all suggested conservation needs in the watershed, this plan recommends funding be \nprovided in five (5) increments.  To maximize education and outreach activities and monitoring \nefforts, MDEQ plans to leverage with existing programs already allocated for funding where \npossible.  Below is the estimated budget for the first incremental funding (Phase 1) of this \nproject: \n\nCarmichael Creek – Town Creek Watershed  2019 \n9 \n \n \nCost Estimate: Phase 1 Implementation \n \nPractice Name Unit \nNo of \nUnits \nUnit Cost \nEstimated \nCost \nCritical Area Planting ac 15 $483.84 $7,257.60 \nSediment Basin cu yd 2550 $3.34 $8,517.00 \nDiversion cu yd 4445 $2.40 $10,668.00 \nFencing ft 3700 $2.22 $8,214.00 \nGrade Stabilization Structure ea 10 $15,000.00 $150,000.00 \nForage and Biomass Planting ac 100 $109.48 $10,948.00 \nStream Crossing ft 1500 $11.07 $16,605.00 \nStreambank and Shoreline \nProtection \nft 100 $198.60 $19,860.00 \nTank/Trough ea 3 $2,500.00 $7,500.00 \nUnderground Outlet ft 1000 $5.39 $5,390.00 \n*Monitoring \n      $74,328.00 \n*Technical Assistance \n      $20,000.00 \n*Education/Outreach \n      \n$13,900.00 \n*Project Management, \nImplementation, Coordination, Plan \nRevision \n      \n$30,000.00 \n     \nPhase 1 Estimated Project Cost \n   \n$383,187.60 \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor land-use categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Carmichael Creek watershed project by tailoring them to address the \nsedimentation.  A positive approach is used to reach the full diversity of people in the \ncommunity with projects that foster a “sense of place”, a “sense of pride in community”, and a \nsense of the native plants, animals, and general ecology of their region, as well as, the history of \nthe community and a sense of economics.  Stakeholders and coordinators join together to \nparticipate in problem-solving brainstorming, plan development, training workshops,  festival \nevent planning, soil and water conservation field days, tree boards, poster, art and writing \nprojects and other activities that promote collaboration and ownership of the watershed, as well \n\nCarmichael Creek – Town Creek Watershed  2019 \n10 \n \nas, solutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nCarmichael Creek watershed are listed below: \n \n  Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Dry Creek Watershed. \n  Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n Storm Drain Marking - projects for scouts, environmental clubs, and citizen groups. \n “Train the trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Carmichael Creek \nWatershed Implementation Team (WIT) will participate in a minimum of 3 face-to-face \nmeetings.  The purpose of these meetings is to provide updates on implementation activities, \neducation events and review and modify the watershed plan.  In concert with these WIT \nmeetings, and to incentivize stakeholder participation, project funding will be used to purchase \nfood and other refreshments for the WIT along with providing support for renting facilities in \nwhich to host those events.  In accordance with 41 CFR § 301-74.11, light refreshments, meals, \nand/or beverages are an allowable expense under Clean Water Act (CWA) Section 319, provided \na description of the agenda, purpose, location, costs, etc., are outlined in an approved 319 grant \nworkplan. The purpose of the meetings will be for updating the watershed plan, and hosting field \ndays to showcase the implemented BMPs for the public. At this time, the exact number of \nparticipants and locations are not known therefore costs have been estimated for the purposes of \nthis plan and will be updated. \n \nElement f: Implementation Schedule \n \nIn the event of a Section 319 NPS funding award from MDEQ to support implementation of this \nwatershed-based plan for this HUC 12 sub-watershed, MDEQ, along with support from the \nWatershed Implementation Team and Project Manager (where applicable), will: \n \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the roles, \ntasks, requirements, and milestones for project implementation. (Month 1) \n\nCarmichael Creek – Town Creek Watershed  2019 \n11 \n \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n3. Work with the Lee County SWCD, MSWCC, NRCS, and MDEQ to inform landowners \nand operators within the watershed about the project and work to secure commitments \nfrom priority area landowners and operators who are willing to participate in the project.  \n(Months 1-6) \n4. Work with the local SWCD, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that are \ncontributing significant pollutant loads.  All BMPs shall be installed in accordance with \nthe guidelines developed in the latest edition of the NRCS Technical Field Manual, or \nother approved guidelines.  (Months 1-36) \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion and \nimplementation of an effective and efficient plan to monitor baseline water quality \nconditions in the watershed and track changes in water quality over time resulting from \nthe BMPs implemented through this project.  (Plan Completion:  Months 1-2); \nImplementation:  Months 3-36) \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 13-36) \n7. Conduct inspections of BMPs during construction (Months 3-36) \n8. Coordinate with and support the local SWCD, MSWCC and NRCS in the collection of \nrelevant GPS coordinates of all installed BMPs and incorporate this information into a \nGIS format.  All geospatial data shall be collected in a manner consistent with the Federal \nGeographic Data committee-endorsed standards.  (Months 3-36) \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. (Months 3-36) \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data. (1-36) \n \nElement g:  Milestones and Outcomes \n \nMilestone Outcome Probable Completion Date \nCoordinate with the MDEQ, \nNRCS, MSWCC, USGS, and \nthe Lee Co. Soil and Water \nDistrict to determine priority \nareas that are contributing \nsignificant pollutant loads to \nCarmichael Creek Watershed \nTarget priority areas for \nBMPs \nMonths 1-2 \nEstablish Watershed \nImplementation Team to \nbegin refinement of \nWatershed \nBased Plan (WBP) for \nCarmichael Creek  \nWatershed \nEstablish WIT Months 1-2 \n\nCarmichael Creek – Town Creek Watershed  2019 \n12 \n \nInitiate watershed monitoring Baseline condition \nmonitoring \nCompleted using historical \ndata \nMeet with landowners and \ncooperators to secure \ncommitments  \nto install BMPs in priority \nareas  \nLandowner Commitment Months 1-6 \nEstablish routine meeting \nschedule for WIT to support \nWBP revision  \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 3-36 \nCoordinate with Landowners \nto  \n inspect BMPs that were \ninstalled \n using Section 319 funds \nBMP Inspection Months 3-36 \nBegin monitoring to collect \ndata on post-BMP water \nquality \nPost-BMP Monitoring Months 42-48 \nFinalize education and \noutreach plan scheduled \nEducation/Outreach events Months 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal:  Reduce the Nutrient and Sediment loads entering into the Carmichael Creek –Town \nCreek Watershed. \n \nElement h:  Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters do \nnot include a water quality standard applicable to aquatic life protection due to sediment. \nHowever, a narrative standard for the protection of aquatic life was interpreted to determine an \napplicable target for the Town Creek TMDL. The narrative standard is that waters shall be free \nfrom materials attributable to municipal, industrial, agricultural, or other dischargers producing \ncolor, odor, taste, total suspended solids, or other conditions in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to aquatic life and wildlife, \nor adversely affect the palatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses.  In lieu of numeric criteria for sediment and nutrients, the monitoring will be \nconducted to collect data on parameters that are considered surrogates for sediment (Total \nSuspended Solids, Total Suspended Sediment, turbidity) and nutrients along with conventional \nin-situ parameters generally measured to determine aquatic health (e.g. Dissolved Oxygen, pH, \nTemperature, Conductivity, Dissolved Solids) will also be obtained.  The following thresholds \nwill be used to measure compliance applicable with water quality criteria and/or target \nthresholds: \n\nCarmichael Creek – Town Creek Watershed  2019 \n13 \n \n \n     Table 3: Water Quality Thresholds for Carmichael Creek – Town Creek Watershed \nParameter Threshold \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of \n4.0 mg/L \nDissolved Oxygen % Sat ≥ 70% - ≤ 125% \npH 6.0 – 9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less than 1000 micromhos/cm \nDissolved Solids Monthly average less than 750 mg/L; instantaneous  \nthreshold  less than 1500 mg/L \nChemical Oxygen Demand 35 mg/L \nTotal Suspended Solids 65 mg/L \nTurbidity 75 NTU \nTotal Nitrogen 0.7 mg/L annual concentration (numeric threshold \nestablished by Nutrient TMDL for Town Creek \nTotal Phosphorus 0.10 mg/L annual concentration (numeric threshold \nestablished by Nutrient TMDL for Town Creek \nM-BISQ East Bioregion 71.6 Calibration 3 (Applicable to waters outside the \nMississippi Alluvial Plain) \n \n \nIn addition to chemical data, biological community data and in-stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements.  For freshwater wadeable streams, not including the Mississippi Alluvial \nPlain (i.e. Delta), Mississippi use a calibrated and verified index of biotic integrity to make water \nquality assessment decisions.  This index, the Mississippi Benthic Index of Stream Quality (M-\nBISQ) was originally developed in 2000 and has undergone three recalibration efforts to refine \nthe sensitivity of the index.  As part of the index development process, the state was divided into \nunique bioregions.  Within each bioregion, the index has a defined attainment threshold that is \nused to determine if the biological community measures collected at a site are representative of \ngood water quality that can support a balanced benthic macroinvertebrate community.  If the \nscore is above the attainment threshold for the bioregion, the site is assessed as attaining the \naquatic life use designation.   Along with overall MBISQ scores, the in-stream habitat surveys \nwill also be used to determine change over time.   \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the time \nframe identified in the workplan.  At the end of the project, data will be analyzed to determine if \nthe data indicate improvements to water quality in Carmichael Creek.  In the event data indicate \nlittle or no positive change, a Stressor Analysis will be conducted to determine if any new or \nadditional stressors are preventing improvements to water quality.  If any new stressors are \nidentified, the Watershed Implementation Team will identify future actions/activities to address \nthose stressors. \n \n\nCarmichael Creek – Town Creek Watershed  2019 \n14 \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation monitoring will be conducted to serve as a \nbaseline for the project.  Historical monitoring data are also used as baseline data where \navailable; however, no water quality monitoring has been conducted in Carmichael Creek.  Other \nhistorical monitoring data is available in the Town Creek watershed for Town Creek and Leeper \nCreek.  This varied water quality monitoring included water chemistry sample data (nutrients, \nsuspended solids, oxygen demand, etc.), in-situ water chemistry (i.e. pH, temperature, specific \nconductance, and turbidity), as well as biological community monitoring for benthic \nmacroinvertebrates and aquatic habitat assessment.  A list of this historical water quality \nmonitoring is provided in the table below, and their sample locations are shown in Figures 1 and \n2.  \n \nTable 4: Monitoring Stations in Carmichael Creek – Town Creek Watershed \nStation \nID \nWater  \nBody \nSampling \nYear (s)  \nAgency Project \nType \nWater \nChem \nIn-Situ Sonde Benthics \nand/or \nAlgal \n112B29 Town \nCreek \n2008 MDEQ MBISQ      X      X           X \n112B91 Leeper \nCreek \n2009 MDEQ MBISQ      X      X      X \n \nMonitoring locations for this project will be selected using best professional judgment and will \nbe targeted to reflect water quality downstr\n\neam of BMP activity.  Physical, chemical and/or \nbiological data will be collected and specific parameters will be selected for monitoring based on \nthe impairment cause being addressed by the BMP(s).  Once BMP installation is complete, and \nthere has been sufficient time for the stream to stabilize, post BMP monitoring will be initiated.  \nPost BMP monitoring will be conducted in a way that allows for comparison with the pre-\nimplementation data.  Because recovery periods of streams can be dependent on type and amount \nof BMPs installed, more than 1 year of post-BMP data may be needed to observe a change in \nwater quality.  In some cases, it may take 5 or more years to see full benefits of BMPs. All data \ncollection efforts will be conducted using trained personnel following established Standard \nOperating Procedures and adhering to agency Quality Assurance protocols.  \n\nCarmichael Creek – Town Creek Watershed  2019 \n15 \n \n \nFigure 2: Monitoring Stations and Impaired Segments in Carmichael Creek – Town Creek Watershed ",
  "metadata": {
    "id": "carmichael-creek-town-creek-9-key-element-plan-2019",
    "originalName": "carmichael-creek-town-creek-9-key-element-plan-2019.pdf",
    "mergedFrom": [
      "carmichael-creek-town-creek-9-key-element-plan-2019-1.json",
      "carmichael-creek-town-creek-9-key-element-plan-2019-2.json",
      "carmichael-creek-town-creek-9-key-element-plan-2019-3.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.610Z",
    "length": 37035
  }
}