{
  "id": "coldwater-river-watershed-plan-2013",
  "rawText": "\n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 1\nCOLDWATER RIVER \n WATERSHED IMPLEMENTATION PLAN \n \n \n \n \nDRAFT  \n \nApril 11, 2013 \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 2\nCOLDWATER RIVER \n WATERSHED IMPLEMENTATION PLAN \n \n \n \n \n \n \nPrepared for: \n \nMississippi Department of Environmental Quality \n \n \n \n \n \n \nPrepared by: \n \nDelta F.A.R.M. \nP.O. Box 257 \nStoneville, MS 38776 \n \n \n \n \n \n \nWith additional technical assistance from: \n \nColdwater River Watershed Implementation Team \nP.O. Box 276 \nStoneville, MS 38776 \n \nMississippi Department of Environmental Quality \nOffice of Pollution Control \nP.O. Box 20385 \nJackson, MS 39289 \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 3\nTable of Contents \nList of Tables .................................................................................................................. 4 \nList of Figures ................................................................................................................. 5 \n1.0 Introduction ............................................................................................................... 6 \n1.1 Mission and Goals ........................................................................................... 6 \n1.2 Watershed Implementation Team .................................................................. 6 \n2.0 Watershed Description .............................................................................................. 9 \n2.1  Geography ....................................................................................................... 9 \n2.2 Hydrology ........................................................................................................ 9 \n2.3 Land use ........................................................................................................ 10 \n2.4 Socioeconomics .............................................................................................. 11 \n2.5 Demographics ................................................................................................ 11 \n3.0 Interests and Concerns ............................................................................................. 12 \n3.1 Identifying Interests and Concerns .............................................................. 12 \n3.2 Sediment ........................................................................................................ 13 \n3.2.1 Locations Where Sediment is an Issue............................................................. 13 \n3.2.2 Cause .............................................................................................................. 13 \n3.2.3 Sources ........................................................................................................... 13 \n3.3 Nutrients ........................................................................................................ 14 \n3.3.1 Cause ................................................................................................................... 14 \n3.3.2 Sources ................................................................................................................. 14 \n3.3.3 Nonpoint Sources ................................................................................................. 14 \n3.3.4 Point Sources........................................................................................................ 15 \n3.4 Alluvial Aquifer Declines .............................................................................. 16 \n3.4.1 Cause ................................................................................................................... 16 \n3.4.2  Source ............................................................................................................. 16 \n4.0 Coldwater River MRBI Watershed Resources ......................................................... 17 \n4.1 Water Quality Standards .............................................................................. 17 \n4.2 Surface Water Quality .................................................................................. 18 \n4.3  TMDLs .......................................................................................................... 21 \n4.4 Groundwater Resources ............................................................................... 23 \n4.5 Fisheries, Plant, and Wildlife Resources ...................................................... 23 \n5.0 Conservation Practice Implementation..................................................................... 24 \n5.1 Goal ............................................................................................................... 24 \n5.2 Participants ................................................................................................... 24 \n5.3 Implementation ............................................................................................. 24 \n5.4 Implementation Budget ................................................................................ 28 \n6.0 Education Strategy .................................................................................................. 29 \n6.1 Goal ............................................................................................................... 29 \n6.2  Participants ................................................................................................... 29 \n6.3 Activities ........................................................................................................ 29 \n7.0 Evaluation ............................................................................................................... 31 \n7.1 Monitoring ..................................................................................................... 31 \n7.2 Plan Evaluation & Revision Procedure ......................................................... 33 \n8.0 References ............................................................................................................... 35 \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 4\n \n List of Tables \n \nTable 1. Priority Interests and Concerns in Coldwater River MRBI Watersheds  12 \n \nTable 2. Permitted point sources in the project area      15 \n \nTable 3. Water quality criteria for the Coldwater River Watershed    16 \n \nTable 4. Reported impairments from the EPA for the Coldwater Watershed  17 \n \nTable 5. 2002 303(d) listings for the Coldwater River Watershed    19 \n \nTable 6. Water Quality Standard        19 \n \nTable 7. Total Maximum Daily Load        19 \n \nTable 8. TMDL targets and land use calculations      21 \n \nTable 9. Projected Costs for Practice Implementation by Funding Source   27 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 5\n \nList of Figures \n \nFigure 1. Location of Coldwater River MRBI Watersheds within the State of MS  7 \n \nFigure 2. Impaired Segments of MRBI Coldwater River Watersheds   8 \n \nFigure 3. Coldwater River MRBI Watershed Land Use Map    10 \n \nFigure 4. Coldwater River Watershed Sample Sites (USDA NRCS 2012)   18 \n \nFigure 5. Coldwater River MRBI Watershed Project – Allen Site Map   24 \n \nFigure 6. Coldwater River MRBI Watershed Project – Shannon Site Map   25 \n \nFigure 7. Coldwater River MRBI Watershed Project – Boyd Site Map   26 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 6\n1.0 Introduction \n \n1.1 Mission and Goals \n \nThe mission of this Coldwater River Watershed Implementation Plan (WIP) is to develop a \nmore sustainable future for the resources, residences, and businesses located within selected \nHUC 12 watersheds by advancing on-the-ground conservation measures that address resource \nconcerns and ultimately achieve or exceed water quality parameters set forth by TMDLs.  \n \nThe goal of this plan is to provide guidance for implementing and evaluating conservation \npractices on select sites within the watershed in support of the Delta Nutrient Reduction Strategy \n(DNRS), the Mississippi River Basin Initiative (MRBI), and Delta Sustainable Water Resources \nTask Force (WRTF). \n \n1.2 Watershed Implementation Team \n \nMembers of the Coldwater River Watershed Implementation Team are listed below.  They \nrepresent various professional resource agencies and stakeholders that have been involved with \nproject activities in the MRBI watersheds.   \n \nAgency/Organization Members - Delta F.A.R.M., Delta Wildlife, FTN Associates, MS \nDepartment of Environmental Quality, MS Department of Wildlife, Fisheries, and Parks, MS \nFarm Bureau Federation, MS Soil and Water Conservation Commission, Mississippi State \nUniversity, The Nature Conservancy, Tunica County Soil and Water Conservation District, \nUSDA- NRCS, USDA-ARS National Sedimentation Laboratory, U.S. Army Corp of Engineers, \nU.S. Environmental Protection Agency, U.S. Geological Survey, and the Yazoo-Mississippi \nDelta Joint Water Management District \n \nStakeholder Members – Mike Boyd, Buddy Allen, Daniel Shannon \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 7\n \nFigure 1. Location of Coldwater River MRBI Watersheds within the State of Mississippi \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 8\nFigure 2.  Impaired Segments of MRBI Coldwater River Watersheds \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 9\n2.0 Watershed Description \n \n2.1  Geography \n \nThe Coldwater River MRBI watersheds drain approximately 415,000 acres of the Yazoo \nRiver basin in portions of Desoto, Tunica, Coahoma, Panola and Quitman counties in North \nWest Mississippi. Located in the northern most part of Mississippi the watershed is just minute’s \nfrom Southaven, one of that fastest growing communities in Mississippi. Several smaller \ncommunities in the watershed include; Walls, Robinsonville, Tunica, Jonestown, and Sledge.  \n \nThe watershed is underlain by Mississippi River alluvium. The topography of the watershed \nis primarily flat, with some ridge and swell topography provided by river terraces (MDEQ 2000). \nSoils in the Mississippi River Alluvial Plain physiographic region are primarily young soils \n(inceptisols) formed on alluvium, and range from mildly acidic to mildly alkaline. Soils in the \nwatershed (headwaters) are of Dundee (moderately to somewhat poorly drained fine sandy loam \nto silty clay loam) and Forestdale (somewhat poorly to poorly drained silty clay loam) series. \nThere are also heavier soils, predominately of Alligator and Sharkey series. These are poorly \ndrained clay soils.  The watershed is located in the Mississippi Alluvial Plain ecoregion. Native \nvegetation would consist of bottomland hardwood forests.  \n \n2.2 Hydrology \n \nThe Coldwater River flows for about 220 miles through Northwestern Mississippi. It flows in \na Southward direction from its headwaters near Hudsonville, Mississippi into Arkabutla Lake. \nThe River then flows from Arkabutla Lake to the Little Tallahatchie River.  \n \nThe MRBI Coldwater River Watersheds consist of the following 12 digit HUCs: \n \n Phillips Bayou (HUC#080302040900) \n Buck Island Bayou (HUC#080302040704) \n Lower Lake Cormorant Bayou (HUC#080302040705) \n Muddy Bayou (HUC# 080302041000) \n White Oak Bayou (HUC#080302040800) \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 10\n David Bayou (HUC#080302041101) \n Burrell Bayou (HUC#080302041103) \n Lower Coldwater River (HUC#080302041104) \n \nSurface water levels in the watershed are maintained by rainwater, the Mississippi River \nalluvial aquifer, and the Coldwater River and Arkabutla Lake. The advent of irrigation in the \n1970’s has lowered the water levels in the Mississippi River Alluvial Aquifer to the point that it \ndoes not maintain base flows even in the largest area rivers. Ground water withdrawals for \nagricultural use, primarily irrigation, are made from the alluvial aquifer and surface water, with a \nmajority coming from the alluvial aquifer. (USDA NRCS 2012). \n \n2.3 Land use \n \nHistorically, the area consisted largely of ridge and swale topography. However many of the \nagriculture fields in the area have been developed and improved by land forming and installing \ndrainage infrastructure. According to 2011 NAIP data, the pre-dominate land use is agriculture \nand crops include corn (7,000 ac), soybeans (21,475 ac), cotton (6,348 ac), milo (11,792 ac), \ncatfish (240 ac), and rice (9,060 ac).  Other land uses in the watershed are characterized by \nwetlands, small urban areas, water, and forest land.  \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 11\n \nFigure 3. Coldwater River MRBI Watershed Land Use map. \n \n2.4 Socioeconomics \n \nMany of the landowners and farmers of this watershed have demonstrated a progressive \nmindset. Producers in the watershed have a history of recognizing environmental concerns and \nvoluntarily addressing them through assistance programs such as EQIP, CRP, and WRP. \nStakeholders are informed and receptive of innovative conservation practices, such as those \nrequired to successfully reduce sediment and nutrient loading as well as those used for water \nquantity stewardship.  \n \n2.5 Demographics \n \nBased on 2010 Census data for Desoto, Coahoma, Panola and Quitman Counties, it is \nestimated that 24,000 people live in the watershed. Desoto County has seen population growth \nwhile the other counties have remained steady or declined in population.  \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 12\n3.0 Interests and Concerns \n \n3.1 Identifying Interests and Concerns \n \nFor the purposes of this project and the guiding WIP, interests and concerns were formulated \nthrough development of the Delta Nutrient Reduction Strategy.  Implementation of DNRS \nwatershed projects (such as this Coldwater MRBI Watershed Project) identified four questions to \naddress: \n1. What levels of nutrient reductions are achievable? \n2. What will they cost? \n3. What is the value to each stakeholder from these nutrient reductions? \n4. What levels of nutrient reductions will protect Delta water bodies and benefit the Gulf \nof Mexico?  \n \nGiven this, reducing nutrient and sediment runoff from agricultural sources are the primary \nconcerns to be addressed.  These concerns are directly reflected in the MS Soil and Water \nConservation Commissions proposed MRBI work plan for the watershed area.  Realizing the \nconnectivity between water quality and water quantity and the overlapping solutions, the Delta \nSustainable Water Resources Task Force was developed to address water resource concerns \nusing an integrated approach.  Therefore, declines in the alluvial aquifer are considered of \ninterest and in the scope of this WIP. \n \nTable 1.  Priority Interests and Concerns in Coldwater River MRBI Watersheds \nStatus \nDescription \nConcern: \nCause: \nLocation: \nExtent: \nSediment \nNonpoint source agricultural runoff due to erosion \nImpairment occurs in streams and lakes \nEntire watershed \nConcern: \nCause: \nLocation: \nExtent: \nNutrients \nNonpoint source agricultural runoff  \nImpairment occurs in  streams and lakes \nEntire Watershed \nConcern: \nCause: \nLocation: \nExtent: \nAlluvial Aquifer \nDeclining alluvial aquifer \nImpairment occurs in alluvial aquifer \nEntire Watershed \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 13\n3.2 Sediment \n \nStakeholders noted that sedimentation in ditches and streams helps contribute to flooding. \nThey also expressed concern that the presence of glyphosate resistant weeds in the watershed my \nresult in increased cultivation, which could increase erosion and sediment loads. The sediment \nTMDLs for these water bodies recommend that sediment loads to these water bodies be reduced \nto the range of 8.8E-02 to 2.4E-01 tons per acre per day at the effective discharge.  The reduction \nof sediment load in the Coldwater River watershed to equal that of a relatively stable stream will \nallow the river to approach stable conditions (MDEQ. 2003a).This reduction will provide \nimproved habitat for the support of aquatic life in the river and will result in the attainment of the \napplicable water quality standards. \n \n 3.2.1 Locations Where Sediment is an Issue \n Stakeholders identified drainage ditches and streams as places where sedimentation is an \nissue. MDEQ identified the segment that flows from the confluence of Cub Lake Bayou to the \nsplit with Pompey Ditch as areas where sediment was expected to be a water quality issue.  \n \n 3.2.2 Cause \n Sediment is the pollutant causing sedimentation and turbidity in these water bodies. \nSedimentation is created by erosion of soil particles in the watershed. Soils in the area tend to be \nfine grained which makes them more susceptible to erosion.  \n \n 3.2.3 Sources \n  There are National Pollutant Discharge Elimination System (NPDES) permits for Total \nSuspended Solids for the Coldwater River watershed. These sources however provide negligible \nloadings of sediment when compared to wet weather sources such as, Municipal Separate Storm \nSewer Systems and nonpoint sources. The TSS component of the permitted discharges is \ngenerally composed more of organic material, and therefore, provides less direct impact on the \nbiologic integrity of a stream than would stream sedimentation due to soil erosion during wet \nweather events. Nonpoint loading of sediment in a water body results from the transport of the \nmaterial into receiving waters by the process of mass wasting, head cutting, gullying, and sheet \nand rill erosion (MDEQ. 2003a). \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 14\n3.3 Nutrients \n \nThe WIT identified nutrients in runoff as a priority concern. MDEQ has determined that the \nstream section from Yazoo Pass to Pompey Ditch has a high probability of containing n\n\nutrients \nlevels detrimental to fish and other wildlife. High nutrient concentrations can support high \ngrowth of algae or other aquatic plants. When the algae die, their decomposition uses oxygen in \nthe water, which can result in low oxygen levels that are harmful to fish and other aquatic life. \nThe TMDLs for this stream section has been recommended for reductions of 95.0% phosphorous \nloads entering these water bodies to meet the preliminary target of 0.16mg/l. Based on the \nestimated existing and target total nitrogen concentrations, this TMDL recommends a 83.5% \nreduction of the nitrogen loads entering these water bodies to meet the preliminary target of 1.05 \nmg/l. (MDEQ 2008) \n \n 3.3.1 Cause \n Nitrogen and phosphorus are the pollutants that are suspected of causing eutrophic \nconditions in these water bodies with high productivity and low dissolved oxygen levels. Total \nnitrogen and total phosphorus are the species of these nutrients that were addressed in the \nTMDLs. (MDEQ 2008) \n \n 3.3.2 Sources \n Nutrient loads are primarily contributed by nonpoint sources in the watershed. However, \nthere are also 22 NPDES sources permitted to discharge into Coldwater River.  \n  \n 3.3.3 Nonpoint Sources \n Total nitrogen is a combination of the many forms of nitrogen found in the environment. \nInorganic nitrogen can be transported in particulate and dissolved phases in surface runoff. \nDissolved inorganic nitrogen can enter groundwater through infiltration, and may enter a water \nbody through groundwater seepage or discharge. Finally, atmospheric gaseous nitrogen may \nenter a water body through diffusion, and dissolved and particulate nitrogen species can enter \nthrough atmospheric deposition. \n \n Phosphorus is primarily transported in surface runoff when it has been sorbed to eroding \nsediment. Phosphorus may also be associated with fine-grained particulate matter in the \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 15\natmosphere and can enter stereos as a result of dry fallout and rainfall. Phosphorus may also be \ncontained in the surface runoff due to fertilizers and animal excrement or watersheds with \nnaturally occurring soils that are rich in phosphorus (Thomann and Mueller, 1987).  \n \n Watersheds with a large number of failing septic tanks may also deliver significant \nloadings of phosphorus to a water body. Phosphorus levels are also high in groundwater in the \nDelta, so phosphorus in surface waters can also come from groundwater seepage or discharge. \nUSGS has an ongoing sampling program to quantify the cause of phosphorus in ground water.  \n \n 3.3.4 Point Sources \n These point sources provide negligible impacts to the watershed and no changes are \nrequired in their permits due to the current TMDL (MDEQ 2008).   \n \nTable 2. Permitted point sources in the project area. \n  \nName \nNPDES \nPermit \nPermitted \nDischarge \n(cfs) \nActual Average \nDischarge (cfs)  \nActual Average \nBOD mg/L \nPermitted \nBOD mg/L \nActual \nNH3-N \nmg/L \nPermitted \nNH3-N mg/L \nBuck Island Bayou \nMGP MS0049123 0.063 0.29 5.33 30 NA NR \nUSACOE Arkabutla \nN Abutment MS0020656 0.021 0.002 2 30 NA NR \nAustin Trailer Park MS0051934 0.009 0.009 2.8 30 NA NR \nLake Forest S/D MS0034188 1.547 0.147 6.07 30 NA NR \nSkylane Trailer Park MS0037925 0.034 0.027 17.3 30 NA NR \nTwin Lakes #1 MS0022543 0.232 0.151 7.07 30 NA NR \nTwin Lakes #2 MS0029467 0.201 0.169 5.61 30 NA NR \nWilson Mill \nSubdivision MS0053830 0.019 0.002 5 30 NA NR \nComo POTW MS0030104 0.387 0.165 2.4 10 0.15 NR \nSam Minor \nHeadstart MS0045055 0.002 0.003 34.5 30 NR \nStrayhorn \nElementary  MS0035181 0.012 0.005 8 30 NA NR \nPride of the Pond, \n001 MS0039802 1.076 0.185 34.14 75 NA NR \nPride of the Pond, \n002 MS0039802 1.076 0.63 9.81 30 NA NR \nTunica Inudstrial \nPark MS0032786 0.093 0.211 11.7 30 2.3 2 \nTunica POTW MS0042323 0.68 0.33 26.4 30 NA NR \nWestgate Utilities MS0024261 0.081 0.074 33.56 30 NA NR \nDundee School MS0054798 0.015 0.211 8.06 10 NA NR \nCrenshaw POTW MS0026930 0.32 0.131 26.4 30 NA NR \nSledge POTW MS0021016 0.34 0.4 22 30 NA NR \nMarks POTW MS0024660 1.02 0.297 27.2 30 NA NR \nLula POTW MS0025151 0.068 0.046 23.3 30 2.54 2 \nFalcon POTW MS0036731 0.35 0.012 11.7 30 NA NR \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 16\n3.4 Alluvial Aquifer Declines \n \nGroundwater levels in the Coldwater River watershed have declined causing producers to \ndrill deeper wells to reach water. Deeper wells are less efficient to operate and thereby more \nexpensive. More efficient use of ground water supplies has become an important topic among \nstakeholders, along with water holding capacity and level Coldwater River and associated \nwaters. \n  \n 3.4.1 Cause \n Water is being withdrawn from the aquifer faster than it is being recharged.  \n \n 3.4.2  Source \n Irrigation accounts for the majority of the ground water withdrawals.\n\n \nColdwater River Watershed Implementation Plan - Draft \n4/11/13 \n \n 17\n4.0 Coldwater River MRBI Watershed Resources \n \n4.1 Water Quality Standards \n \nThe water use classification for all perennial surface waters of this watershed stated in \nthe Mississippi water quality regulations is Fish and Wildlife Support. The designated \nbeneficial uses for these waters are Aquatic Life Support (MDEQ 2003a).  Table 2 lists \nthe numeric water quality criteria applicable to the Coldwater River watershed perennial \nsurface waters (MDEQ 2002). \n \nTable 3. Water quality criteria for Coldwater River watershed. \nParameter Criteria \nDissolved Oxygen 5.0 mg/L daily average, 4.0 mg/L instantaneous \nPH Between 6.0 and 9.0 su \nTemperature 32.2 deg C \nFecal coliform May – October: geometric mean of 200 per 100 mL, 400 per \n100 mL less than ten percent (10%) of the time during a 30 \nday period. \nNovember – April: geometric mean of 2000 per 100 mL, \n4000 per 100 mL less than ten percent of the time during a \n30 day period. \nSpecific conductance 1000 uohms/cm \nDissolved Solids 750 mg/L monthly average, 1500 mg/L instantaneous \n \nMississippi’s water quality standard for sediment is a narrative and reads as follows: \n“Waters shall be free from materials attributed to municipal, industrial, agricultural or \nother discharges producing color, odor, taste, total suspended or dissolved solids, \nsediment, turbidity, or other conditions in such degree as to create a nuisance, render the \nwaters injurious to public health, recreation or to aquatic life and wildlife or adversely \naffect the palatability of fish, aesthetic quality, or impair the waters for any designated \nuse” (MDEQ 2002). \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft \n4/11/13 \n \n 18\n4.2 Surface Water Quality \n \nSurface waters in the Coldwater watershed are generally, high in turbidity December \nthrough April from the high sediment runoff leaving agricultural fields. It is common \npractice to work land in the fall and in dry Februaries in anticipation of a wet spring. \nTurbidity usually declines in the summer and fall due to decreased erosion as crops cover \nthe fields and due to lower fall rainfall (USDA NRCS 2012).  \n \nPesticides are found in surface waters during the agricultural season. There are no \ncurrent use pesticides that are at levels of concern. However; DDT was used extensively \nin this area both on crops and for mosquito control and can be found in sediments and in \nlarge, older fish, especially gar, buffalo, and carp.(USDA NRCS 2012) As stated before \nAll surface waters in the Coldwater Watershed are under fish consumption advisories due \nto the continued presence of DDT and Toxaphene in fish tissues.  \n \nTable 4. Reported impairments from the EPA for the Coldwater Watershed \n \n \n(USDA NRCS 2012) \nTotal Number of Impairments Reported: 48 \n \nWater quality monitoring has been going on since the early 2000’s. Sites were first \nchosen by the Tunica County Soil and Water Conservation District at locations they felt \nwould be most influenced by their implementation of conservation and water quality \n01234567891011\nSedimentation\nPesticides\nNutrients\nOrganic Enrichment/Low Do\nBiological Impairment\nCause Unknown\nSalinity/TDS/Chlorides\nImpairment Reported \nSedimentation\nPesticides\nNutrients\nOrganic Enrichment/Low Do\nBiological Impairment\nCause Unknown\nSalinity/TDS/Chlorides\n\n \nColdwater River Watershed Implementation Plan - Draft \n4/11/13 \n \n 19\nBMPs (YMD 2008). Sites were located on Buck Island Bayou, Walnut Lake, Phillip’s \nBayou, McKinney Bayou, Six Mile Lake, and Yazoo Pass. Later, data were taken at the \nsame locations as Jack Kilgor and Jan Hoover’s ERDC Fish IBI sampling sites to help \nbetter characterize seasonal water quality (Hoover & Kilgore 2003). These samples \nincluded laboratory and insitu measurements. \n \n \nFigure 4. Coldwater River Watershed Sample Sites (USDA NRCS 2012) \n\n \nColdwater River Watershed Implementation Plan - Draft \n4/11/13 \n \n 20\nThe Coldwater River watershed has been evaluated as impaired and is included on the \nMississippi 303 (d) List (MDEQ 2004a). Table 4-6 summarizes the listings from the 2002 \n303(d) List.  \n \nTable 5. 2002 303(d) listings for the Coldwater River Watershed \nName ID County  HUC Cause Mon/Eval \nColdwater \nRiver  MSCOLDR2M2 \nDesoto, Tate, \nTunica 8030210 Sediment/Siltation Monitored  \nAt Pritchard: From confluence with Cub Lake Bayou to split with Pompey Ditch above Sara  \n \nColdwater \nRiver  MSCOLDR2E \nDesoto, Tate, \nTunica 8030204 Sediment/Siltation Evaluated \nAt Coldwater River: From Spillway Arkabutla Reservoir to confluence with Pompey Ditch \n \n \n \nTable 6. Water Quality Standard \nParameter Beneficial Use Narrative Water Quality Criteria \nSediment/Siltation \nAquatic Life \nSupport \nWaters shall be free from materials attributable to municipal, \nindustrial, agricultural, or other dischargers producing color, \nodor, taste, TSS, or other conditions in such a degree as to create \na nuisance, render the waters injurious to public health, \nrecreation, or to aquatic life and wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses. \n \n \nTable 7. Total Maximum Daily Load \nSegment WLA LA MOS TMDL \nMSCOLDR2M2 \n8.8E-02 to \n2.4E-01* 8.8-02 to 2.4E-01* implicit 8.8E-02 to 2.4E-01 \nMSCOLDR2E \n8.8E-02 to \n2.4E-02* 8.8-02 to 2.4E-02* implicit 8.8E-02 to 2.4E-02 \n*tons per acre per day at the effective \ndischarge  \n   \n \n \n \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft \n4/11/13 \n \n 21\n4.3  TMDLs \n \nNonpoint sources of sediment (due to erosion) are the primary sources of concern. \nSources identified in the TMDL include agriculture, aquaculture, and the natural \nlandscape of which ridge and swell topography is common. Wet weather conditions are \ncritical for sediment loading to the water bodies. The target measure of sediment \nretention would reduce sediment yields to a range of 8.8E-02 to 2.4E-01 tons per acre per \nday. \n \nThe TMDL also addresses organic enrichment and low dissolved oxygen listings for \nThe Coldwater River on the Mississippi 2006 Section 303(d) List of Impaired Water \nBodies. There are currently no numerical criteria for nutrient concentrations in \nMississippi surface waters. MDEQ currently has a Nutrient Task Force working on the \ndevelopment of nutrient criteria. An annual concentration of 1.05mg/l is an applicable \ntarge for TN and 0.16mg/l for TP for water bodies located on the west side of the Delta \n(TMDL for Yazoo River Basin Tunica and Coahoma Counties 2008). These numbers \nmay be revised after the development of nutrient criteria by the NTF. Nonpoint organic \nsources are considered to be the primary source of oxygen demand in the Coldwater \nsystem. The TMDL calls for a 95.0% reduction of the phosphorus loads entering these \nwaterbodies to meet the preliminary target of 0.16mg/l. Based on the estimated existing \nand target total nitrogen concentrations, this TMDL recommends an 83.5% reduction of \nthe nitrogen loads entering these water bodies to meet the preliminary target of 1.05mg/l \n \n \n  \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 22\nTable 8. TMDL targets and land use calculations.\nWater \nBody \nColdwater \nRiver Water Urban Barren Forest Pasture/Grass Cropland Wetland Total \nAcres 260.9 641.8 0 45.1 0 14618.5 3787.6 19353.9 \nLanduse TN KG/Mile² Percent 1.30% 3.30% 0.00% 2.00% 0.00% 75.50% 5.90% 100.00% \nForest 111.3 Miles² in watershed 0.41 1 0 0.07 0 22.8 5.9 30.2 \nPasture 777 Flow cfs based on area 44.2 cfs \nCropland 10956.2 \nUrban 287.8 TN Load kg/mi² annual avg 259.0 287.8 111.3 777.0 10956.2 259.0 \nWater 259 TP Load kg/mi² annual avg 259.0 4.3 61.3 61.3 1295.0 5490.9 259.0 \nWeltand 259 \nAquaculture 2590 TN Load kg/day 29.00 0.79 0.00 0.02 0.00 684.39 4.19 689.70 \nTP Load kg/day 0.29 0.01 0.00 0.01 0.00 342.99 4.19 347.50 \nLanduse TP kg/Mile²  \nForest 60.3 TN target concentration 1.05 mg/l \nPasture 1295 TP target concentration 0.16 mg/l \nCropland 5490.9 \nUrban 4.3 TN target load 250.3 lbs/day \nWater  259 TP target load 38.2 lbs/day \nWetland 259 \nAquaculture 2590 TN estimated load per day 1517.3 lbs/day \nTP estimated load per day 764.5 lbs/day \nTN estimated concenteration 6.36 mg/l \nTP estimated concenteration 3.21 mg/l \nTN reduction needed 83.50% The land use calculations are based on 2004 data.  \nTP reduction needed 95.00% The nutrient estimates are based USDA ARS. The TMDL \ntargets are based on EPA guidance for calculations \nof targets when considering all available data. \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 23\n4.4 Groundwater Resources \n \nThe majority of drinking water use in this watershed is supplied by groundwater from the \ndeep aquifer. The majority of agricultural water use in this watershed is supplied by groundwater \nfrom the shallow alluvial aquifer. No issues have yet been raised with regard to the quality of \ngroundwater in this watershed. Declining groundwater levels in the alluvial aquifer are an issue \nin the watershed (MDEQ 2000). \n \n4.5 Fisheries, Plant, and Wildlife Resources \n \nA few federally threatened species may occur within the watershed. These are Least tern \n(Sterna antillarum), Pallid sturgeon (Scaphirhynchus albus), Fat pocketbook (Potamilus capax), \nand although not federally the state of Mississippi has listed the Bald Eagle (Haliaeetus \nleucocphalus). All water bodies in the Delta, including those in the Coldwater River watershed, \nwere placed under fish consumption advisory in 2001 for the legacy pesticides DDT and \nToxaphene.  As previously listed the fish covered by the advisory were carp, buffalo, gar, and \nnon-farm raised catfish over 22 inches (MDEQ 2001). \n \nSince 1985, bottomland wetland and forest habitats have been restored in the watershed \nthrough USDA Farm Bill Programs such as CRP and WRP.  A small percentage of the \nwatershed has been restored to bottomland hardwood forests in the past 25 years using these \nfederal cost-share programs. Because of increased forest lands and a moderate amount of natural \nwetlands, the Coldwater River watershed has fair populations of numerous consumptive wildlife \nspecies such as white-tailed deer, migratory waterfowl, and small game.   \n \nFishing and hunting both take place in the watershed. Hunting primarily takes place on \nprivate land and includes deer, waterfowl and small game hunting. Moon Lake is a popular \nrecreational lake within the watershed. The lake has experience reduced fishing opportunity due \nto its impairment from sedimentation. Several projects have been proposed or completed \nadjacent to Moon Lake in order to stabilize and improve the fisheries and overall health and \nrecreational value of the lake.  \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 24\n5.0 Conservation Practice Implementation \n \n5.1 Goal \n \nThe goals of the following implementation actions are to: \n1. Improve water quality in local water bodies  \n2. Improve water quality in downstream receiving waters \n3. Through monitoring and evaluation, provide answers to questions outlined in the \nDelta Nutrient Reduction Strategy. \n \n5.2 Participants \n \nAgencies/Organizations - Delta F.A.R.M., Delta Wildlife, FTN Associates, MS Department of \nEnvironmental Quality, MS Department of Wildlife, Fisheries, and Parks, MS Farm Bureau \nFederation, MS Soil and Water Conservation Commission, Mississippi State University, The \nNature Conservancy, Tunica County Soil and Water Conservation District, USDA- NRCS, \nUSDA-ARS National Sedimentation Laboratory, U.S. Army Corp of Engineers, U.S. \nEnvironmental Protection Agency, U.S. Geological Survey, and the Yazoo-Mississippi Delta \nJoint Water Management District \nProducers – Buddy Allen, Mike Boyd, Daniel Shannon \n \n5.3 Implementation  \n \nConservation practices are to be implemented on three project sites as identified in Figures 7-\n9.  Practices to be implemented include: \n \n tail-water recovery systems (two systems) \n land leveling (905 acres) \n water control structures (30) \n low grade weirs (2) \n two-stage ditch (3,850 linear feet) \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 25\nThese practices address the three primary resource concerns of sediment/nutrient runoff and \nthe declining alluvial aquifer.  \n \nFigure 5. Coldwater River MRBI Watershed Project - Allen Site Map \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 26\n \nFigure 6. Coldwater River MRBI Watershed Project – Shannon Site Map \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 27\n \nFigure 7. Coldwater River MRBI Watershed Project – Boyd Site Map \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 28\n5.4 Implementation Budget \n \nFunding for implementation of these conservation practices is provided by: \n \n Producers – Buddy Allen, Mike Boyd, Daniel Shannon \n USDA Natural Resource Conservation Service – Mississippi River Basin Initiative, \nCooperative Conservation Partnership Initiative, Agricultural Watershed \nEnhancement Program, and th\n\ne Environmental Quality Incentives Program  \n Mississippi Department of Environmental Quality – U.S. Environmental Protection \nAgency 319 program. \n \nTable 9.  Projected Costs for Practice Implementation by Funding Source \nPractice Producer NRCS EPA-MDEQ Total \nTail-water Recovery Systems   $  112,500   $  501,090   $   110,850    \nLand Leveling with Pads  $  262,500   $  378,750   $               -      \nWater Control Structures  $  117,300   $    67,300   $      55,000    \nLow Grade Weirs  $    26,250   $             -     $      10,000    \nTwo-Stage Ditch  $    11,400   $             -     $      39,150    \nTotals  $  529,950   $  947,140   $   215,000   $  1,692,090  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 29\n6.0 Education Strategy \n \n6.1 Goal \n \nThe overall objective of the education strategy in the Coldwater River MRBI watersheds is to \ndevelop an atmosphere that promotes sustained, long-term protection and improvement of \nnatural resources in the watershed. Specific objectives of education efforts in the watershed \ninclude the following: \n \n Increase farmer and landowner awareness of the value of clean water and their \nresponsibility to insure others downstream have clean water. \n Increase farmer and landowner knowledge of programs that offer financial and/or \ntechnical assistance to plan, design, and/or install BMPs to improve water quality.   \n Increase producer awareness of how BMPs can be used to reduce negative water quality \nand habitat affects. \n Increase producer awareness of the long term environmental and economic advantages of \nprotecting and improving water quality and habitat. \n \n6.2  Participants \n \nAgencies/Organizations - Delta F.A.R.M., Delta Wildlife, FTN Associates, MS Department of \nEnvironmental Quality, MS Department of Wildlife, Fisheries, and Parks, MS Farm Bureau \nFederation, MS Soil and Water Conservation Commission, Mississippi State University, The \nNature Conservancy, Tunica County Soil and Water Conservation District, USDA- NRCS, \nUSDA-ARS National Sedimentation Laboratory, U.S. Army Corp of Engineers, U.S. \nEnvironmental Protection Agency, U.S. Geological Survey, and the Yazoo-Mississippi Delta \nJoint Water Management District \n \nProducers – Buddy Allen, Mike Boyd, Daniel Shannon \n \n6.3 Activities \n \nEducation and outreach activities have been outlined through ongoing efforts with the Delta \nNutrient Reduction Strategy and the Delta Sustainable Water Resources Task Force. In 2012, \nmultiple surveys were conducted of regional stakeholders and the general public.  These results \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 30\nare currently guiding the development of an Education and Outreach Strategy for the WRTF.  \nOnce the strategy is complete, recommended activities will be incorporated into this WIP. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 31\n7.0 Evaluation \n \n7.1 Monitoring \n \nThe monitoring design will be implemented by Mississippi State University and MDEQ at \ntwo tiers within the Coldwater Watershed: Tier 1 is edge of field monitoring, and Tier 2 is small \nsub-watershed scale monitoring. The monitoring design will address: \n \n Nutrient reductions within primary, channelized headwater streams in identified \nwatersheds (<200ac) \n Reduction efficiency estimates for individual BMPs based on above and below BMP \nsampling (i.e., tailwater recovery, water storage systems) \n Load reductions, and hydrological modifications as a result of BMP implementation \nThis data collection and evaluation effort is focused at evaluating BMP structures within the \nColdwater watershed that have the ability to reduce nutrient concentrations, as well as document \nthe conservation benefits of water management. These structures include edge of field structures \n(pads and pipes – slotted, flashboard), improved drainage channels fitted with 2-stages design, \nlow grade weirs, and surface water conservation management strategies including tailwater \nrecovery systems and/ or reservoirs. Depending on the structure and placement within the \nlandscape evaluation will take occur for: sediments, nutrients and hydrology.  The project will \nbegin October/November 2012 and extend to September 30, 2015. Thereafter, evaluation and \ncontinuous data collection will be based on additional, as yet un-determined funding sources.  \nListed below are the monitoring protocols for the specific parameters being evaluated within the \nproject. \n \nMonitoring Design: Parameters, treatments, assumptions, and protocols \nParameters: \n1. Nutrients (inorganic and total) \n2. Sediments (tied to turbidity/TSS in water) \n3. Water HRT / volume and water levels \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 32\nSampling Protocol for all parameters:  \n1. Non-stormflow / Grab – every 3 weeks during a 8 month growing season (March-\nOctober); every 6 weeks over 3 months (November – February) \na. Sediment accumulation \nb. Water level \nc. Physicochemical parameters (In Situ parameters – DO, pH, ORP, specific \nconductivity, temperature) \nd. Water samples \n  \n2. Stormflow – storm event driven (typically between 8-17 per year) \na. Water samples \nb. Physicochemical parameters (deployed data-sondes) \nWater Sample Preservation: \nPreservation techniques for nutrient analysis will be commensurate with QAQC procedures \noutlined in QAPP with MDEQ and USGS. Water samples will be collected with 24-48 hours of \nstorm events and all samples will be analyzed within the MDEQ lab in 48 hours. If preservation \nis required field crews will have the ability to acid preserve. Add ratio of 2ml:1L of concentrated \nH\n2\nSO\n4\n to water sample to preserve, and keep at 4°C.  \n \nAdditional Data Collection Efforts \n1. Sediments \na. Interested to identify sediment deposition and accumulation in behind slotted pipes, \nlow-grade weirs and tailwater recovery systems. \nb. Interested to evaluate phosphorus load accumulated with sediment accumulation. \n \nAssumptions: \n Sediment accumulating within the system is sediment that is not accumulating in downstream \necosystems \n Improved sedimentation will result in a decrease in turbidity and total suspended solids in \ndownstream aquatic systems \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 33\n Controlled drainage structures reduce the velocity and flow rate of non-storm and storm flow \nthus increasing sedimentation and reducing scour. \n \n2. Water Volumes, HRT, water levels \na. Interested in determining the effects of slotted pipes and low-grade weirs on water \nvolumes, levels and flow rates \nb. Important information for NRCS – how much water is being captured throughout \nthe year within tailwater recovery and on-farm storage reservoirs \nc. Water levels = real time data loggers, as well as level loggers \nd. HRT and Volumes = survey and geometry \n \nAssumptions: \n Control structures will reduce outflow volumes by increasing the volume of water that is \nretained within the ditch at any one time \n Control structures will increase non-storm flow HRT, and improve first flush capture of \ncontaminants for storm events that are intense and short in duration \n Improved HRT will facilitate improved sedimentation \n Weir structures will hold water according to height and volume characteristics \n Tailwater recovery units and on-farm storage reservoirs increase the amount of surface runoff \ncapture \n7.2 Plan Evaluation & Revision Procedure \n \nThrough the evaluation process, MDEQ will prepare a revised watershed implementation \nplan incorporating the changes requested by the reviewers. At this point it may be necessary to \ncall a meeting to reconcile any conflicting comments or requests for change. \n \nIf the evaluation criteria are all being met in Coldwater River surface waters, the watershed \nimplementation plan will be revised to address a different restoration issue or issues, or to protect \nthe quality of the watershed. If the evaluation criteria are not being met, the approach for water \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 34\nquality improvements in the Coldwater River watershed will be revised based on knowledge that \nhas been gained since 2013. \n  \nThe draft watershed implementation plan will be submitted to the Implementation Team, and \nall others who submitted comments. Within two weeks of receiving the draft watershed \nimplementation plan, the Implementation Team will notify their stakeholders of the availability \nof the revised watershed implementation plan for stakeholder review. One month will be allowed \nfor review of the draft. Comments will be due at the end of this review period. \n \nWithin a month after the comments on the draft watershed implementation plan are received, \nMDEQ will prepare a final watershed implementation plan. The final watershed implementation \nplan will be submitted to the Implementation Team for review and approval. After the final \nwatershed implementation plan has been approved, the Implementation Team will notify their \nstakeholders of the completion and availability of the final plan for use as a guide to \nimprovement activities. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \nColdwater River Watershed Implementation Plan - Draft 4/11/13 \n \n 35\n8.0 References \n \nKilgor, Jack., Hoover, Jan., 2003. ERDC, Vicksburg, MS \n \nMDEQ. 2000. Yazoo Basin Status Report. Mississippi Department of Environmental Quality. \nJackson, Mississippi. \n \nMDEQ. 2001. Mississippi’s Fish Tissue Advisories and Commercial Fishing Bans, August 2002.  \n \nMDEQ. 2002. State of Mississippi Water Quality Criteria for Intrastate, Interstate and Coastal \nWaters. Mississippi Department of Environmental Quality. Jackson, Mississippi. \n \nMDEQ. 2003a. Sediment TMDL for the Coldwater River, Yazoo River Basin. Mississippi \nDepartment of Environmental Quality. Jackson, Mississippi. \n \nMDEQ 2008 Total Maximum Daily Loads for Total Nitrogen, Total Phosphorus, and Organic \nEnrichment/Low Dissolved Oxygen for a Segment of the Coldwater River. \n \nMDEQ. 2003b. Total Maximum Daily Loads for the Legacy Pesticides DDT and Toxaphene in \nthe Yazoo River Basin. Mississippi Department of Environmental Quality. Jackson, Mississippi. \n \nMDEQ 2004a. Mississippi 2002 Section 303(d) List of Water Bodies. Mississippi Department of \nEnvironmental Quality. Jackson, Mississippi. \n \nThomann, R.V. and J.A. Mueller. 1987. Principles of Surface Water Quality Modeling and \nControl. Row, New York. \n \n \nUSDA Natural Resources Conservation Service. 2012. Water Quality Supplement to the \nColdwater Watershed Feasibility Study. Jackson, MS.  \n \nYazoo Mississippi Joint Water Management District. 2008. Coldwater River Watershed Project \nHistory and Status: February 2008. Stoneville, MS. \n \n ",
  "metadata": {
    "id": "coldwater-river-watershed-plan-2013",
    "originalName": "coldwater-river-watershed-plan-2013.pdf",
    "mergedFrom": [
      "coldwater-river-watershed-plan-2013-1.json",
      "coldwater-river-watershed-plan-2013-2.json",
      "coldwater-river-watershed-plan-2013-3.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.626Z",
    "length": 46899
  }
}