{
  "id": "fannegusha-creek-watershed-plan",
  "rawText": "\n\nFannegusha Creek \nWatershed Implementation \nPlan \n \n \n \n \n \n \nFinal Draft \n\n 2 \nFannegusha Creek Watershed \n Implementation Plan \n \n \n \nPrepared for: \n \nPearl River/South Independent Streams Basin Team \nMississippi Department of Environmental Quality \n \n \n \n \n \nDeveloped by:  \n \nFannegusha Creek Watershed Implementation Team \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 3 \nTable of Contents \n \nI. Executive Summary             6 \n \nII. Vision Statement          8 \n \nIII. Mission Statement             8 \n \nIV. Watershed Implementation Team          9 \n \n V. Watershed Description         10 \n  \nVI. Stakeholder Interests          13 \n \nVII. Water Resources         14 \n     A.  History of Activity in the Watershed       14 \n     B. Wildlife and Fisheries        14 \n     C. Designated Use classifications and Water Quality Standards    15 \n     D.  Current Status of Waterbodies in the Watershed    15 \n     E. TMDLs           16 \n \nVIII. Watershed Management Actions         17 \n      A. Sediment             17 \n       1. Stakeholders Interests         17 \n       2. Goals/Objectives         17 \n       3. Management Actions          17 \n       4.  Project Tracking/Assessment of Progress       18 \n       5. Desired Results/Benefits       19 \n       6. Roles/Responsibilities         19 \n       7. Budget             20 \n \nIX. Education/Outreach Activities        21 \n       A. Educational Activities to be implemented     21 \n 1. Signage            21 \n     a. Indicators             21 \n     b. Schedule         22 \n     c. Budget           22 \n 2. Field Days          22 \n     a. Indicators             22 \n     b. Schedule         22 \n     c. Budget           23 \n 3. Fact Sheets         23 \n     a. Indicators             23 \n     b. Schedule         23 \n     c. Budget           23 \n  \n\n 4 \n4. Adopt-A-Stream           24 \n     a. Indicators             24 \n     b. Schedule         24 \n     c. Budget           24 \n 5. Project Learning Tree          24 \n     a. Indicators             25 \n     b. Schedule         25 \n     c. Budget           25 \n 6. Watershed Harmony Puppet Show        25 \n     a. Indicators             25 \n     b. Schedule         26 \n     c. Budget           26 \n 7. Total Projected Cost of Education/Outreach Activities       26 \n 8. Total Budget for Fannegusha Watershed Implementation Plan    26 \n \nX. Evaluation           27 \n     A. Plan Evaluation Procedure         27 \n     B. Implementation Evaluation Strategy      27 \n 1. MSWCC           27 \n 2. MDEQ             28 \n \nXI. Plan Revision            28 \n    A. Plan Revision Procedure          28 \n \nXII. Resources              29 \n \n \n \nList of Figures \n \nFigure 5.1 Fannegusha Creek Watershed      11 \n \nFigure 5.2 Land use in Fannegusha Creek Watershed     12\n \n \n \n \n \n \n \n \n \n\n 5 \nList of Tables \n \nTable 1.1 Fannegusha Creek Management Action Plan            7 \n \nTable 7.1 Water Quality Standards       15 \n \nTable 8.1 Funded 319 Project Budget for BMPs     20 \n \nTable 8.2 Contractual Services for BMP Design      20 \n \nTable 8.3 Technical Assistance          20 \n \nTable 9.1 Projected Costs for Signage        22 \n \nTable 9.2 Projected Costs for Field Days       23 \n \nTable 9.3 Projected Costs for Fact Sheets          23 \n \nTable 9.4 Projected Costs for Adopt-A-Stream       24 \n \nTable 9.5 Projected Costs for Project Learning Tree       25 \n \nTable 9.6 Projected Costs for Watershed Harmony Puppet Show     26 \n \nTable 9.7 Total Projected Education Budget        26 \n \nTable 9.8 Fannegusha Creek Watershed Implementation Plan Total Budget 26 \n \n \nList of Appendices \n \nAppendix A- Plant and Animal Species of Special Concern \n \nAppendix B- Funded 319Project Proposal \n \nAppendix C- Stressors \n \nAppendix D- Checklist of Watershed Implementation Elements \n \n \n \n \n\n 6 \n \nI. EXECUTIVE SUMMARY \n \n Fannegusha Creek Watershed was identified as a priority watershed \nby the Pearl River- South Independent Streams Basin Team.  Fannegusha \nCreek is listed on Mississippi’s 303(d) list of impaired waters for biological \nimpairment due to sediment.  The Mississippi Soil and Water Conservation \nCommission and USDA Natural Resources Conservation Service felt a \ngreat improvement in water quality could be made in this watershed. \nMSWCC submitted a proposal to apply best management practices to \naddress the sedimentation issue on agricultural lands. That proposal was \nselected for funding by MDEQ and a contract was awarded to MSWCC.  \nUnder that contract, MSWCC is required to assemble a Watershed \nImplementation Team to address other issues and concerns within the \nwatershed and write a Watershed Implementation Plan.   \n The key natural resource problem in this watershed is sedimentation.  \nThe Watershed Implementation Plan has the goals of reducing the \nsediment entering the streams and creeks in the watershed, and removing \nthe impaired segments of streams and creeks in the Fannegusha Creek \nwatershed from the state’s 303(d) list of impaired waterbodies.  To help \nsolve this problem, one of the management actions is to implement a 319 \nwater quality project on the agricultural lands within the watershed.  The \ntargeted area for this project is the cropland and pastureland in Rankin \nCounty that lie within the watershed boundaries.  This project is a three \nyear project that began in 2005 and will end in August 2008.  The groups \nthat will be implementing the management action of reducing the sediment \nloading will be the Rankin County Soil and Water Conservation District, the \nNatural Resources Conservation Service, and the Mississippi Soil and \nWater Conservation Commission.  The Rankin County Soil and Water \nConservation District and the Natural Resources Conservation Service can \nbe contacted at 601-824-4601 ext. 3 for information and assistance about \nthis management action.  \n\nTable 1.1  Fannegusha Creek Management Action Plan  \nGoal \nWho \nWhat  \nWhere\n \nWhen\n \nContacts \nMSWCC, USDA \nNRCS, MSU \nExtension \nService, \nMississippi Farm \nBureau \nContinue existing programs and \nprojects related to farmer \neducation, BMP implementation, \nand habitat conservation \nEntire \nwatershed \n2005-\n2008 \nMark Gilbert, \nMSWCC  \n601-354-7645 \nMurray Fulton, \nNRCS \n601-824-4601 \nBrook Stuart, \nMississippi Farm \nBureau \n601-977-4243 \nReduce sediment loading, \nachieve narrative \nstandards for sediment \nloading, and Fish and \nWildlife Support \ndesignated use  \nLocal Landowners \nand operators \n- Critical area planting \n- Grade Stabilization Structures \n- Pasture and Hayland Planting \n- Nutrient Management \n- Fencing \n- Stream Crossings \n- Diversions \n- Terraces \n- Grassed Waterways \n \nEntire \nWatershed \n2005-\n2008 \nLocal landowners \n\nII. VISION STATEMENT \n The vision of the Fannegusha Creek Watershed Implementation Team is to \nimprove and/or protect the quality of water in streams and creeks by reducing sediment \ntransport over the land and improving drainage on lands in the watershed.\n \n \n  \n \n \n \n \n \n \n \n \n \n \nIII. MISSION STATEMENT \n \n The mission of the Fannegusha Creek Watershed Implementation Team is to \neducate landowners on new and innovative best management practices and land use \nplanning methods, and implementing the appropriate Best Management Practices that \nwill result in the enhancement and conservation of natural resources in the watershed. \n \n \n \n \n \n \n \n \n \n8 \n\n 9 \nIV. WATERSHED IMPLEMENTATION TEAM \n \n Members of the Watershed Implementation Team for the Fannegusha Creek \nWatershed include as follows: \n \nTy Irby- Landowner \n \nDavid Boyd- Landowner \n \nBernard King- Landowner \n \nGary Thrash- Landowner \n \nMurray Fulton- Natural Resources Conservation Service (NRCS) \n \nMark Scott- Natural Resources Conservation Service (NRCS) \n \nMark Gilbert- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nPatrick Vowell- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nJeff Wilson- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nBrook Stuart- Mississippi Farm Bureau Federation (MFBF) \n \nKenneth LaFleur- Mississippi Department of Environmental Quality (MDEQ) \n \nZoffee Dahmash- Mississippi Department of Environmental Quality (MDEQ) \n \nAnn Porter- Mississippi Department of Environmental Quality (MDEQ) \n \nBrad Shedd- Mississippi Soil and Water Conservation Commission (MSWCC) \n \nTim Patrick- Rankin County Soil and Water Conservation District (RCSWCD) \n \nJeannine May- Natural Resources Conservation Service (NRCS) \n \nJanet Chapman- Mississippi Department of Environmental Quality (MDEQ) \n \n \n \n \n\n 10 \nV. WATERSHED DESCRIPTION \n Fannegusha Creek is located in northeastern portion of Rankin County, \nMississippi and northwestern portion of Scott County, Mississippi (Figure 5.1) (MDEQ \n2004).  There are 47,289 acres located within the watershed boundaries.  There are no \ntowns or cities located in this watershed, but there are several communities including \nMidway, Branch, Pisgah, Redoak, Sandhill and Leesburg.  The land uses in the \nwatershed include agriculture lands (45%), forestlands (35%), and barren, urban and \nother (all together less than 1%).   Figure 5.2 shows the land use in Fannegusha Creek \nwatershed. \n The soils in the watershed are primarily Kipling-Falkner-Savannah soils and \nAlluvium Eocene is the geology of the watershed.  Fannegusha Creek watershed is \nlocated in the Southeastern Plain ecoregion.  About 18% or 8,389 acres of the \nwatershed are wetlands.  \n Other named creeks in the watershed include Red Cane Creek and Hurricane \nCreek.  There are no state or federal parks, wildlife management areas, national forests \nor other significant management areas located within this watershed.  Being in a rural \narea, there are people located throughout the watershed. \n There are many economic conditions that affect the watershed.  These \nconditions include farming, beavers, dumping of trash in creeks and any other idle \nlands, development, and the rising costs of timber production and all other agricultural \nrelated businesses.  Some of the historical events that have affected the culture of the \nwatershed include storm damage leaving debris in the creeks and streams dating all the \nway back to Hurricane Camille, the development of the Ross Barnett Reservoir, and the \nother developing areas around the reservoir.  The sediment loading going into the \nbackwaters of the reservoir from this growth causes waters to back up on croplands in \nthe watershed.  The land uses in the watershed are seeing some changes on the \nRankin county side more rapidly than the Scott county side of the watershed.   There \nhas been a large decrease in the acres planted to cotton due to high production costs \nand there is no readily available place close enough to gin the cotton.  Also, with the \ngrowth that the area is experiencing there is more and more development of 5-10 acre \nhome places and communities in the watershed. \n  \n \n \n \n \n\n 11 \n \nFigure 5.1 Fannegusha Creek Watershed. \n \n \n \n \n \n \n\n 12 \n \n \n \nFigure 5.2 Land Use in Fannegusha Creek. \n \n \n \n \n \n \n \n \n\n 13 \nVI. STAKEHOLDER INTERESTS \n \n The stakeholders interests in this watershed includes farming, the recreational \nareas, and the drainage of this watershed.   The drainage is a big issue due to flood \nwaters backing up on cropland and carrying away the topsoil when the flood water \nrecedes.  This also causes severe eroding of stream banks.  Farming is a way of life for \nmany of the landowners in this watershed.  Due to the increased production costs and \nthe other rising costs associated with farming, there is a real concern that family farms \nare going to become a thing of the past.  There are some recreational areas in the \nwatershed that the stakeholders have an interest in preserving these areas for this \ngeneration and future generations to enjoy.    \n The stakeholders have a genuine concern for development in the watershed and \nthe impacts that it will have on sediment entering the streams and creeks within the \nwatershed.  The issue with sediment is already there and without well thought out \ndevelopment and proper management of construction sites for erosion and sediment \ncontrol, sediment could become an even bigger problem.  Also, snags and other debris \nin the streams are a problem because they slow down the flow and cause water to flood \ncropland and pastureland.   \n   \n \n\n 14 \nVII. Water Resources \n \nA. History of Activity in the Watershed \n \n The primary players in restoration and /or conservation efforts in the Fannegusha \nCreek Watershed are the Natural Resources Conservation Service, Rankin County Soil \nand Water Conservation District and the Mississippi Soil and Water Conservation \nCommission.  Local landowners and operators will play the major role in the restoration \nand conservation of the natural resources in this watershed by installing best \nmanagement practices on their land.   \n The Fannegusha Creek Watershed was selected as a priority watershed by the \nPearl River Basin Team.  As the management agency for Agricultural Nonpoint Source \nPollution in Mississippi, the Mississippi Soil and Water Conservation Commission \n(MSWCC) determined that the Fannegusha Creek Watershed would be a good \ncandidate for restoration.  After meetings with local landowners and Natural Resources \nConservation Service (NRCS) employees that work in this area, MSWCC felt there was \nenough interest in the watershed that a measurable difference could be shown and \nsubmitted a proposal to the Mississippi Department of Environmental Quality (MDEQ).  \nThrough a collaborative effort between NRCS, MDEQ and MSWCC, the team members \nfor the Watershed Implementation Team were assembled.  At this point in time, there \nhas been no process discussed to modify this team. \n There have been some conservation measures used in this watershed in the \npast including the operation fuel program, farm plans, and EQIP programs to dispose of \nold chemicals. These were some very productive programs for the farmers in the \nwatershed.  The Operation Fuel program was a program used to educate farmers on \nno-till farming.  This is a practice that most farmers in the watershed have adopted.  The \nfarm plans have helped the farmers in production and gave them a target of where they \nwanted to go with their farms.  The EQIP program helped the farmers get rid of old \nchemicals that could no longer be used, and chemicals that were out of date\n.  \n \n \n \n \nB. Wildlife and Fisheries \n \n There are important recreational species located throughout the watershed.  \nThese species include deer, turkey, bass, catfish, bream, rabbits, squirrel, and raccoon.  \n \n \n \n \n\n 15 \nC. Designated Use Classifications and Water Quality                 \n     Standards \n \n The designated beneficial use for the Fannegusha Creek and the waterbodies \nincluded in the watershed is fish and wildlife support.  There are no numeric water \nstandards for sediment applicable at this time for sediment TMDLs in the state of \nMississippi.  EPA Region IV has established a range of acceptable reference yields for \nstable streams in the  Southeastern Plains ecoregion and that is 6.9E-04 to 4.2E-03 \ntons per acre per day at the effective discharge. It is expected that all values within this \nrange will result in attainment of water quality standards.  It is estimated the typical \nrange for unstable streams in this ecoregion is 1.4E-03 to 6.9E-02 tons per acre per day \nat the effective discharge.  This range is representative of the load that would be \nexpected from the Fannegusha Creek Watershed.  The aquatic life use attainment \nthreshold scores associated with the Fannegusha Creek Watershed are as follows: \nFannegusha- 27.41 and Red Cane Creek- 33.20.  The reference MBISQ score for the \nEast Bioregion is 61.35.  Based on these scores, Both Fannegusha and Red Cane \nCreeks are impaired.  \n \nTable 7.1 Water Quality Standards. \nParameter  Beneficial Use Narrative Water Quality Standards \nSediment/ \nSiltation \nAquatic Life \nSupport \nWaters shall be free from materials \nattributable to municipal, industrial, \nagricultural, or other dischargers producing \ncolor, odor, taste, total suspended solids, or \nother conditions in such degree as to create \na nuisance, render the waters injurious to \npublic health, recreation, or to aquatic life \nand wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or \nimpair the waters for any designated uses. \n \n \n \n \nD. Current Status of Water Bodies in the Watershed \n \n Waterbodies in the Fannegusha Creek watershed that are included on \nMississippi’s list of impaired waters (303(d) list) are Fannegusha Creek, Red Cane \nCreek, and Hurricane Creek. \n Groundwater is used by most of Mississippi’s community and non-community \nwater supply systems.  However, the City of Jackson’s water supply is mostly \ndependent on surface waters.  Specifically, the City of Jackson has a water intake \nstructure on the Ross Barnett Reservoir and another 10 miles downstream on the Pearl \n\n 16 \nRiver.  The mouth of Fannegusha Creek empties into the Ross Barnett Reservoir.  \nTherefore, the Fannegusha Creek watershed would also be an important part of source \nwater protection.   \n \nE. TMDLs \n \n There has been a sediment TMDL completed for Fannegusha Creek located in \nRankin and Scott counties in Mississippi.  The watershed ID numbers are 0104 and \n0105.  The Hydrologic Unit Code (HUC) code for the watershed is 03180002.  The \nstreams in the watershed are biologically impaired due to sediment.  The sources of \nimpairment are landuse runoff and in-channel stream sediment processes.  The \nrecommended sediment load reduction in the TMDL brings the sediment loading to \nacceptable levels of a stable stream in the ecoregion.  The recommended management \nactions to reduce the loading to the stream are streambank restoration, riparian buffer \nzones restoration and any sediment reduction BMPs, especially for road crossings, \nagricultural activities, and construction activities. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 17 \nVIII. WATERSHED MANAGEMENT  \nACTIONS \nA. Sediment \n \n1. Stakeholder Interests \n \n One of the major interests of the stakeholders is the sediment loading to all three \ncreeks in the watershed.  This is the reason for Fannegusha, Red Cane and Hurricane \ncreeks being listed on Mississippi’s 303(d) list of impaired waters.  \n \n2. Goals/Objectives \n \n The goal and objective is to reduce the sediment loading coming from agricultural \nlands and bring the creeks back from unstable stream levels to stable stream levels.  By \naccomplishing this task, the above named creeks could be removed from the state’s \n303(d) list. \n \n3. Management Actions \n \n The management actions that will be taken to address sediment are the \ninstallation of agricultural BMPs that pertain to sediment.  These BMPs include but are \nnot limited to:  \n• Critical Area Planting,  \n• Grade Stabilization Structures,  \n• Pasture and Hayland Planting,  \n• Nutrient Management,  \n• Fencing,  \n• Stream Crossings,  \n• Diversions,  \n• Grassed Waterways, and  \n• Terraces. \n \n  These BMPs will be installed by cooperating landowners in the watershed.  The \nprogram that these BMPS will be installed under is the MSWCC cost-share program.  \nThe Natural Resources Conservation Service (NRCS) will provide the \ntechnical/planning assistance for this project.  Most of the BMPs that will be installed \nthat are permanent structures must be maintained by the landowner for a period of 10 \nyears.  NRCS identified landowners in the watershed that had agricultural land using \nmaps provided by the Mississippi Department of Environmental Quality.   \n \n \n \n\n 18 \n4. Project Tracking/Assessment of Progress \n \n The Fannegusha 319 project began in October 2005 and is scheduled to end \nAugust 2008.  The milestones for the Fannegusha Creek Watershed 319 project are \nlisted below:  \n \n1.    Sign grant contract with MS Department of Environmental Quality. (Month 0) \n \n2.    Determine priority areas that are contributing significant pollutant loads in the \nwatershed. This will be carried out with assistance from the Fannegusha Creek \nWIT.  (Month 1) \n \n3.    Issue policies and procedures for implementing the project to the SWCD office.   \n(Month 1) \n \n4.    Meet with the board of SWCD commissioners to get their understanding of their \nresponsibilities and participation. (Month 2) \n \n5.    Provide training to district staff. (Month 2-3) \n \n6.    Assist in establishing an evaluation system in conjunction with the MS \nDepartment of Environmental Quality to indicate the benefits of the project. \n(Month 2-3) \n \n7.    Conduct a landowner meeting to inform potential participants about the project. \n(Month 3)    \n \n8.    Secure commitments from several landowners and operators who are willing to \nparticipate in the project. (Month 3-4) \n \n9.    Assist participants in developing a conservation plan and applying best \nmanagement practices (Month 4-12) \n \n10.   Establish at least one demonstration farm. (Month 4-12) \n \n11.   Document pre-existing site conditions. (Before and after photo documentation will \nbe conducted). (Month 2-12) \n \n12.   Accelerate conservation planning and application assistance.  Special effort will \nbe made to complete conservation plans during this time frame. (Month 13-24) \n \n13.   Conduct at least one informational field day/tour to inform the public about the \nproject . (Month 13-24) \n \n14.   Establish at least one demonstration farm. (Month 13-24) \n \n\n 19 \n15.   As requested, assist DEQ with evaluations. (Month 0-36) \n \n16.   Collect GPS coordinates and other data required by MDEQ on all BMPs installed \nin the project. (Month 0-36) \n \n17.   Assemble data on the amount of soil saved. (Month 0-36) \n \n18.   Erect project roadside signs which designate where water quality practices are in \nprogress or have been completed. (Month 4-36) \n \n19.   Provide continued conservation planning and application assistance to \nparticipants. (Month 25-36) \n \n20.   Review the status of applying best management practices to reach the objectives \nof the project. (Month 25)  \n \n21.   Based upon the needs and finding of milestone 18, assistance in planning and/or \napplication will be redirected and/or accelerated. (Month 25-36) \n \n22.   Publish at least four articles about the project. (Month 0-36) \n \n23.   Publicity of the project will be increased; at least one field day/tour will be \nconducted and at least 1,000 fact sheets will be developed and distributed. \n(Month 25-36) \n \n24.   Bi-annual reports will be made to MDEQ. (Month 0-36) \n \n25.   Make Final report to MDEQ. (Month 36) \n \n \n5. Desired Results/Benefits \n \n The desired benefit of this project will be to reduce the sediment loading to levels \nthat are considered to be acceptable and remove the impaired segments of \nFannegusha, Hurricane, and Red Cane creeks from the state’s 303(d) list. \n \n \n6. Roles/Responsibilities \n \n There are several different groups with responsibilities in this watershed.  \nMSWCC has the responsibility and role of administering the 319 project.  The Rankin \nCounty Soil and Water Conservation District and the local NRCS staff have the role of \ntechnical assistance.  The landowners have the responsibility of implementation of \nBMPs in the project area.  The Fannegusha Creek Watershed Implementation Team \nhas the role of helping gather all the information needed to write the Watershed \n\n 20 \nImplementation Plan.  MSWCC also has the responsibility of compiling all the \ninformation and writing the initial plan for the watershed.  MDEQ will conduct stream \nmonitoring in conjunction with the 319 project.  Other programs that are available to \nlandowners in the watershed include EQIP, CRP, and WHIP.  Under these three \nprograms, there has been $15,000 spent over the last three years with another $70,000 \nprojected to be spent over the next three years. \n \n7. Budget \n \n The table below shows a list of potential Best Management Practices to be \ninstalled with the 319 grant.  We are not limited to using only these BMPs if there are \nothers that are needed that are not listed to address the sediment issue. \n \n \nTable 8.1 Funded 319 Project Budget for BMPs. \nPractice Area Affected  BMP Cost  BMP Total \nCritical Area Planting 50 acres $200/ac $10,000 \nGrade Stabilization Structure    20 structures $1,500 each   $30,000 \nPasture and Hayland Planting   200 acres $100/ac $20,000 \nNutrient Management 3,000 acres $84/ac $252,000 \nFencing 52,800 feet $1.10/foot $58,080 \nStream Crossing 10 structures $3,000/each   $30,000 \nDiversions 15, 000 feet $1.66/foot $24,900 \nTerraces 200,000 feet $1.15/foot $230,000 \nGrassed Waterways 40 acres $500/acre $20,000 \nTotal   $674,980 \n \n \nTable 8.2 Contractual Services for BMP Design \nItem Cost \nContractual Services for BMP Design $11,667 \nTotal $11,667 \n \nTable 8.3 Technical Assistance \nItem Cost \nTechnical Assistance $25,000 \nTotal $25,000 \n \n \n \n\n 21 \nIX. EDUCATION/OUTREACH ACTIVITIES \n \nA. Educational Activities to be Implemented \n \n The overall objective of community education in the Fannegusha Creek \nwatershed is to develop an atmosphere that promotes sustained, long-term \nprotection and improvement of aquatic resources in the watershed. Specific \nobjectives of education efforts in the watershed include the following: \n \n• Increase public awareness of the value of clean water. \n• Increase public awareness of agricultural runoff and encourage behaviors \nthat will reduce levels of sediments and nutrients in the watershed by \neducation, watershed characterization and stewardship opportunities. \n• Increase public awareness of how BMPs can be used to reduce negative \nwater quality and habitat affects. \n• Increase public awareness of the long term environmental and economic \nadvantages of protecting and improving water quality and habitat in the \nFannegusha Creek watershed. \n \n \n 1. Signage \n   Signs identifying the BMPs that have been installed will be erected in \n   areas where they will be visible and landowners will allow the signs to be \n   erected. \n \n    Primary partners- Mississippi Soil and Water Conservation Commission, \n   Mississippi Department of Environmental Quality, Rankin County Soil and Water \n   Conservation District, Natural Resources Conservation Service, and \n   Environmental Protection Agency. \n \n  a. Indicators        \n    There will be field days held to show other landowners and the      \n   interested public the BMPs installed.  Participants will be counted at these field \ndays.  Traffic through the watershed cannot be documented, but some areas are \nheavily traveled being along a state highway.  \n \n\n 22 \n  b. Schedule \n    The BMP signs will be erected as practices are completed and/or    \n   requested by the landowners throughout the life of the project. \n \n  c. Budget  \n Table 9.1 Projected Costs for Signage. \nItem Unit Cost     Total Cost \nSigns 20 $100.00 $2,000.00 \nTotal   $2,000.00 \n \n \n2. Field Days \n   There will be at least two field days held to highlight the BMPs that  have been \ninstalled during the project period.  This will allow other landowners and the \ninterested public to view some of the practices that are being installed to benefit \nwater quality in the watershed. \n \n   Primary partners- Mississippi Soil and Water Conservation Commission, \nMississippi Department of Environmental Quality, Rankin County Soil and Water \nConservation District, Natural Resources Conservation Service, and Environmental \nProtection Agency \n \n  a. Indicators \n    Attendance at these field days will be documented and reported to MDEQ.  \nThe number of individuals who install BMPs as a result of the field days will also be \ndocumented. \n \n  b. Schedule \n   Field days in the watershed will take place in 2006-2007. \n   \n \n \n \n\n 23 \n \n  c. Budget \n Table 9.2 Projected Costs for Field Days. \nItem Units Cost    Total Cost \nEvent Flyers 200 .60/each $120.00 \nMailing/Delivery 200 .39/each $78.00 \nMiscellaneous (facilities, \nsupplies) \n2 $5,067.50 $10,135.00 \nTotal   $10,333.00 \n   \n3. Fact Sheets \n    A fact sheet will be developed at the end of the project.  This fact sheet \nwill contain information about the watershed, the number  and type of BMPs that \nwere installed, the number of tons of soil being saved, and the number of acres \nimpacted by the BMPs. \n \n   Primary Partners- Mississippi Soil and Water Conservation Commission, Rankin \nCounty Soil and Water Conservation District, and Natural Resources Conservation \nService. \n \n  a. Indicators\n \n    1,000 fact sheets will be designed and distributed.  These fact sheets will \n   be handed out at the final field day and will also be available in the district offices.   \n \n b. Schedule \n   \nThe fact sheet will be developed once all BMPs are in place to get a total \n   on all tons of soil saved and the correct number of BMPs installed. \n \n c. Budget \n Table 9.3 Projected Costs for Fact Sheets. \nItem Unit Cost     Total Cost \nPrinting 1,000 1.00/each $1,000.00 \nTotal   $1,000.00 \n\n 24 \n \n4. Adopt-A-Stream \n   Adopt-A-Stream is a program that promotes environmental stewardship through \ntraining workshops, outdoor field activities, and by introducing participants to \nwatershed action projects.  One and two-day workshops inform participants about \nwatershed topics such as stream health, stream ecology, aquatic life and water \nchemistry.  \n \n   Primary Partners- Mississippi Department of Environmental Quality and \nMississippi Wildlife Federation. \n   a. Indicators \n   \nThe number of participants for the workshop will be      \n   documented.  Also, the number of participants that move      \n   forward with the stream stewardship project will be       \n   documented. \n \n  b. Schedule \n   This workshop will take place before August 2008. \n       \n  c. Budget \n Table 9.4 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total \nCost \nAdopt A Stream \nWorkshop \n1 day \nworkshop \n$1,500.00 $1,500.00 \nTotal   $1,500.00 \n \n \n5. Project Learning Tree \n   Project Learning Tree (PLT) is an award winning education program designed for \nteachers and other educators, parents, and community leaders working with youth \nfrom pre-K to 8\nth\n grade. PLT activity guides and modules are not sold, but are \nearned by educators who attend a six-hour workshop.  The PLT  activity guide is a \n400 page book containing 96 activities written in the form of lesson plans.  PLT’s \n\n 25 \ngoal is to “teach students HOW to think, not WHAT to think about environmental \nissues.” \n  \n   Primary Partners- Mississippi Department of Environmental Quality and \nMississippi Forestry Commission. \n \n  a. Indicators \n   The number of participants for the workshop will be documented. \n \n  b. Schedule \n   This workshop will take place before August 2008. \n \n  c. Budget \n Table 9.5 Projected Costs for Project Learning Tree. \nItem Unit Cost Total \nCost \nPLT Workshop 1 workshop $1,350.00 $1,350.00 \nTotal   $1,350.00 \n \n \n6. Watershed Harmony Puppet Show \n   Watershed Harmony is a musical puppet performance aligning with the fourth \nand fifth grade Mississippi Framework and National Science Standards.  Audiences \nof all ages will delight in environmental stewardship through this toe tapping musical.  \nPerformances are not only enjoyed by school groups, but also by adults attending \nteacher workshops, civic clubs, and conferences.  This program serves to inform, \nexcite, and enlist the help of citizens in an ongoing effort to promote water quality in \ntheir communities. \n \n   Primary Partners- Mississippi Department of Environmental Quality and Bayou \nTown Productions. \n \n  a. Indicators \n The number of participants will be documented and submitted to MDEQ.   \n\n 26 \n  b. Schedule \n   Watershed Harmony will be presented before August 2008. \n \n  c. Budget \n Table 9.6 Projected Costs for Watershed Harmony Puppet Show \n  Item Unit     Cost     Total \nCost \nWatershed Harmony Puppet Show 1 show $500.00 $500.00 \nTotal   $500.00 \n \n \n7. Total Projected Cost of Education/Outreach Activities \n \nTable 9.7 Total Projected Education Budget  \nItem Unit Cost    Total Cost \nSignage   $2,000.00 \nField Days   $10,333.00 \nFact Sheets   $1,000.00 \nAdopt-A-Stream   $1,500.00 \nProject Learning Tree   $1,350.00 \nWatershed Harmony Puppet Show      $500.00 \nTotal   $16,683.00 \n \n8. Total Budget for Fannegusha Watershed Implementation Plan \n \n   Table 9.8 Fannegusha Watershed Implementation Plan Total Budget \nItem Cost \nBMPs $674,980 \nContractual Services for BMP Design $11,667 \nTechnical Assistance $25,000 \nEducation/Outreach $16,683 \nTotal $728,330 \n \n \n\n 27 \nX. EVALUATION \n \nA. Plan Evaluation Procedure \n \n This watershed implementation plan will be evaluated and revised every three to \nfive years or on an as needed basis.  The evaluation of this plan will be organized by \nthe Fannegusha Creek Watershed Implementation Team.  At that time, the WIT will \ndevelop a detailed schedule for review and revision of this watershed \nimplementation plan. The WIT members will be responsible for notifying their \nstakeholders of the opportunity to propose changes to the watershed implementation \nplan. One month will be allowed for notification of stakeholders. \n   The plan will be evaluated by the team, or their designee, and any interested \nstakeholders. One month will be allowed for evaluation and submittal of comments. \nTherefore, comments will be due two months after the evaluation procedure is \ninitiated. The plan will be evaluated in two ways. First, to determine if the plan goals \nhave been achieved, and second, to determine if it reflects the current condition of \nthe watershed, state of science, and issues in the watershed. \n \n \nB. Implementation Evaluation Strategy \n \n 1.  The following measures and indicators progress will be utilized to track the \nsuccess of this plan by MSWCC:  \n• Before and after photo documentation on a representative \n sample of the BMPs installed, \n• Before and after soil loss collection on each BMP installed, and \n•  An R5 Load estimation Model Field Data Entry Sheet \n completed on each BMP installed, \n• Establishment of two demonstration farms that will be used to \n inform the public about best management practice systems, and \n• Informational fact sheets will be distributed that highlight the \n benefits derived through the installation of Best Management \n Practices. \n \n\n 28 \n  2.    MDEQ will collect stream samples for sediment at the conclusion of the     \n   project to determine the pollutant reductions achieved by the application of Best \n   Management Practices in the watershed.  Also,  the monitoring plan USGS is \nworking on will be added once completed.  \n \n \n \nXI. PLAN REVISION \n \nA. Plan Revision Procedure \n \n  After evaluation, MDEQ will prepare a revised watershed implementation plan \nincorporating the changes requested by the reviewers. At this point it may be \nnecessary to call a meeting to reconcile any conflicting comments or requests for \nchange.  \n   If the evaluation criteria are all being met in Fannegusha Creek surface waters, \nthe watershed implementation plan will be revised to address a different restoration \nissue or issues, or to protect the water quality of the watershed. If the evaluation \ncriteria for the watershed are not being met, the approach for restoring Fannegusha \nCreek watershed will be revised based on the knowledge that has been gained since \n2005.  \n   The draft watershed implementation plan will be submitted to the Implementation \nTeam, and all others who submitted comments. Within two weeks of receiving the \ndraft watershed implementation plan, the Implementation Team will notify their \nstakeholders of the availability of the revised watershed implementation plan for \nstakeholder review. One month will be allowed for review of the draft. Comments will \nbe due at the end of this review period. \n   Within a month after the comments on the draft watershed implementation plan \nare received, the DRAFT watershed implementation plan will be submitted to the \nImplementation Team for review and approval. After the DRAFT watershed \nimplementation plan has been approved, MDEQ will reproduce the plan and the \nImplementation Team will notify their stakeholders of the completion and availability \nof the plan for use as a guide to watershed restoration and protection activities. \n \n \n \n \n\n 29 \nXII. RESOURCES \n \nMDEQ. 2004. Biological Impairment due to Sediment TMDL for Fannegusha Creek \nWatershed including Red Cane Creek and Hurricane Creek, Pearl River Basin, \nRankin and Scott  Counties, Mississippi, Mississippi Department of Environmental \nQuality. Jackson, Mississippi. \n \nUSDA. SCS. 1987. Soil Survey of Rankin County, Mississippi. \n \nMDEQ. 2000. Pearl River Basin Status Report 2000. Mississippi Department of \nEnvironmental Quality. Jackson, Mississippi. \n \n\"Natural Heritage Inventory: Search Animal Database.\" Mississippi Museum of \nNatural Science.  \n<\nhttp://www.mdwfp.com/museum/html/Research/query_animals.asp> \n \n\"Natural Heritage Inventory: Search Plant Database.\" Mississippi Museum of Natural \nScience.  \n<\nhttp://www.mdwfp.com/museum/html/Research/query_plants.asp> \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 30 \n \n \n \n \n \n \n \n \n \nAppendix A \n \n \n \nPlant and Animal Species of \nSpecial Concern \n \n \n \n\n 31 \n \nAnimals of Special Concern in Rankin County \nScientific Name Common Name Threatened Endangered \nACIPENSER \nOXYRINCHUS \nDESOTOI \nGULF STURGEON      \nAIMOPHILA \nAESTIVALIS \nBACHMAN'S \nSPARROW \n  \nALOSA ALABAMAE   ALABAMA SHAD   \nATHENE \nCUNICULARIA \nBURROWING OWL      \nGRAPTEMYS \nOCULIFERA \nRINGED MAP \nTURTLE \n  \nHALIAEETUS \nLEUCOCEPHALUS \nBALD EAGLE   \nMACROCHELYS \nTEMMINCKII \nALLIGATOR \nSNAPPING TURTLE \n  \nOBOVARIA \nJACKSONIANA \nSOUTHERN \nHICKORYNUT \n  \nPANDION \nHALIAETUS \nOSPREY   \nPLEUROBEMA \nBEADLEIANUM \nMISSISSIPPI \nPIGTOE \n  \nPOLYODON \nSPATHULA \nPADDLEFISH   \nPROCAMBARUS \nBARBIGER \nJACKSON PRAIRIE \nCRAYFISH \n  \nTYRANNUS \nFORFICATUS \nSCISSOR-TAILED \nFLYCATCHER \n  \nUNIOMERUS \nDECLIVIS \nTAPERED \nPONDHORN \n  \n \n \n \n \n \n \n \n \n\n 32 \n \n \nPlants of Special Concern in Rankin County \nScientific Name Common Name Threatened Endangered \nANTENNARIA \nSOLITARIA \nSINGLE-HEADED \nPUSSYTOES \n  \nCAREX \nDECOMPOSITA \nCYPRESS-KNEE \nSEDGE \n  \nCARYA LEIODERMIS    SWAMP HICKORY      \nCHEILANTHES \nLANOSA \nHAIRY LIPFERN   \nECHINACEA \nPURPUREA \nEASTERN PURPLE \nCONEFLOWER \n  \nILEX MONTANA MOUNTAIN HOLLY     \nJUGLANS CINEREA     WHITE WALNUT   \nMATELEA \nCAROLINENSIS \nCAROLINA \nANGLEPOD \n  \nMELANTHIUM \nVIRGINICUM \nVIRGINIA \nBUNCHFLOWER \n  \nMIKANIA CORDIFOLIA  FLORIDA KEYS \nHEMPVINE \n  \nPANAX \nQUINQUEFOLIUS \nAMERICAN \nGINSENG \n  \nPLATANTHERA \nCRISTATA \nCRESTED FRINGED \nORCHID \n  \nRHAPIDOPHYLLUM \nHYSTRIX \nNEEDLE PALM   \nSCHISANDRA GLABRA SCARLET \nWOODBINE \n  \nSTEWARTIA \nMALACODENDRON \nSILKY CAMELLIA       \nTRIPHORA \nTRIANTHOPHORA \n \n  \n \n \n \n \n\n 33 \n \nAnimals of Special Concern in Scott County \nScientific Name Common Name Threatened Endangered \nGRAPTEMYS \nOCULIFERA \nRINGED MAP \nTURTLE \n  \nPICOIDES \nBOREALIS \nRED-COCKADED \nWOODPECKER \n  \nPLEUROBEMA \nBEADLEIANUM \nMISSISSIPPI PIGTOE   \nPROCAMBARUS \nBARBIGER \nJACKSON PRAIRIE \nCRAYFISH \n  \nURSUS \nAMERICANUS \nLUTEOLUS \nLOUISIANA BLACK \nBEAR \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 34 \n \nPlants of Special Concern in Scott County \nScientific Name Common Name Threatened Endangered \nASCLEPIAS HIRTELLA  PRAIRIE MILKWEED   \nCAREX MEADII MEAD'S SEDGE   \nCRATAEGUS ASHEI    ASHE HAWTHORN     \nCRATAEGUS \nTRIFLORA \nTHREE-FLOWERED \nHAWTHORN \n  \nECHINACEA \nPURPUREA \nEASTERN PURPLE \nCONEFLOWER \n  \nISOETES \nMELANOPODA \nBLACKFOOT \nQUILLWORT \n  \nLOBELIA \nAPPENDICULATA \nAPPENDAGED \nLOBELIA \n  \nPINUS VIRGINIANA     VIRGINIA PINE   \nPLATANTHERA \nCRISTATA \nCRESTED FRINGED \nORCHID \n  \nPLATANTHERA \nPERAMOENA \nPURPLE \nFRINGELESS \nORCHID \n  \nPRENANTHES \nASPERA \nROUGH \nRATTLESNAKE-\nROOT \n  \nQUERCUS \nMISSISSIPPIENSIS \nDELTA POST OAK      \nQUERCUS \nOGLETHORPENSIS \nOGLETHORPE OAK    \nSPIRANTHES \nMAGNICAMPORUM \nGREAT PLAINS \nLADIES'-TRESSES \n  \nSPIRANTHES OVALIS   LESSER LADIES'-\nTRESSES \n  \n \n \n \n \n \n \n\n 35 \n \n \n \n \n \n \n \n \n \n \n \n \nAppendix B \n \n \n \nFunded 319 Project Proposal \n \n \n \n \n \n\n 36 \nPROJECT TITLE: \nFannegusha Creek Watershed Nonpoint Source Pollution Project \n \nPROJECT ABSTRACT: \nThis project will be located in the north portion of Rankin County and the northwestern \nportion of Scott County in Mississippi. \nThe objectives of this project will be: \n \nTo improve water quality and protect high quality waters through the \nimplementation of selected BMPs in targeted areas. \n \nTo apply Best Management Practices (BMPs) to pasture land and cropland in the \nproject area so as to reach the desired outcome of reduced runoff and \nsedimentation to streams in the Fannegusha Creek Watershed. \n \nTo inform and educate the public about Best Management Practices that benefit \nwater quality. \n \nThe project cost is $724,980.  Of this amount, $434,988 in 319 funds are requested with \nthe balance of   $289,992 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nPatrick Vowell, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax:  (601) 354-6628 \ne-mail: pvowell@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES AND ORGANIZATIONS: \n \nRankin County Soil and Water Conservation District;  USDA Natural Resources \nConservation Service; Mississippi Department of Environmental Quality; United States \nGeological Survey; Farm Services Agency; Mississippi State Cooperative Extension \nService \n \n\n 37 \nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone:(601) 354-7645 \n  (601) 497-1649 (cell) \nFax:   (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nFannegusha Creek Watershed (031800020105, 031800020104) (includes Fannegusha, \nRed Cane and Hurricane Creeks) \n(see attachment 1 for a map depicting the targeted areas of the project) \n \nPROJECT OBJECTIVE: \n \nThe water quality impairment to be addressed by this project is sediment.  The \nMississippi Department of Environmental Quality (MDEQ) has determined through \nmonitoring that segment MS151FE of Fannegusha Creek, segment MS151FM2 of Red \nCane Creek and segment MS151FM1 of Hurricane Creek are impaired and have been \nplaced on the Mississippi 2002 Section 303(d) List of Waterbodies for biological \nimpairment. These water bodies were all sampled during the winter of 2001.  Benthic \nmacroinvertebrate data collected from Fannegusha Creek and Red Cane Creek \nsummarized as metrics were scored and combined into the regionally calibrated \nMississippi Benthic Index of Stream Quality (M-BISQ).  Based on the M-BISQ scores, \nFannegusha Creek and Red Cane Creek were determined to be impaired. No benthic \nmacroinvertebrate data could be colleted from Hurricane Creek during the winter of \n2001 due to numerous beaver dams within the creek which essentially made the creek \na series of ponds.  Therefore, no M-BISQ score could be determined.  Screening level \nbiology data for Hurricane Creek from earlier sampling events in 1993 indicated \nimpairment and thus were the basis of its original listing on the 1996 303(d) List of \nWaterbodies.   \n \nA stressor identification study was completed for the Fannegusha Creek watershed.  \nThe analysis identified sediment as the most probable stressor of the water body.  The \nState’s 303(d) list of monitored water bodies lists the designated use of Fannegusha \nCreek, including Red Cane Creek and Hurricane Creek, as aquatic life support.    A \nTMDL has been developed for the impairment by MDEQ and it has been targeted for \nimplementation by the Pearl River/South Independent Streams Basin Group \nmanagement team. The TMDL recommends that “the Fannegusha Creek watershed be \nconsidered a priority for streambank and riparian buffer zone restoration and any \nsediment reduction BMPs, especially for the road crossings, agricultural activities, and \n\n 38 \nconstruction activities.  The implementation of these BMP activities should reduce the \nsediment load entering Fannegusha Creek, Red Cane Creek, and Hurricane Creek.  \nThe reduction of the sediment load in the Fannegusha Creek watershed to equal that of \na relatively stable stream will allow the streams to approach stable conditions, which \nwould provide improved habitat for the support of aquatic life.” (a copy of the TMDL is \nattached)  (No agencies or organizations have been identified that have funding \navailable for stream bank and riparian zone restoration in the watershed.  NRCS \ndoes have a stream bank and shoreline protection practice available through the \nEQIP program.  However, landowners wishing to install this practice would have \nto rank out in the program in order to be approved for this practice) \n \n \n \nPROJECT DESCRIPTION: \n \nThe primary objective of this project will be to implement selected Best Management \nPractices  (BMPs) on targeted areas in the Fannegusha Creek Watershed that will \nresult in reduced sediment loadings from agricultural nonpoint sources.  Of primary \nconcern is sedimentation from crop land and pasture land in the watershed. Soils in the \nwatershed are very erosive, with sheet and gully erosion occurring on sloping crop land \nand pasture land. Erosion is occurring from crop land and pastureland land in the \nproject area at the rate of 8 tons per acre per year.  Sediment contained in runoff is \nentering Fannegusha Creek, Red Cane Creek, and Hurricane Creek causing \ndegradation of the resource base.    \nThe erosion of the soil resource base removes nutrients, reduces water holding \ncapacity, undermines plant rooting systems, reduces the soil’s organic matter content, \nreduces soil tilth and degrades water quality within the project area.   \nThe current land uses in the Fannegusha Creek Watershed include 21,700 acres of \nagricultural lands (the majority of which is cropland), 16,854 acres of timber land, and \n8,389 acres of wetlands.   \n  \nThis project will be implemented in three phases.  Phase 1 will consist of analyzing \nexisting assessment data, determining target areas within the watershed where the \nstressors are causing the greatest damage and if the application of needed Best \nManagement Practices will yield a beneficial reduction in pollutant loadings.  Education \nand outreach activities will also be conducted during this phase to inform landowners in \nthe watershed about the objectives of the project. The Mississippi Soil and Water \nConservation Commission (MSWCC) will cooperate with Natural Resources \nConservation Service, Mississippi Cooperative Extension Service, United States \nGeological Survey, and the Rankin County Soil and Water Conservation District in \nidentifying the appropriate Best Management Practices for targeted areas in the \nwatershed and educating landowners as to the need for their participation. \n \nPhase 2 will consist of (based upon the finding of phase 1) the application of best \nmanagement practices on targeted areas in the watershed that will result in desired \npollutant load reductions.  The Mississippi Soil and Water Conservation Commission will \n\n 39 \naccomplish this trough it’s water quality cost share program. In this project, records will \nbe kept at both the state level and local level so as to determine the progress being \nmade in carrying the project out and the benefits that are being received as related to \nthe improvement of water quality within the project.  During the planning process with \nparticipants, the amount of soil loss from the area to be treated with a particular BMP \nwill be determined and recorded.  The amount of soil saved as a result of applying the \nBMP will also be determined and recorded.  Additional information will be collected on \neach BMP installed in the project that will be provided to MDEQ and used to calculate \nthe pollutant load reduction for each BMP installed. This information will indicate the \nproject effectiveness in reducing pollutant loadings.  Participants in the project will be \nrequired to maintain BMPs for a period of up to ten years after installation. \n \nAdditional education and outreach efforts will be conducting during this phase to inform \nand educate the public about Best Management Practices that benefit water quality.  \nThis will be accomplished by the following: \nEstablish at least 2 demonstration farms to inform the public about best management \nsystems. \nConduct at least 2 field day/tours during the life of the project. \nPrepare and distribute at least 1,000 fact sheets highlighting the benefits derived from \nthe project. \nPublish at least 4 articles about the project in newsletters and local newspapers. \nErect at least 20 project roadside signs that designate where water quality practices are \nin progress or have been completed. \n \n \nTo address the above stated water quality problems, Best Management Practices \n(BMPs) will be installed on agricultural lands in the project area.  Potential BMPs to be \ninstalled include but are not limited to: \n50 acres of critical area planting \n20 grade stabilization structures \n200 acres of pasture & hayland planting \n3,000 acres of nutrient management \n52,800 feet of fencing \n10 stream crossings \n15,000 ft. of diversions \n40 acres of grassed waterways \n200,000 feet of terraces \n \nAt the present time, there are 70 acres of pasture planting scheduled to be implemented \nunder the Environmental Quality Incentives Program (EQIP) in the watershed.  Efforts \nare underway by the Natural Resources Conservation Service to inform landowners in \nthe watershed about additional practices available to them under the EQIP program as \nwell as the Conservation Reserve Program (CRP) and the Continuous CRP program. \n \n\n 40 \nPhase 3 will consist of post BMP monitoring to determine the pollutant load reductions \nachieved by the application of Best Management Practices.  The MSWCC will \ncoordinate with the MDEQ in conducting these activities. \n \nThe MSWCC has agreed to take the lead in developing a Watershed Implementation \nPlan for the Fannegusha Creek Watershed.  This project will address the agricultural \nportion of that plan. \n \n\n 41 \nMILESTONES: \n \nSign grant contract with MS Department of Environmental Quality. (Month 0) \n \n1.    Determine priority areas that are contributing significant pollutant loads in the \nwatershed. This will be carried out with assistance from the Fannegusha Creek \nWIT.  (Month 1) \n \n2.    Issue policies and procedures for implementing the project to the SWCD office. \n(Month 1) \n \n3.    Meet with the board of SWCD commissioners to get their understanding of their \nresponsibilities and participation. (Month 2) \n \n4.    Provide training to district staff. (Month 2-3) \n \n5.    Assist in establishing an evaluation system in conjunction with the MS \nDepartment of Environmental Quality to indicate the benefits of the project. \n(Month 2-3) \n \n6.    Conduct a landowner meeting to inform potential participants about the project.     \n(Month 3) \n \n7.    Secure commitments from several landowners and operators who are willing to \nparticipate in the project. (Month 3-4) \n \n8.    Assist participants in developing a conservation plan and applying best \nmanagement practices (Month 4-12) \n \n9.    Establish at least one demonstration farm (Month 4-12) \n \n10.   Document pre-existing site conditions. (Month 2-12) (Before and after photo \ndocumentation will be conducted). \n \n11.   Accelerate conservation planning and application assistance.  Special effort will \nbe made to complete conservation plans during this time frame. (Month 13-24) \n \n12.   Conduct at least one informational field day/tour to inform the public about the \nproject . (Month 13-24) \n \n13.   Establish at least one demonstration farm. (Month 13-24) \n \n14.   As requested, assist DEQ with evaluations. (Month 0-36) \n \n15.   Collect GPS coordinates and other data required by MDEQ on all BMPs installed \nin the project. (Month 0-36) \n\n 42 \n \n16.   Assemble data on the amount of soil saved. (Month 0-36) \n \n17.   Erect project roadside signs which designate where water quality practices are in \nprogress or have been completed. (Month 4-36) \n \n18.   Provide continued conservation planning and application assistance to \nparticipants. (Month 25-36) \n \n19.   Review the status of applying best management practices to reach the objectives \nof the project.  (Month 25) \n \n20.   Based upon the needs and finding of milestone 18, assistance in planning and/or \napplication will be redirected and/or accelerated. (Month 25-36) \n \n21.   Publish at least four articles about the project. (Month 0-36) \n \n22.   Publicity of the project will be increased; at least one field day/tour will be \nconducted and at least 1,000 fact sheets will be developed and distributed. \n(Month 25-36) \n \n23.   Bi-annual reports will be made to MDEQ. (Month 0-36) \n \n24.   Make Final report to MDEQ. (Month 36) \n\n 43 \nCRITERIA FOR EVALUATION \n(also see Phase 1 and 3 information under Project Description) \nThe following measures and indicators of progress will be utilized to track the success \nof this project: \n \nNPS Pollutant Load Reduction – the amount of soil saved as a result of the installation \nof best management practices (BMPs) in this project will be a direct indicator of \nsediment load reduction to Fannegusha Creek, Red Cane Creek and Hurricane Creek.  \nOther data collected for MDEQ will be used to calculate pollutant load reductions for \neach BMP installed in the project. \n \nImplementation of NPS Controls – this project will involve the installation of Best \nManagement Systems.  Best Management Systems are defined as a combination of \nBMPs, both structural and vegetative, which are the most practical, effective and \neconomical means of preventing or reducing pollution from nonpoint sources to a level \ncompatible with water quality goals.  The estimated types and numbers of BMPs to \nbe installed as part of Best Management Systems are listed in the project \ndescription of this proposal.  The application of best management systems in the \nproject will be the responsibility of the landowners and operators participating in the \nproject as cooperators of the local soil and water conservation district. \n \nPublic Education, Awareness, and Action - this project will include the establishment of \nat least 2 demonstration farms that will be used to inform the public about best \nmanagement systems.  These will be utilized during the 2 field day/tours that will be \nconducted in the project.  Also, at least 1,000 informational fact sheets highlighting the \nbenefits derived from the project will be developed and distributed as well as the \npublishing of at least 4 articles about the project in newsletters and local newspapers.  \nAt least 20 project roadside sign will be erected where water quality practices are \ninstalled in the project.    Other educational actions will be conducted to measure the \nsuccess of the project.  These include such things as increased public awareness; \nbefore and after photo documentation; increased cooperation among agencies, \nassociations, public bodies and educational institutions; and the economic benefits of \napplying best management practices.  The Mississippi Soil and Water Conservation \nCommission will request information through the local soil and water conservation \ndistrict that will assist in measuring the success of the project in the project area. \n \nPROJECT PERIOD \n \nThe length of this project will be 3 years. \n \n\n 44 \n \n \n \n \n \n \n \n \n \n \n \nAppendix C \n \n \n \nStressors \n\n \n45\n \nTable 2 \nStressor Summary Table \n \nConcern  Link/Immediate \nCause \nStressor\n \nDescription of \nStressor \nLocation/Extent\n \nSediment Loading From \nAgricultural \nLands \nLanduse runoff and inchannel sediment processes \nSediment \nA stressor identification study \nwas completed for Fannegusha Creek Watershed.  This analysis identified sediment as the most probable stressor of the waterbody.  Certain contaminants may be associated with sediment such as pesticides and nutrients.  However, these contaminants would also be controlled by the same best management practices (BMPs) that control sediment coming from fields. \nSee figure 3.1 for the locations of cropland along streams. There are approximately 21,700 acres of agriculture land in the watershed.  The majority of this land is cropland. \nAll the lands referred to \nabove are in HUC 03180002. \n       \n\n 46 \n \n \n \n \nAppendix D \n \n \n \n \n \n \n \n \n \nChecklist of Watershed \nImplementation Elements \n\n \n47\n \n Table D. 9 Key Elements of a Watershed Plan for 319\n Grant  \n \nRequired WIP Elements for 319 Grant \n \nLocation in Watershed Implementation Plan\n \n 1. Watershed Description and Background \n Chapter V, Chapter VII Section A \n 2.  Implementation \n Chapter VIII Section A Subsection 3 \n 3. Project Goals \n Chapter VIII Section A Subsections 2 and 5 \n 4. Project Costs \nChapter VIII Section A Subsection 7 Chapter IX Section A Subsection 7 \n 5. Education and Outreach \n Chapter IX \n 6. Implementation Schedule \n Chapter VIII Section A Subsection 4 \n 7. Milestones \n Chapter VIII Section A Subsection 4 \n 8. Adaptations and Revisions \n Chapter X Section A, Chapter XI Section A \n 9. Monitoring \n Chapter X Section B Subsections 1 and 2 \n ",
  "metadata": {
    "id": "fannegusha-creek-watershed-plan",
    "originalName": "Fannegusha_Creek_Watershed_Plan_2009.pdf",
    "mergedFrom": [
      "fannegusha-creek-watershed-plan-2009.json"
    ],
    "pageCount": 47,
    "mergedAt": "2025-10-02T06:41:26.679Z",
    "length": 57327
  }
}