{
  "id": "fourteen-mile-bakers-creek-watershed-plan-2009",
  "rawText": "\n\n \nFourteen Mile/Bakers \nCreek Watershed \nImplementation Plan \n \n \n \nFINAL DRAFT \n \n\n 2 \nFourteen Mile/Bakers Creek Watershed \n Implementation Plan \n \n \n \nPrepared for: \n \nBig Black, Tennessee-Tombigbee River Basin Team \nMississippi Department of Environmental Quality \n \n \n \n \n \n \n \n \n \nDeveloped by:  \n \nFourteen Mile/Bakers Creek Watershed Implementation Team \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n \n \n\n 3 \nTable of Contents \n \nI. Executive Summary          6 \n \nII. Vision Statement            8 \n \nIII. Mission Statement          8 \n \nIV. Watershed Implementation Team        9 \n \n V. Watershed Description           10 \n  \nVI. Stakeholder Interests            13 \n \nVII. Water Resources          14 \n     A.  History of Activity in the Watershed          14 \n     B. Wildlife and Fisheries          15 \n     C. Designated Use Classifications and Water Quality Standards   15 \n     D.  Current Status of Waterbodies in the Watershed        16 \n     E. TMDLs            16 \n \nVIII. Watershed Management Actions       18 \n       Agricultural Best Management Practices       \nA. Sediment and Nutrient BMPs           18 \n        1. Stakeholders Interests           18 \n        2. Goals/Objectives           18 \n        3. Management Actions        18 \n   4.  Project Tracking/Assessment of Progress     19 \n        5. Desired Results/Benefits         20 \n        6. Roles/Responsibilities           21 \n        7. Budget              21 \n \nIX. Education/Outreach Activities           22 \n       A. Educational Activities to be implemented      22 \n 1. Signage             22 \n     a. Indicators         23 \n     b. Schedule          23 \n     c. Budget            23 \n 2. Field Days           23 \n     a. Indicators         23 \n     b. Schedule          24 \n     c. Budget            24 \n 3. Fact Sheets          24 \n     a. Indicators         24 \n     b. Schedule          25 \n     c. Budget            25 \n 4. Adopt-A-Stream           25 \n     a. Indicators         25 \n     b. Schedule          25 \n     c. Budget            26 \n\n 4 \n  \n5. Project Learning Tree            26 \n     a. Indicators         26 \n     b. Schedule          26 \n     c. Budget            26 \n 6. Watershed Harmony Puppet Show      27 \n     a. Indicators         27 \n     b. Schedule          27 \n     c. Budget            27 \n 7. Total Projected Cost of Education/Outreach Activities      28 \n 8. Total Budget for Fourteen Mile/Bakers Watershed Implementation Plan  28 \n \nX. Evaluation            29 \n     A. Plan Evaluation Procedure           29 \n     B. Implementation Evaluation Strategy         29 \n 1. MSWCC            29 \n 2. MDEQ              30 \n \nXI. Plan Revision             31 \n    A. Plan Revision Procedure        31 \n \nXII. Resources          32 \n \n \n \n \n \nList of Figures \n \nFigure 5.1 Fourteen Mile/Bakers Creek Watershed       11 \n \nFigure 5.2 Land use in Fourteen Mile/Bakers Creek Watershed      12\n \n \n \n \n \n \n \n \n \n \n\n 5 \n \nList of Tables \n \nTable 1.1 Fourteen Mile/Bakers Creek Management Action Plan              7 \n \nTable 7.1 Water Quality Standards         15 \n \nTable 8.1 Funded 319 Project Budget for BMPs         21 \n \nTable 8.2 Technical Assistance        21 \n \nTable 9.1 Projected Costs for Signage       23 \n \nTable 9.2 Projected Costs for Field Days          24 \n \nTable 9.3 Projected Costs for Fact Sheets        25 \n \nTable 9.4 Projected Costs for Adopt-A-Stream      26 \n \nTable 9.5 Projected Costs for Project Learning Tree      26 \n \nTable 9.6 Projected Costs for Watershed Harmony Puppet Show     27 \n \nTable 9.7 Total Projected Education Budget       28 \n \nTable 9.8 Fourteen Mile/Bakers Creek Watershed Implementation Plan Total Budget\n 28 \n \n \n \nList of Appendices \n \nAppendix A- Plant and Animal Species of Special Concern \n \nAppendix B- Funded 319 Project Proposal \n \nAppendix C- Stressors \n \nAppendix D- Checklist of Watershed Implementation Elements \n \n \n \n \n \n\n 6 \nI. EXECUTIVE SUMMARY \n \n Fourteen Mile/Bakers Creek Watershed was identified as a priority watershed by \nthe Big Black, Tennessee-Tombigbee River Basin Team.  Fourteen Mile Creek is listed \non Mississippi’s 303(d) list of impaired waters for biological impairment due to Sediment \nNutrients, Low Dissolved Oxygen (DO), Organic Enrichment and Fecal Coliform.  \nBakers Creek is listed on the 303(d) for Fecal Coliform.  The Mississippi Soil and Water \nConservation Commission, Hinds County Soil and Water Conservation District and \nUSDA Natural Resources Conservation Service felt a great impact on water quality \ncould be made in this watershed. MSWCC submitted a proposal to apply best \nmanagement practices to address the sedimentation issue on agricultural lands. That \nproposal was selected for funding by MDEQ and a contract was awarded to MSWCC.  \nUnder that contract, MSWCC is required to assemble a Watershed Implementation \nTeam to address other issues and concerns within the watershed and write a \nWatershed Implementation Plan.   \n The key natural resource problems in this watershed are sedimentation and \nnutrient loading.  The Watershed Implementation Plan has the goals of reducing the \nsediment and nutrients entering the streams and creeks in the watershed, and removing \nthe impaired segments of streams and creeks in the Fourteen Mile/Bakers Creek \nwatershed from Mississippi’s 303(d) list of impaired waterbodies.  To help solve this \nproblem, one of the management actions is to implement a 319 water quality project on \nthe agricultural lands within the watershed.  The targeted area for this project is the \ncropland and pastureland in Hinds County that lie within the watershed boundaries.  \nThis is a three year project that began in 2007 and will end in August 2010.  The groups \nthat will be implementing the management action of reducing the sediment loading are \nthe Hinds County Soil and Water Conservation District, Natural Resources \nConservation Service, and the Mississippi Soil and Water Conservation Commission.  \nThe Hinds County Soil and Water Conservation District and the Natural Resources \nConservation Service can be contacted at 601-965-5682 ext. 3 for information and \nassistance about this management action.  \n\n \nTable 1.1 Fourteen Mile/Bakers Creek Management Act\nion Plan \n \n  \n \n7 \nGoal \nWho \nWhat  \nWhere\n \nWhen\n \nContacts \nMSWCC,  \nUSDA NRCS \nContinue existing programs and \nprojects related to farmer \neducation, BMP implementation, \nand habitat conservation \nEntire \nwatershed \n2007-\n2010 \nMark Gilbert, \nMSWCC  \n601-354-7645 \nRogerick \nThompson, NRCS \n601-824-4601 \n \nReduce sediment and \nnutrient loading, achieve \nnarrative standards for \nsediment loading, and Fish \nand Wildlife Support \ndesignated use  \nLocal Landowners \nand operators \n Critical Area Planting \n Grade Stabilization Structures \n Pasture Planting \n Filter Strips \n Fencing \n  Diversions \n Terraces \n \nEntire \nWatershed\n \n2007-\n2010 \nLocal landowners \n\n 8 \nII. VISION STATEMENT \n \n \n The vision of the Fourteen Mile/Bakers Creek Watershed Implementation Team is to \nimprove and/or protect the quality of water in streams and creeks by reducing sediment and \nnutrient transporting and enhance recreational land uses in the watershed. \n \n  \n \n \n \n \n \n \n \n \n \nIII. MISSION STATEMENT \n \n The mission of the Fourteen Mile/Bakers Creek Watershed Implementation Team is to \neducate landowners on new and innovative best management practices, land use planning \nmethods and implementing the appropriate Best Management Practices that will result in the \nenhancement and conservation of all the natural resources in the watershed. \n \n \n \n \n \n \n\n 9 \nIV. WATERSHED IMPLEMENTATION TEAM \n \n Members of the Watershed Implementation Team for the Fourteen Mile/Bakers Creek \nWatershed include as follows: \n \nMark Gilbert- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nPatrick Vowell- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nJeff Wilson- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nAndy Whittington- Mississippi Farm Bureau Federation (MFBF) \n \nRonn Killebrew- Mississippi Department of Environmental Quality (MDEQ) \n \nAnn Porter- Mississippi Department of Environmental Quality (MDEQ) \n \nRogerick Thompson- Natural Resources Conservation Service (NRCS) \n \nLynn Porter- Hinds County Soil & Water Conservation District (SWCD) \n \nPeggy McKey- Landowner  \n \nJacqueline Cannada- Landowner \n \nCindy McNair- Landowner \n \nGlen Holmes- Landowner \n \nClifton Reed- Landowner \n \nRosa Pittman- Hinds County SWCD Commissioner and Landowner \n \nDavid Barton Jr- Land Operator \n \nWyvette Robinson- Hinds County Soil and Water Conservation District (SWCD) \n \nPhillip Mikel- Hinds County Soil and Water Conservation District (SWCD) \n \nRichard Cox- Hinds County Soil and Water Conservation District (SWCD) \n \nShane Stocks- United States Geological Survey (USGS) \n \nDonetta-McCullum-Weatherspoon- Mississippi Department of Environmental Quality  \n              (MDEQ)\n \n\n 10 \nV. WATERSHED DESCRIPTION \n Fourteen Mile/Bakers Creek is located in the central to southwestern portion of Hinds \nCounty, Mississippi (Figure 5.1) (MDEQ 2006).  There are 163,019 acres located within the \nwatershed boundaries.  The towns and cities located in this watershed include Clinton, \nRaymond, Learned, Bolton, and Edwards.  Economic conditions that influence this watershed \ninclude farming, commodity prices, costs in planting and growing cotton and increased tillage \nto plant soybeans which causes increased runoff.   \nThe historical events that affect the culture of the watershed include old Civil War \nbattlefields, Mississippi College (oldest college in Mississippi), and using conventional tillage \nmethods when planting crops. The land uses in the watershed include 56,188 acres of \npastureland (34.5%), 43,547 acres of forestlands (26.7%), 23,023 acres of cropland (14.1%), \nand 8,521 acres of urban and other (all together 5.1%).   Figure 5.2 shows the land uses in the \nFourteen Mile/ Bakers Creek watershed.  There have been several significant changes in land \nuse in this watershed in the last 20 years.  The major change that has occurred is urbanization.  \nIn addition to urbanization, other changes have occurred including the types of crops being \nplanted due to increased expenses and the conversion of cropland and pastureland to \nforestland. \n The soils in the watershed include Loring-Memphis, Memphis-Loring, and Memphis-\nNatchez soils. The geology of the watershed is Catahoula Formation of the Tertiary Epoch.  \nFourteen Mile/Bakers Creek watershed is located in the Mississippi Valley Loess Plains, \nMississippi Alluvial Plains, and the Southeastern Plains ecoregions.  About 1.5% or 2,524 \nacres of the watershed are wetlands.  \n Other named creeks in the watershed include Bitter, Terrell, Hamilton, McDonald, \nSnake, Turkey, Jackson, Smith, Lindsey, Little Bakers, and Fleetwood Creeks.  There are no \nstate or federal parks, wildlife management areas, national forests or other significant \nmanagement areas located within this watershed.   \n  \n \n \n \n \n\n 11 \n \nFigure 5.1 Fourteen Mile/Bakers Creek Watershed. \n \n \n \n \n \n \n\n 12 \n \n \n \nFigure 5.2 Land Use in Fourteen Mile/Bakers Creek. \n \n \n \n \n \n \n \n\n 13 \nVI. STAKEHOLDER INTERESTS \n \n The stakeholders in this watershed want to conserve and preserve the soil, water, and \nwildlife habitat.  Stakeholders in the watershed want to restore the watershed creeks and \nstreams to a state of good water quality.  Some of the interests that the stakeholders feel will \nimpact restoring the creeks in the watershed to good water quality include reducing runoff \n(stopping erosion and loss of topsoil) and improving habitat for fish and wildlife. The interests \nthe stakeholders have in the watershed are using the natural resources wisely, eliminating \nsnags and debris, stopping people from littering, issues associated with the landfill, and beaver \ncontrol.  Also, there are issues where people target practice from bridges endangering cattle \nand other livestock nearby.  The stakeholders feel all the interests are tied together.  The \nsnags and debris are coming from two different issues.  Storm damage to woody areas cause \nlog and brush debris to get into the streams also, people toss household trash and old \nappliances from bridges into the streams and creeks.  This debris causes large snags that \ninterrupt the flow causing flooding.  Once the flood waters recede the topsoil is washed away \ntaking nutrients and chemicals with it.  This helps increase the potential of starting head cuts \nand gullies while leaving debris in pastures and on cropland.  Therefore, the stakeholders feel \nstopping the littering would help resolve a lot of the snag and debris issues in the streams and \ncreeks.  This would, in turn, help reduce the sediment and nutrients entering the streams.  A \nconcern that has recently become a major concern is the landfill in the headwaters of the \nwatershed.  It is the concern of the landowners that sediment and other contaminants will \naffect the water quality in the watershed.  The concern for beaver control has always been an \nissue, but recently the beaver dams have started causing flooding of croplands.  Due to this \nflooding, some of the farmers will lose parts of some fields that they farm.        \n.     \n   \n \n \n \n \n \n\n 14 \nVII. Water Resources \n \nA. History of Activity in the Watershed \n \n The primary players in restoration and /or conservation efforts in the Fourteen \nMile/Bakers Creek Watershed are the Natural Resources Conservation Service, Hinds County \nSoil and Water Conservation District and the Mississippi Soil and Water Conservation \nCommission.  Local landowners and operators will play a major role in the restoration and \nconservation of the natural resources in this watershed by installing best management \npractices on their land.  There have been several programs that have been utilized by \nlandowners in the watershed in past years.  These programs include Environmental Quality \nIncentive Program (EQIP), Wildlife Habitat Incentives Program (WHIP), Conservation Reserve \nProgram (CRP), Forestry Incentives Program (FIP), Conservation Security Program (CSP), \nHold Our Topsoil (HOT) and the Agricultural Conservation Program (ACP).  These programs \nhave helped a lot of landowners apply conservation on the ground while reducing soil loss, \nenhancing wildlife habitat, enhancing water quality, increasing water quantity, increasing tree \nproduction and promoting conservation education.    \n The Fourteen Mile/Bakers Creek Watershed was selected as a priority watershed by the \nTenn-Tom, Big Black Basin Team.  As the management agency for Agricultural Nonpoint \nSource Pollution in Mississippi, the Mississippi Soil and Water Conservation Commission \n(MSWCC) determined that the Fourteen Mile/Bakers Creek Watershed would be a good \ncandidate for restoration.  After meetings with local landowners and Natural Resources \nConservation Service (NRCS) employees that work in this area, MSWCC felt there was \nenough interest in the watershed that a measurable difference could be shown, and submitted \na proposal to the Mississippi Department of Environmental Quality (MDEQ).  Through a \ncollaborative effort between Hinds County SWCD, NRCS, MDEQ and MSWCC, the team \nmembers for the Watershed Implementation Team were assembled.  At this point in time, \nthere has been no process discussed to modify this team. \n \n \n \n \n\n 15 \nB. Wildlife and Fisheries \n \n There are important recreational species located throughout the watershed.  These \nspecies include deer, turkey, bass, catfish, bream, rabbits, squirrel, and raccoon.   The list of \nplants and animals of special concern are included as Appendix A.  This list also includes the \nanimals and plants that are threatened or endangered. \n \n \n \nC. Designated Use Classifications and Water Quality                 \n     Standards \n \n The designated beneficial uses for the Fourteen Mile/Bakers Creek and the waterbodies \nincluded in the watershed are aquatic life support and secondary contact.  The water use \nclassification for the listed segments of Fourteen Mile and Bakers Creeks is fish and wildlife \nsupport according to the 2002 Water Quality Criteria for Intrastate, Interstate and Coastal \nWaters.  There are no numeric water quality standards for sediment applicable at this time.  \nThe acceptable reference yields range for stable streams within HUC 08060202 established by \nEPA Region IV is .0003 to .014 tons per acre per day at the effective discharge. It is expected \nthat all values within this range will result in attainment of water quality standards.  It is \nestimated the typical range for unstable streams in HUC 08060202 is .321 to 2.333 tons per \nacre per day at the effective discharge.  This range is representative of the load that would be \nexpected from the Fourteen Mile/Bakers Creek Watershed.  The aquatic life use attainment \nthreshold scores associated with the Fourteen Mile/Bakers Creek Watershed are as follows: \nFourteen Mile- 30.24 and Bakers Creek- 25.74.  The reference MBISQ score for the Bioregion \nis 57.55.\n \n \nTable 7.1 Water Quality Standards. \nParameter   Beneficial Use Narrative Water Quality Standards \nSediment/ \nSiltation \nAquatic Life Support    Waters shall be free from materials attributable to municipal, \nindustrial, agricultural, or other dischargers producing color, odor, \ntaste, total suspended solids, or other conditions in such degree \nas to create a nuisance, render the waters injurious to public \nhealth, recreation, or to aquatic life and wildlife, or adversely affect \nthe palatability of fish, aesthetic quality, or impair the waters for \nany designated uses. \n\n 16 \n \nParameter   Beneficial Use Water Quality Standards \nFecal Coliform    Secondary Contact \nMay-October: Fecal coliform colony counts not to exceed a \ngeometric mean of 200 per 100ml based on a minimum of 5 \nsamples taken over a 30-day period with no less \n\nthan 12 hours \nbetween individual samples, nor shall the samples examined \nduring a 30-day period exceed 400 per 100 ml more than 10% of \nthe time. \nNovember-April: Fecal coliform colony counts not to exceed a \ngeometric mean of 2,000 per 100ml based on a minimum of 5 \nsamples taken over a 30-day period with no less than 12 hours \nbetween individual samples, nor shall the samples examined \nduring a 30-day period exceed 4,000 per 100 ml more than 10% of \nthe time. \n \n \nD. Current Status of Water Bodies in the Watershed \n \n Waterbodies in the Fourteen Mile/Bakers Creek watershed are included on Mississippi’s \n303(d) list of impaired waters and they are as follows: \nFourteen Mile Creek- listed for fecal coliform, sediment, low DO, nutrients and organic \nenrichment, and  \nBakers Creek - listed for fecal coliform. \n  \nE. TMDLs \n \n The Fourteen Mile/Bakers Creek  watershed is located in Hinds County, Mississippi.   \nThe watershed ID number is 150, and the Hydrologic Unit Code (HUC) code for the watershed \nis 08060202.  The streams in Fourteen Mile Creek Watershed are biologically impaired due to \nsediment/siltation, fecal coliform, low dissolved oxygen (DO), nutrients, and organic \nenrichment.  The steams in Bakers creek are impaired due to fecal coliform loading.  \nA fecal coliform TMDL has been developed for Fourteen Mile and Bakers creeks for \nfecal coliform for segments MS441FE and MS441BE respectively.  Also, there have been two \nother TMDLs developed for Fourteen Mile Creek.  The first TMDL is for biological impairment \ndue to sediment.  The second TMDL is for biological impairment due to nutrients, low DO, and \norganic enrichment.  \n\n 17 \nThe recommended load reduction for sediment is a narrative criteria because at this \ntime Mississippi does not have numeric criteria for sediment.  Also, due to sediment data being \nunavailable and insufficient, the sediment range used for the TMDL were obtained from those \nvalues of unstable streams in the level III ecoregion. This range is from .321 to 2.333 tons per \nacre per day at the effective discharge, therefore, a reduction in the sediment loading is \nrecommended to bring those unstable streams back to yields that are acceptable for stable \nstreams in the ecoregion.  The recommended management actions to reduce the loading to \nthe streams are streambank and riparian buffer zones restoration and any other sediment \nreduction BMPs, especially for the road crossings, agricultural activities, and construction \nactivities. \n The recommended load reduction and management action, in the TMDL \naddressing fecal coliform, is to reduce the summer loading in Fourteen Mile by 52% and \nBakers Creek by 80%.  The summer period is from May to October.  The water quality \nstandard for fecal coliform loading is located in Table 7.1. This reduction applies to point and \nnonpoint sources combined.  This TMDL will not require any changes to any of the existing \nNPDES permits at this time. \nThe recommended load reduction for nutrients, low DO and organic enrichment are \n50% for nonpoint source loads of Biochemical Oxygen Demand (BOD), total Phosphorus (TP), \nand total Nitrogen (TN).  The management actions for this load reduction include riparian \nbuffer zone restoration and other nutrient reduction BMPs.  Implementation of these BMP \nactivities should reduce nutrient loading to the streams that will result in attainment of \napplicable water quality standards. \n  \n \n \n \n \n \n \n \n \n\n 18 \nVIII. WATERSHED MANAGEMENT  \nACTIONS \n \nAgricultural Best Management Practices \n \nSediment and Nutrient BMPs  \n \n1. Stakeholder Interests \n \n \nThe major interests of the stakeholders are the sediment and nutrient loadings to \nFourteen Mile and Bakers creeks in the watershed.  These are the reasons these creeks are \nlisted on Mississippi’s 303(d) list of impaired waters.  \n \n2. Goals/Objectives \n \n The goal and objective is to reduce the sediment and nutrient loading coming from \nagricultural lands and bring the creeks back from unstable stream levels to stable stream \nlevels.  By accomplishing this task, the above named creeks could be removed from the state’s \n303(d) list. \n \n3. Management Actions \n \n The management action that will be taken to address sediment  and nutrient loading is \nthe installation of agricultural BMPs that pertain to sediment and nutrients.  These BMPs \ninclude but are not limited to:  \n• Critical Area Planting,  \n• Grade Stabilization Structures,  \n• Pasture Planting,  \n• Filter Strips,  \n• Fencing,  \n• Diversions, and  \n• Terraces. \n \n\n 19 \n  These BMPs will be installed by cooperating landowners in the watershed.  The \nprogram that these BMPS will be installed under is the MSWCC cost-share program.  The \nNatural Resources Conservation Service (NRCS) will provide the technical/planning \nassistance for this project.  Most of the BMPs that will be installed are permanent structures \nand must be maintained by the landowner for a period of 10 years.  NRCS and Hinds County \nSoil and Water District employees identified landowners in the watershed that had agricultural \nland using maps provided by the Mississippi Department of Environmental Quality.   \n \n \n \n4. Project Tracking/Assessment of Progress \n \n The Fourteen Mile/Bakers Creek 319 project began in 2007 and is scheduled to end \nAugust 2010.  The milestones for the Fourteen Mile/Bakers Creek Watershed 319 project are \nlisted below:  \n \n1.  Form the Fourteen Mile/Bakers Creek Watershed Implementation Team (WIT) with      \n      assistance from MDEQ. \n \n2.  Form a watershed “watchdog” group.     \n \n3.  Convene a project kick-off meeting of the newly formed Fourteen Mile/Bakers Creek WIT.    \n \n4.  Facilitate all Fourteen Mile/Bakers Creek WIT meetings.            \n \n5.  Develop a Watershed Implementation Plan (WIP) consistent with MDEQ guidance and         \nassistance from the WIT. \n \n6.  Present a draft WIP to MDEQ and the Big Black Basin Team for review and comments. \n \n7.  Coordinate with Mississippi Department of Environmental Quality (MDEQ), Natural \nResources Conservation Service (NRCS), United States Geological Survey (USGS), and \nthe Hinds County Soil and Water Conservation District (SWCD) to determine priority \nareas that are contributing significant pollutant loads in the watershed. \n                                                                                                         \n8.  Inform the public, landowners, and other stakeholders within the project area about the \nproject and secure commitments from priority landowners and others willing to participate \nin the project.    \n                                                                                                                 \n\n 20 \n9.  Identify the appropriate Best Management Practices (BMPs) for targeted areas and \neducate landowners as to the need to participate.  Also, coordinate with USGS in \nselecting a site to premonitory for determination of sediment loadings.      \n                                                                                     \n                                                                                                                                     \n10. Notify MDEQ project officer, in a timely manner, of all project visits/ inspections/ field \ndays/ and any other public meetings so that the project officer may have an opportunity to \nattend. \n                                                                                                       \n                                                               \n11. Assist USGS with the development and implementation of a water quality monitoring plan \nand the collection of any relevant project data.  \n                                                                                                                                                                \n12. Assist landowners and operators in the installation of appropriate BMPs and collect       \n      before and after soil loss and GPS coordinates each installed  BMP.   \n \n13. Establish at least two (2) demonstration farms to inform the public about BMPs \n \n14. Provide a least two (2) informational field days/tours to inform the public about the     \n      benefits of the project. \n \n15. Develop and distribute no fewer than 1,000 informational fact sheets highlighting the      \n      benefits derived from the project.  \n \n16. Publish no fewer than 4 articles about the project in newsletters and local newspapers. \n \n17. Erect no fewer than 20 project roadside signs where water quality practices are installed     \n       in the project.  \n \n18. Document pre-existing site conditions and improvements by conducting before and after     \n      photo documentation. \n \n19. Secure maintenance agreements from cooperators/landowners in accordance with      \n      MSWCC state cost-share guidelines.  \n \n20. Submit bi-annual reports by every September 25\nth\n and March 25\nth\n of each year showing    \n      status of tasks and start/completion dates of each task. \n \n21. Submit a final report to MDEQ.                                                        \n \n \n5. Desired Results/Benefits \n \n The desired benefit of this project will be the reduction of sediment and nutrient loading \nto levels that are considered to be acceptable and remove the impaired segments of Fourteen \nMile and Bakers creeks from Mississippi’s 303(d) list. \n\n 21 \n6. Roles/Responsibilities \n \n There are several different groups with responsibilities in this watershed.  MSWCC has \nthe responsibility and role of administering the 319 project.  The Hinds County Soil and Water \nConservation District and the local NRCS staff have the role of technical assistance.  The \nlandowners have the responsibility of implementation of BMPs in the project area.  The \nFourteen Mile/Bakers Creek Watershed Implementation Team has the role of helping gather \nall the information needed to write the Watershed Implementation Plan.  MSWCC also has the \nresponsibility of compiling all the information and writing the initial plan for the watershed.  \nOther programs that are available to landowners in the watershed include EQIP, CRP, and \nWHIP.  Under these three programs, there has been $658,900 spent over the last three years \nwith another $540,000 projected to be spent over the next three years. \n \n7. Budget \n \nThe table below shows a list of potential Best Management Practices to be installed with \nthe 319 grant.   \n \nTable 8.1 Funded 319 Project Budget for BMPs. \nPractice Area Affected    BMP Cost    BMP Total \nCritical Area Planting 180 acres $200/ac $36,000 \nGrade Stabilization Structure    103 structures $3,500 each   $360,500 \nPasture Planting 200 acres $100/ac $20,000 \nFencing 12,000 feet $1.10/foot $13,200 \nFilter Strips 60 acres $190/acre $11,400 \nDiversions 6,9490 feet $1.02/foot $7,087 \nTerraces 19,000 feet $.65/foot $13,350 \nTotal   $460,537 \n \n \nTable 8.2 Technical Assistance \nItem Cost \nTechnical Assistance $35,000 \nTotal $35,000 \n \n\n 22 \nIX. EDUCATION/OUTREACH ACTIVITIES \n \nA. Educational Activities to be Implemented \n \n The overall objective of community education in the Fourteen Mile/Bakers Creek \nwatershed is to develop an atmosphere that promotes sustained, long-term protection and \nimprovement of aquatic resources in the watershed. Specific objectives of education efforts \nin the watershed include the following: \n \n• Increase public awareness of the value of clean water. \n• Increase public awareness of agricultural runoff and encourage behaviors that \nwill reduce levels of sediments and nutrients in the watershed by education, \nwatershed characterization and stewardship opportunities. \n• Increase public awareness of how BMPs can be used to reduce negative water \nquality and habitat effects. \n• Increase public awareness of the long term environmental and economic \nadvantages of protecting and improving water quality and habitat in the Fourteen \nMile/Bakers Creek watershed. \n \n \n 1. Signage \nSigns identifying the BMPs that have been installed will be erected throughout \nthe watershed upon permission of landowners. \n \n    Primary partners- Mississippi Soil and Water Conservation Commission, \n   Mississippi Department of Environmental Quality, Hinds County Soil and Water \n   Conservation District, Natural Resources Conservation Service, and \n   Environmental Protection Agency. \n \n \n \n \n \n\n 23 \n    a. Indicators   \n    There will be field days held to show other landowners and the      \n   interested public the BMPs installed.  Participants will be counted at these field days.  \nTraffic through the watershed cannot be documented, but some areas are heavily traveled \nbeing along a state highway.  \n \n    b. Schedule \n    The BMP signs will be erected as practices are completed and/or    \n   requested by the landowners throughout the life of the project. \n \n    c. Budget  \n \nTable 9.1 Projected Costs for Signage. \nItem Unit Cost Total Cost \nSigns 20 $100.00 $2,000.00 \nTotal   $2,000.00 \n \n2. Field Days \n   There will be at least two field days held to highlight the BMPs that  have been installed \nduring the project period.  This will allow other landowners and the interested public to view \nsome of the practices that are being installed to benefit water quality in the watershed. \n \n   Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, Hinds County Soil and Water Conservation District, \nNatural Resources Conservation Service, and Environmental Protection Agency \n \n    a. Indicators \n    Attendance at these field days will be documented and reported to MDEQ.  The \nnumber of individuals who install BMPs as a result of the field days will also be \ndocumented. \n \n\n 24 \n    b. Schedule \n     Field days in the watershed will take place in 2009-2010. \n     \n \n    c. Budget \n \nTable 9.2 Projected Costs for Field Days. \nItem Units Cost Total Cost \nEvent Flyers 200 .60/each $120.00 \nMailing/Delivery 200 .41/each $82.00 \nMiscellaneous (facilities, \nsupplies) \n2 $5,399/each $10,798.00 \nTotal   $11,000.00 \n     \n \n \n3. Fact Sheets \n    A fact sheet will be developed at the end of the project.  This fact sheet will \ncontain information about the watershed, the number and type of BMPs that were installed, \nthe number of tons of soil being saved, and the number of acres impacted by the BMPs. \n \n   Primary Partners- Mississippi Soil and Water Conservation Commission, Hinds County \nSoil and Water Conservation District, and Natural Resources Conservation Service. \n \n    a. Indicators \n    1,000 fact sheets will be designed and distributed.  These fact sheets will   be \nhanded out at the final field day and will also be available in the district offices.   \n \n \n \n \n\n 25 \n b. Schedule \n     The fact sheet will be developed once all BMPs are in place to get a total tons of \nsoil saved and the correct number of BMPs installed. \n \n c. Budget \n \nTable 9.3 Projected Costs for Fact Sheets. \nItem Unit Cost Total Cost \nPrinting 1,000 1.00/each $1,000.00 \nTotal   $1,000.00 \n \n \n4. Adopt-A-Stream \n   Adopt-A-Stream is a program that promotes environmental stewardship through training \nworkshops, outdoor field activities, and by introducing participants to watershed action \nprojects.  One and two-day workshops inform participants about watershed topics such as \nstream health, stream ecology, aquatic life and water chemistry.  \n \n   Primary Partners- Mississippi Department of Environmental Quality and Mississippi \nWildlife Federation. \n   a. Indicators \n     \nThere were 32 participants who participated in the workshop.  The number of \nparticipants that move forward with the stream stewardship project will be documented as \nsoon as the information becomes available. \n \n    b. Schedule \n     \nThe Adopt-A-Stream workshop took place on June 4, 2008.     \n \n \n \n \n \n \n\n 26 \n    c. Budget \n Table 9.4 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total \nCost \nAdopt A Stream \nWorkshop \n1 day \nworkshop \n$1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n \n5. Project Learning Tree \n   Project Learning Tree (PLT) is an award winning education program designed for \nteachers and other educators, parents, and community leaders working with youth from \npre-K to 8\nth\n grade. PLT activity guides and modules are not sold, but are earned by \neducators who attend a six-hour workshop.  The PLT     activity guide is a 400 page book \ncontaining 96 activities written in the form of lesson plans.  PLT’s goal is to “teach students \nHOW to think, not WHAT to think about environmental issues.” \n  \n   Primary Partners- Mississippi Department of Environmental Quality and Mississippi \nForestry Commission. \n \n    a. Indicators \n     There were 54 participants for the workshop. \n \n    b. Schedule \n     \nThis workshop took place in September 2008. \n \n    c. Budget \n \nTable 9.5 Projected Costs for Project Learning Tree. \nItem Unit Cost Total \nCost \nPLT Workshop 1 workshop $1,350.00 $1,350.00 \nTotal   $1,350.00 \n \n\n 27 \n6.  Watershed Harmony Puppet Show \n   Watershed Harmony is a musical puppet performance aligning with the fourth and fifth \ngrade Mississippi Framework and National Science Standards.  Audiences of all ages will \ndelight in environmental stewardship through this toe tapping musical.  Performances are \nnot only enjoyed by school groups, but also by adults attending teacher workshops, civic \nclubs, and conferences.  This program serves to inform, excite, and enlist the help of \ncitizens in an ongoing effort to promote water quality in their communities. \n \n   Primary Partners- Mississippi Department of Environmental Quality and Bayou Town \nProductions. \n \n    a. Indicators \n The number of participants will be documented and submitted to MDEQ.   \n    b. Schedule \n     \nWatershed Harmony will be presented before August 2010. \n \n    c. Budget \n Table 9.6 Projected Costs for Watershed Harmony Puppet Show \n    Item Unit Cost Total Cost \nWatershed Harmony Puppet Show 1 \nshow \n$1,000.00 $1,000.00 \nTo\n\ntal   $1,000.00 \n \n \n \n \n \n \n \n \n \n \n\n 28 \n7. Total Projected Cost of Education/Outreach Activities \n Table 9.7 Total Projected Education Budget  \nItem Unit Cost Total Cost \nSignage   $2,000.00 \nField Days   $11,000.00 \nFact Sheets   $1,000.00 \nAdopt-A-Stream   $1,000.00 \nProject Learning Tree   $1,350.00 \nWatershed Harmony Puppet Show      $1,000.00 \nTotal   $17,350.00 \n \n8. Total Budget for Fourteen Mile/Bakers Creek Watershed  \n    Implementation Plan \n \n   Table 9.8 Fourteen Mile/Bakers Watershed Implementation Plan Total Budget \nItem Cost \nBMPs $460,537 \nTechnical Assistance $35,000 \nEducation/Outreach $17,350 \nTotal $512,887 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 29 \nX. EVALUATION \n \nA. Plan Evaluation Procedure \n \n This watershed implementation plan will be evaluated and revised every three to five \nyears or on an as needed basis.  The evaluation of this plan will be organized by the \nFourteen Mile/Bakers Creek Watershed Implementation Team.  At that time, the WIT will \ndevelop a detailed schedule for review and revision of this watershed implementation plan. \nThe WIT members will be responsible for notifying their stakeholders of the opportunity to \npropose changes to the watershed implementation plan. One month will be allowed for \nnotification of stakeholders. \n   The plan will be evaluated by the team, or their designee, and any interested \nstakeholders. One month will be allowed for evaluation and submittal of comments. \nTherefore, comments will be due two months after the evaluation procedure is initiated. The \nplan will be evaluated in two ways. First, to determine if the plan goals have been achieved, \nand second, to determine if it reflects the current condition of the watershed, state of \nscience, and issues in the watershed. \n \n \nB. Implementation Evaluation Strategy \n \n1. The following measures and indicators of progress will be utilized to track the  \n            success of this plan by MSWCC:  \n \n•  Before and after photo documentation on a representative sample of the BMPs      \n             \n      installed, \n•    Before and after soil loss collection on each BMP installed, and \n•   An R5 Load estimation Model Field Data Entry Sheet   completed on each BMP  \n       installed, \n•  Establishment of two demonstration farms that will be used to  inform the public  \n      about best management practice systems, and \n•  Informational fact sheets will be distributed that highlight the benefits derived  \n      through the installation of Best Management Practices. \n \n\n 30 \n    2.    MDEQ will be responsible for any monitoring at the conclusion of the         \n   project to determine the pollutant reductions achieved by the application of  \n   Best Management Practices in the watershed.   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 31 \nXI. PLAN REVISION \n \nA. Plan Revision Procedure \n \n  After evaluation, MDEQ will prepare a revised watershed implementation plan \nincorporating the changes requested by the reviewers. At this point it may be necessary to \ncall a meeting to reconcile any conflicting comments or requests for change.  \n   If the evaluation criteria are all being met in Fourteen Mile/Bakers Creek surface waters, \nthe watershed implementation plan will be revised to address a different restoration issue \nor issues, or to protect the water quality of the watershed. If the evaluation criteria for the \nwatershed are not being met, the approach for restoring Fourteen Mile/ Bakers Creek \nwatershed will be revised based on the knowledge that has been gained since 2008.  \n   The draft watershed implementation plan will be submitted to the Implementation Team, \nand all others who submitted comments. Within two weeks of receiving the draft watershed \nimplementation plan, the Implementation Team will notify their stakeholders of the \navailability of the revised watershed implementation plan for stakeholder review. One \nmonth will be allowed for review of the draft. Comments will be due at the end of this review \nperiod. \n   Within a month after the comments on the draft watershed implementation plan are \nreceived, the DRAFT watershed implementation plan will be submitted to the \nImplementation Team for review and approval. After the DRAFT watershed implementation \nplan has been approved, the Implementation Team will notify their stakeholders of the \ncompletion and availability of the plan for use as a guide to watershed restoration and \nprotection activities. \n \n \n \n \n \n\n 32 \nXII. RESOURCES \n \nMDEQ. 2006. Designated Streams in HUC 08060202 (lower Big Black River) for \nImpairment Due to Sediment. Big Black River Basin, Mississippi, Mississippi Department of \nEnvironmental Quality. Jackson, Mississippi. \n \nMDEQ 2006 A.  Fecal Coliform TMDL for Fourteen Mile and Bakers Creeks.  Big Black \nRiver Basin, Hinds County, Mississippi, Mississippi Department of Environmental Quality. \nJackson, Mississippi. \n \nMDEQ 2006B.  Stressor Identification Report For Fourteen Mile Creek.  Hinfds County, \nMississippi.  Mississippi Department of Environmental Quality Jackson, Mississippi and \nRay Montgomery Associates, Inc. Brandon, MS. \n \nEPA 2007. Draft TMDL for The Fourteen Mile Creek Watershed In the Big Black River \nBasin of  Mississippi To address Biological Impairment due to Nutrients, Organic \nEnrichment and Low Dissolved Oxygen.  U.S. EPA Region 4 Atlanta, Georgia  \n \nUSDA. SCS. 1979. Soil Survey of Hinds County, Mississippi. \n \n\"Natural Heritage Inventory: Search Animal Database.\" Mississippi Museum of Natural \nScience.  \n<\nhttp://www.mdwfp.com/museum/html/Research/query_animals.asp> \n \n\"Natural Heritage Inventory: Search Plant Database.\" Mississippi Museum of Natural \nScience.  \n<\nhttp://www.mdwfp.com/museum/html/Research/query_plants.asp> \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 33 \n \n \n \n \n \n \n \n \nAppendix A \n \n \n \nPlant and Animal Species of Special \nConcern \n \n \n \n \n \n\n 34 \n \nAnimals of Special Concern in Hinds County \nScientific Name Common Name Threatened Endangered \nACIPENSER OXYRINCHUS \nDESOTOI \nGULF STURGEON X  \nALOSA ALABAMAE ALABAMA SHAD   \nARCIDENS CONFRAGOSUS ROCK POCKETBOOK   \nCYCLEPTUS ELONGATUS BLUE SUCKER   \nGRAPTEMYS OCULIFERA RINGED MAP TURTLE X  \nCYPRINELLA WHIPPLEI STEELCOLOR SHINER   \nELLIPSARIA LIONEOLATA BUTTERFLY   \nOBOVARIA JACKSONIANA SOUTHERN HICKORYNUT   \nETHEOSTOMA RUBRUM BAYOU DARTER X  \nPLEUROBEMA BEADLEIANUM MISSISSIPPI PIGTOE   \nPOLYODON SPATHULA PADDLEFISH   \nGRAPTEMYS \nPSEUDOGEOGRAPHICA KOHNI \nMISSISSIPPI MAP TURTLE   \nHEMIDACTYLIUM SCUTATUM FOUR-TOED SALAMANDER   \nLAMPROPELTIS CALLIGASTER \nRHOMBOMACULAT \nMOLE KINGSNAKE   \nLAMPSILIS CARDIUM PLAIN POCKETBOOK   \nLASIONYCTERIS NOCTIVAGANS   SILVER-HAIRED BAT   \nLASIURUS CINEREUS HOARY BAT   \nLITHASIA HUBRICHTI BIG BLACK ROCKSNAIL   \nNYCTICORAX NYCTICORAX BLACK-CROWNED NIGHT-\nHERON \n  \nOBOVARIA SUBROTUNDRA ROUND HICKORYNUT   \nOBOVARIA UNICOLOR ALABAMA HICKORYNUT   \nPETROCHELIDON PYRRHONOTA   CLIFF SWALLOW   \n \n \n\n 35 \nAnimal Species of Special Concern in Hinds County \n \nScientific Name Common Name Threatened Endangered \nPLETHODON WEBSTERI WEBSTER’S SALAMANDER   \nPLEUROBEMA RUBRUM PYRAMID PIGTOE   \nPOTAMILUS INFLATUS INFLATED HEADSPLITTER X  \nPOTAMILUS OHIENSIS PINK PAPERSHELL   \nQUADRULA CYLINDRICA \nCYLINDRICA \nRABBITSFOOT   \nQUADRULA NODULATA WARTYBACK   \nTRUNCILLA TRUNCATA DEERTOE   \nUNIOMERUS DECLIVIS TAPERED PONDHORN   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n 36 \nPlants of Special Concern in Hinds County \n \nScientific Name Common Name Threatened Endangered \nADIANTUM CAPILLUS-\nVENERIS \nSOUTHERN MAIDENHAIR-FERN \n  \nASARUM CANADENSE CANADA WILD-GINGER \n  \nATHYRIUM \nTHELYPTERIOIDES \nSILVERY SPLEENWORT \n  \nCAMASSIA SCILLOIDES     WILD HYACINTH \n  \nECHINACEA PURPUREA    EASTERN PURPLE CONEFLOWER \n  \nCELASTRUS SCANDENS    CLIMBING BITTERSWEET \n  \nCOELORACHIS \nCYLINDRICA \nPITTED JOINTGRASS \n  \nCRATAEGUS \nCALPODENDRON \nPEAR HAWTHORN \n  \nLILIUM SUPERBUM TURJ’S-CAP LILY \n  \nMAGNOLIA TRIPETALA UMBRELLA MAGNOLIA \n  \nPANAX QUINQUEFOLIUS    AMERICAN GINSENG \n  \nPLATANTHERA \nPERMOENA \nPURPLE FRINGELESS ORCHID \n  \nSCHISANDRA GLABRA SCARLET WOODBINE \n  \nSILENE OVATA OVATE CATCHFLY \n  \nSPIRANTHES OVALIS LESSER LADIES’-TRESSES \n  \nSWERTIA CAROLINIENSIS \nAMERICAN COLOMBO \n  \nTRILLIUM LUDOVICIANUM \nLOUISIANA TRILLIUM \n  \nUTRICULARIA OLIVACEA \nPIEDMONT BLADDERWORT \n  \n \n \n \n \n\n 37 \n \n \n \n \n \n \n \n \n \n \nAppendix B \n \n \n \nFunded 319 Project Proposal \n \n \n \n \n \n \n \n \n\n 38 \nPROJECT TITLE: \nFourteen Mile/ Baker Creek Watershed Agricultural Nonpoint Source Pollution Control Project \n \nPROJECT ABSTRACT: \nThis project will be located in the central portion of Hinds County in central Mississippi. \nThe objectives of this project will be: \n \nTo improve water quality and protect high quality waters by demonstrating the economic \nbenefits and effectiveness of selected BMPs in targeted areas. \n \nTo apply Best Management Practices (BMPs) to agricultural lands in the demonstration project \narea so as to reach the desired outcome of reduced runoff and sedimentation. \n \nTo foster optimal applications of fertilizer (nitrogen, phosphorus, and potassium). \n \nTo inform and educate the public about Best Management Practices that benefit water quality. \n \nThe project cost is $509,537.  Of this amount, $305,723 in 319 funds are requested with the balance of \n$203,814 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nMark E. Gilbert, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax:   (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES: \n \nHinds County Soil and Water Conservation District; USDA Natural Resources Conservation Service; \nMississippi Department of Environmental Quality \n \n\n 39 \nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone: (601) 354-7645 \nFax:   (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nFourteen Mile Baker Creek Watershed (08060202-150) \n(see attachment 1 for a map depicting the targeted demonstration areas of the project) \n \nPROJECT OBJECTIVE: \n \nThe overall objective of this project will be to demonstrate the benefits and effectiveness of selected \nBest Management Practices  (BMPs) on water quality in the Fourteen Mile/Bakers Creek Watershed that \naddress sediment, pesticide and nutrient loadings from agricultural nonpoint sources.  Soils in the \nwatershed are very erosive, with sheet erosion occurring on sloping cropland and pastureland.  The \nState’s 2006 303(d) list of monitored water bodies lists Fourteen Mile Creek and Bakers Creek’s use of \naquatic life support as impaired by biological impairment, nutrients, sediment, organic enrichment and \nlow DO.  The monitored segments listed are MS441FE and MS441BE.  The MS Department of \nEnvironmental Quality (MDEQ) has developed a TMDL for the listed segments of Fourtenn \nMile/Bakers Creek and it has been targeted for implementation by the Big Black Basin team. The \nTMDL model indicates violation of the States water quality standards for fecal coliform.  The model \ncalls for a summertime coliform reduction of 52% for Fourteen Mile Creek and 80% for Bakers Creek \nrespectively. \n \nPROJECT DESCRIPTION: \n \nThis project will implement selected Best management Practices (BMPs) on targeted areas in the \nFourteen Mile/Bakers Creek watershed that will result in reduced pollutant loadings from agricultural \nnonpoint sources. The main water quality problems to be addressed by this project are sediment, \npesticides and nutrients from agricultural nonpoint sources.  Of primary concern is sediment from \nagricultural lands in the watershed.  Erosion is occurring from cropland in the project area at the rate of \n12 tons per acre per year and from pasture land at the rate of 5 tons per acre per year.  Sediment \ncontained in runoff is entering Fourteen Mile Creek and Bakers Creek along with their tributaries \ncausing degradation of the resource base.  In addition, nutrients and pesticides contained in runoff from \nagricultural sources, attached to sediment are posing an increasing water quality problem due to runoff \nfrom agricultural sources.  \nThe erosion of the soil resource base removes nutrients, reduces water holding capacity, undermines \nplant rooting systems, reduces the soil’s organic matter content, reduces soil tilth and degrades water \nquality within the project area.   \n\n 40 \n \nThe current land uses in the Fourteen Mile/ Bakers Creek Watershed include 46,200 acres of cropland, \n53,000 acres of pasture land, 52,020 acres of timber land, and 17,000 acres of urban land. \n \nThis project will be implemented in three phases.  Phase 1 will consist of analyzing existing \nassessment data, determining target areas within the watershed where the stressors are causing the \ngreatest damage and if the application of needed Best Management Practices will yield a beneficial \nreduction in pollutant loadings.  This will be done in conjunction with a Watershed Implementation \nTeam (WIT) that will be form to develop and Watershed Implementation Plan (WIP).  The team will \nconsist of natural resource agency personal as well as landowners who live in the watershed.  The team \ndevelop a plan that includes all resource concerns in the watershed and lists all programs available to \naddress those concerns for the present as well as the near future.  Education and outreach activities will \nalso be conducted during this phase to inform landowners in the watershed about the objectives of the \nproject. The Mississippi Soil and Water Conservation Commission (MSWCC) will cooperate with the \nUnited States Geological Survey, the USDA Natural Resources Conservation Service and the Hinds \nCounty Soil and Water Conservation Districts in identifying the appropriate Best Management Practices \nfor targeted areas in the watershed and educating landowners as to the need for their participation. \n \nPhase 2 will consist of (based upon the finding of phase 1) the application of best management practices \non targeted areas in the watershed that will result in desired pollutant load reductions.  The Mississippi \nSoil and Water Conservation Commission will accomplish this through it’s water quality cost share \nprogram. In this project, records will be kept at both the state level and local level so as to determine the \nprogress being made in carrying the project out and the benefits that are being received as related to the \nimprovement of water quality within the project.  During the planning process with participants, the \namount of soil loss from the area to be treated with a particular BMP will be determined and recorded.  \nThe amount of soil saved as a result of applying the BMP will also be determined and recorded.  \nAdditional information will be collected on each BMP installed in the project that will be provided to \nMDEQ and used to calculate the pollutant load reduction for each BMP installed.  This information will \nindicate the project effectiveness in reducing pollutant loadings.  Participants in the project will be \nrequired to maintain BMPs for a period of up to ten years after installation. \n \nAdditional education and outreach efforts will be conducting during this phase to inform and educate the \npublic about Best Management Practices that benefit water quality.  This will be accomplished by the \nfollowing: \nEstablishing at least 2 demonstration farms to inform the public about best management systems. \nConduct at least 2 field day/tours during the life of the project. \nPrepare and distribute at least 1,000 fact sheets highlighting the benefits derived from the project. \nPublish at least 4 articles about the project in newsletters and local newspapers. \nArrange for Watershed Harmony puppet show at local elementary schools in the watershed \nConduct an anti litter campaign in the watershed that will consist of circulating flyers in the watershed \nForm a watershed “watchdog” group made up of Earth Team Volunteers that will report any potential \npollutant sources( illegal dumping, failing septic systems, ec.) \nErect at least 20 project roadside signs that designate where water quality practices are in progress or \nhave been completed. \n \n\n 41 \nTo address the above stated water quality problems, Best Management Practices (BMPs) will be \ninstalled on agricultural lands in the project area.  Potential BMPs to be installed include but are not \nlimited to: \n180 acres of critical area planting \n100 grade stabilization structures \n60 acres of filter strips \n9,000 feet of terraces \n4,000 feet of diversions \n300 acres of tree planting \n12,000 feet of fencing \n200 acres pasture planting \n \n \nPhase 3 will consist of post BMP monitoring to determine the pollutant load reductions achieved by the \napplication of Best Management Practices.  The MSWCC will coordinate with the MDEQ  and the \nUSGS in conducting these activities. \n \n \n\n 42 \nMILESTONES: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n2. Form the Fourteen Mile/Bakers Creek Watershed Implementation Team (WIT). (Month 1) \n3. Form Watershed “Watchdog” group. (Month 1) \n4. Convene a project kick-of meeting of the newly formed Fourteen Mile/Bakers Creek WIT. \n(Month 2) \n5. Facilitate all Fourteen Mile/Bakers Creek WIT Meetings. (Month 1-36) \n6. Determine priority areas that are contributing significant pollutant loads in the watershed. \n(Month 3-4) \n7. With assistance from the WIT, develop a WIP consistent with MDEQ guidance. (Month 3-6) \n8. Present a draft WIP to MDEQ and the WIT for their review and comments. (Month 7) \n9. Issue policies and procedures for implementing the project to the SWCD office.  \n(Month 1) \n10. Meet with the board of SWCD commissioners to get their understanding of their responsibilities \nand participation. (Month 2) \n11. In conjunction with the local SWCD, establish a locally led watershed advisory group to assist \nwith implementati\n\non activities. (Month 2-3) \n12. Provide training to district staff. (Month 2-3) \n13. Assist in establishing an evaluation system in conjunction with the MS Department of \nEnvironmental Quality to indicate the benefits of the project. (Month 2-3) \n14. Conduct a landowner meeting to inform potential participants about the project.     (Month 3) \n15. Secure commitments from several landowners and operators who are willing to participate in the \nproject. (Month 3-4) \n16. Assist participants in developing a conservation plan and applying best management practices \n(Month 4-12) \n17. Establish at least demonstration farm (Month 4-12) \n18. Conduct an anti-litter campaign in the watershed (Month 4-12) \n19. Arrange Watershed Harmony puppet show for elementary schools in watershed (Month 4-24) \n20. Document pre-existing site conditions. (Month 2-12) (Before and after photo documentation will \nbe conducted). \n21. Accelerate conservation planning and application assistance.  Special effort will be made to \ncomplete conservation plans during this time frame. (Month 13-24) \n22. Conduct at least 1 informational field day/tour to inform the public about the project . (Month \n13-24) \n23. Establish at least 1 demonstration farm. (Month 13-24) \n24. As requested, assist DEQ with evaluations. (Month 0-36) \n25. Collect GPS coordinates and other data required by MDEQ on all BMPs installed in the project. \n(Month 0-36) \n26. Assemble data on the amount of soil saved. (Month 0-36) \n27. Erect project roadside signs which designate where water quality practices are in progress or \nhave been completed. (Month 4-36) \n28. Provide continued conservation planning and application assistance to participants. (Month 25-\n36) \n29. Review the status of applying best management practices to reach the objectives of the project.  \n(Month 25) \n\n 43 \n30. Based upon the needs and finding of milestone 18, assistance in planning and/or application will \nbe redirected and/or accelerated. (Month 25-36) \n31. Publish at least 4 articles about the project. (Month 0-36) \n32. Publicity of the project will be increased; at least 1 field day/tour will be conducted and at least \n1,000 fact sheets will be developed and distributed. (Month 25-36) \n33. Bi-annual reports will be made to MSDEQ. (Month 0-36) \n34. Make Final report to MSDEQ. (Month 36) \n \n\n 44 \n \nCRITERIA FOR EVALUATION \n \nThe following measures and indicators of progress will be utilized to track the success of this project: \n \nNPS Pollutant Load Reduction – the amount of soil saved as a result of the installation of best \nmanagement practices (BMPs) in this project will be a direct indicator of sediment load reduction to \nFourteen Mile Creek and Bakers Creek along with their tributaries.  Since pesticides and fertilizer/plant \nnutrients are transported to the waters as attachments to the sediment, any reduction in sediment \nloadings will result in a reduction of pesticide and nutrient loadings thereby enhancing the effectiveness \nand success of the project. \n \nImplementation of NPS Controls – this project will involve the installation of Best Management \nSystems.  Best Management Systems are defined as a combination of BMPs, both structural and \nvegetative, which are the most practical, effective and economical means of preventing or reducing \npollution from nonpoint sources to a level compatible with water quality goals.  The estimated types \nand numbers of BMPs to be installed as part of  Best Management Systems are listed in the \nproject description of this proposal.  The application of best management systems in the project will \nbe the responsibility of the landowners and operators participating in the project as cooperators of the \nlocal soil and water conservation district. \n \nPublic Education, Awareness, and Action -  this project will include the establishment of at least 2 \ndemonstration farms that will be used to inform the public about best management systems.  These will \nbe utilized during the 2 field day/tours that will be conducted in the project.  Also, at least 1,000 \ninformational fact sheets highlighting the benefits derived from the project will be developed and \ndistributed as well as the publishing of at least 4 articles about the project in newsletters and local \nnewspapers.  At least 20 project roadside sign will be erected where water quality practices are installed \nin the project.   A watershed “watchdog” group made up of NRCS Earth Team Volunteers will report \nany potential pollutant sources to the WIT.  An anti-litter campaign will be conducted in the watershed.  \nThe Watershed Harmony puppet show will be presented to elementary students in the watershed.   Other \neducational actions will be conducted to measure the success of the project.  These include such things \nas increased public awareness; before and after photo documentation; increased cooperation among \nagencies, associations, public bodies and educational institutions; and the economic benefits of applying \nbest management practices.  The Mississippi Soil and Water Conservation Commission will request \ninformation through the local soil and water conservation district that will assist in measuring the \nsuccess of the project in the demonstration area. \n \n \nPROJECT PERIOD \n \nThe length of this project will be 3 years. \n \n \n \n \n \n\n 45 \n \n \n \n \n \n \n \n \n \nAppendix C \n \n \n \nStressors \n\n \n46\n \nTable 2 \nStressor Summary Table \n \nConcern    Link/Immediate \nCause \nStressor\n \nDescription of \nStressor \nLocation/Extent\n \nSediment Loading From \nAgricultural \nLands \nLanduse runoff and  in-channel sediment processes \nSediment \nA stressor identification study \nwas completed for Fourteen Mile/Bakers Creek Watershed.  This analysis identified sediment as the most probable stressor of the waterbody.  Certain contaminants may be associated with sediment such as pesticides and nutrients.  However, these contaminants would also be controlled by the same best management practices (BMPs) that control sediment coming from fields. \nSee figure 3.1 for the locations of cropland along streams. There are approximately 21,700 acres of agriculture land in the watershed.  The majority of this land is cropland. \nAll the lands referred to \nabove are in HUC 03180002. \n       \n\n \n47\n \n \nConcern    Link/Immediate \nCause \nStressor\n \nDescription of \nStressor \nLocation/Extent\n \nNutrient Loading From \nAgricultural \nLands \nDegradation of in-stream biological conditions \nNutrients \nA stressor identification study \nwas completed for Fourteen Mile/Bakers Creek Watershed.  This analysis identified nutrients and organic enrichment as the most probable primary stressor of the waterbody.  Certain contaminants may be associated with sediment such as pesticides and sediment.  However, these contaminants would also be controlled by the same best management practices (BMPs) that control nutrients coming from fields. \nSee figure 3.1 for the locations of cropland along streams. There are approximately 21,700 acres of agriculture land in the watershed.  The majority of this land is cropland. \nAll the lands referred to \nabove are in HUC 03180002. \n  \n\n \n48\n \n \nConcern    Link/Immediate \nCause \nStressor\n \nDescription of \nStressor \nLocation/Extent\n \nLittering \nIncreasing the number of \nsnags and the amount of debris in the creeks and streams \nLitter \nPeople dumping old \nappliances, household trash, old mattresses and other garbage into the creeks and streams from bridges and letting it wash down the creeks and streams when the flow is increased. \nThis occurs throughout the watershed at most bridge sites in rural areas.\n \n\n 49 \n \n \n \n \nAppendix D \n \n \n \n \n \n \n \n \n \nChecklist of Watershed \nImplementation Elements \n\n \n50\n \n Table D. 9 Key Elements of a Watershed Plan for 319\n Grant  \n \nRequired WIP Elements for 319 Grant \n \nLocation in Watershed Implementation Plan\n \n 1. Watershed Description and Background \n Chapter V, Chapter VII Section A \n 2.  Implementation \n Chapter VIII Section A Subsection 3 \n 3. Project Goals \n Chapter VIII Section A Subsections 2 and 5 \n 4. Project Costs \nChapter VIII Section A Subsection 7 Chapter IX Section A Subsection 7, 8 \n 5. Education and Outreach \n Chapter IX \n 6. Implementation Schedule \n Chapter VIII Section A Subsection 4 \n 7. Milestones \n Chapter VIII Section A Subsection 4 \n 8. Adaptations and Revisions \n Chapter X Section A, Chapter XI Section A \n 9. Monitoring \n Chapter X Section B Subsections 1 and 2 \n ",
  "metadata": {
    "id": "fourteen-mile-bakers-creek-watershed-plan-2009",
    "originalName": "fourteen-mile-bakers-creek-watershed-plan-2009.pdf",
    "mergedFrom": [
      "fourteen-mile-bakers-creek-watershed-plan-2009-1.json",
      "fourteen-mile-bakers-creek-watershed-plan-2009-2.json",
      "fourteen-mile-bakers-creek-watershed-plan-2009-3.json",
      "fourteen-mile-bakers-creek-watershed-plan-2009-4.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.683Z",
    "length": 62439
  }
}