{
  "id": "fuller-creek-town-creek-9-key-element-plan-2022",
  "rawText": "\n\nFuller Creek-Town Creek Watershed GY 2022 \n1 \n \nFuller Creek-Town Creek Watershed Plan \n9 Key Element Plan \nHUC 031601011301 \nMWS 8041 \nGY22 Project Area \nVersion 0 (9/25/2022) \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Fuller Creek-Town Creek Watershed is located in Northeast Mississippi in the Tombigbee \nRiver Basin and is part of the larger Blackland Prairie ecoregion (65a).  The watershed lies \nnortheast of the city of West Point in the southern portion of Monroe County and upper portion \nof Clay County covering approximately 20,346 acres.    There are two major streams that run \nthrough the watershed: Town Creek on the western side of the watershed and Fuller Creek on the \neastern side.  Ultimately Fuller Creek drains into Town Creek near the southern border of the \nwatershed.  According to the 2019 National Land Cover Database (NLCD), the landuse within \nthis watershed is comprised of approximately 43% pasture/grassland, 37% cropland, 8% \nwetlands, 6% forestland, and 6% other (water, scrub/barren, and urban) (Figure 1).   \n \nThe water-use classification for all water bodies in this watershed, as established by Regulations \nfor Water Quality Criteria for Intrastate, Interstate, and Coastal Waters (MDEQ, 2021), is for \nFish and Wildlife. Waters with this classification are intended for fishing and propagation of fish, \naquatic life, and wildlife. Waters that that are classified as Fish and Wildlife should also be \nsuitable for secondary contact recreation, which is defined as incidental contact with water \nincluding wading and occasional swimming. The Mississippi Department of Environmental \nQuality (MDEQ) conducts statewide biological monitoring using benthic macroinvertebrates as \nthe indicator to develop a regionally calibrated Index of Biological Integrity (IBI) for wadeable \nstreams. This index, known as the Mississippi Benthic Index of Stream Quality (M-BISQ), is used \nin the biological assessment of the state’s wadeable streams and rivers, and was used to assess \nthe streams in the Fuller Creek-Town Creek Watershed.  \n \nTown Creek has been on Mississippi’s Section 303(d) List of Impaired Water Bodies since 2002. \nTown Creek was assessed as not attaining the aquatic life use due to biological impairment.   The \nstream was originally listed under the water body segment ID MS011T.  The segment ID was \neventually updated to MS804111.  This was done to ensure water body IDs would better \ncorrespond with the finer resolution 12-digit watersheds released by the USGS.  In 2012, Fuller \nCreek (segment MS804112) was assessed as not attaining the aquatic life use for biological \nimpairment.  Both Town Creek and Fuller Creek remain on Mississippi’s Section 303(d) List.    \n\nFuller Creek-Town Creek Watershed GY 2022 \n2 \n \n \nFigure 1: Fuller Creek-Town Creek Watershed Landuse Map \n\nFuller Creek-Town Creek Watershed GY 2022 \n3 \n \nMDEQ has a strong team of scientists and engineers focused on evaluating water quality data \nand identifying stressors in water bodies that have been listed as being biologically impaired \nusing benthic macroinvertebrate community data. When biological community data indicate that \na water body segment is impaired, an investigative stressor identification analysis using strength-\nof-evidence approach is conducted to determine the cause(s) of the impairment. Such causes may \nrange from specific pollutants (e.g. Total Nitrogen) to other causes of pollution such as \nsedimentation, habitat loss or hydrologic alteration. In most cases, nonpoint sources contribute \nto, or are the primary causes of impairment. MDEQ relies upon all available monitoring and \nassessment data and conducts additional monitoring to gather the necessary data and information \nto help determine both the causes and sources of impaired waters. The U.S. Environmental \nProtection Agency (EPA) Stressor Identification Process and Stressor Identification Guidance \nDocument (USEPA, 2000), is used to identify the most probable stressors causing biological \nimpairment thereby providing the information necessary to develop required TMDLs that will \nguide restoration activities. A stressor identification study was conducted on Town Creek and \nFuller Creek in 2022. The results of this analysis indicate that sediment is the primary probable \npollutant causing the aquatic life use impairment to the streams.  \n \nThere are no facilities in the Fuller Creek-Town Creek Watershed with NPDES permits that \ninclude limits for Total Suspended Solids (TSS) which is used as an indicator of sediment \ncontributions from permitted activities.  The pollutant of concern in the watershed is sediment \nfrom land-use runoff.  Certain contaminants may be associated with sediment such as pesticides \nand nutrients. Nonpoint loading of sediment in a water body results from the transport of \nmaterial into receiving waters by the processes of mass wasting, head cutting, gullying, and sheet \nand rill erosion. Sources of sediment include agriculture, silviculture, rangeland, construction \nsites, roads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream \nsources, and historical land use activities and channel alterations. \n \nFigure 2 shows all of the impaired segments in the Fuller Creek –Town Creek Watershed along \nwith the locations of monitoring stations. \n \n\nFuller Creek-Town Creek Watershed GY 2022 \n4 \n \n \nFigure 2: Fuller Creek-Town Creek Watershed Impaired Segments and MDEQ Water \nQuality Monitoring Sites \n\nFuller Creek-Town Creek Watershed GY 2022 \n5 \n \n \nElement b: Expected Load Reduction \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2021) regulation does not include a numerical water quality standard for aquatic life \nprotection due to sediment.  The narrative standard for the protection of aquatic life is used in lieu \nof numeric criteria.  The narrative standard states “...waters shall be free from materials \nattributable to municipal, industrial, agricultural, or other dischargers producing color, odor, \ntaste, total suspended solids, or other conditions in such degree as to create a nuisance, render the \nwaters injurious to public health, recreation, or to aquatic life and wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or impair the waters for any designated uses.” In 2007, \nMDEQ developed a total maximum daily load (TMDL) for waters within HUC 03160101.  The \nFuller Creek-Town Creek falls within the boundaries of HUC 03160101.  This TMDL was used \nto develop load reductions for waters impaired by sedimentation within the larger 8-digit \nwatershed.  The targets in this sediment TMDL were developed to reflect stable stream \nconditions using reference sediment yields.  All sediment yield reductions were developed from \nsuspended sediment concentration data measured at stable streams in the same ecoregion(s).  \nThese reference conditions were established by the USDA’s Channel and Watershed Processes \nResearch Unit (CWPRU) at the National Sedimentation Laboratory (NSL).  Based on the targets \ndeveloped for the sediment TMDL for waters in HUC 03160101, sediment yields in the Fuller \nCreek-Town Creek watershed need to be reduced by 80-84%.  \n \nThe MDEQ will work with agency resource partners to identify and implement BMPs to address \nsediment concerns in the Fuller Creek- Town Creek Watershed. The United States Department of \nAgriculture (USDA) Natural Resource Conservation Service (NRCS) has a list of approved \nBMPs to address sediment issues and this list will be used to identify candidate BMPs in the \nwatershed.  Conservation practices that address sediment often provide an additional benefit in \nthe reduction of nutrients as they attach to sediment particles in run-off.  Practices approved by \nNRCS will be used to identify candidate BMPs in the Fuller Creek-Town Creek watershed.   \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC), the Natural Resource Conservation Service (NRCS), and the local Soil \nand Water Conservation Districts (SWCDs) throughout the state.  These SWCDs are typically \nhoused within USDA Service Centers co-located with NRCS offices.   Routine work within \nthese offices includes regular communication with the local landowners and operators within the \nwatershed as they work to support sign-ups for Farm Bill initiatives.  Technical support staff in \nthese offices actively coordinate with local stakeholders to gauge landowner interest and based \non their expertise, have identified a suite of BMPs that should be effective in addressing \nnonpoint source pollution sources in the Fuller Creek-Town Creek Watershed.   \n \nStaff from MSWCC and the SWCD depend upon assistance from their NRCS partners in \ndetermining landowner interest in the watershed because they are on the farms and in the fields \nwith the landowners, understand the needs at the local level, and have knowledge of unfunded \napplications for federal program assistance which meet Section 319 eligibility requirements.  \n\nFuller Creek-Town Creek Watershed GY 2022 \n6 \n \nBased on their analysis, installation of the following BMPs would mitigate sediment issues in the \nFuller Creek-Town Creek watershed helping the stream recover: grade stabilization structures, \nterraces, critical area planting, livestock watering facilities, cover crops, and the instillation of \ndikes and other water control structures.  Factors considered for determining specific locations \nfor the placement of BMPs included the following attributes based upon best professional \njudgement of trained NRCS, SWCD and MDEQ Staff: \n \n1. Likely water quality benefit; \n2. Willingness of landowners to participate; \n3. Implementation of practices to meet recommended sediment reductions; \n4. Ease of measuring effectiveness of the BMP(s) through monitoring; and \n5. Shorter length of time for anticipated results (i.e., within the grant period). \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project that may contribute match include MSWCC, Monroe and Clay County \nSoil and Water Conservation Districts, NRCS, USGS (monitoring), and/or local landowners and \noperators.  For project implementation, administration, management, and watershed plan \nrevision, as well as hosting and facilitating team meetings, MDEQ plans to work under a \nmemorandum of agreement (MOA) with the MSWCC to implement this project.  Project \npartners provided the funding amounts used to estimate costs for BMP installation.  Below is a \nsummary of estimated costs for potential BMPs and overall project implementation: \n\nFuller Creek-Town Creek Watershed GY 2022 \n7 \n \nCost Estimate: Full Project Implementation \nBMPs Size/Amount \nEstimated \nCost \nGrade Stabilization Structure \n22 each $76,749 \nGrade Stabilization Structure (Check \nDams) 4,010 tns $286,474 \nTank/Trough \n5 each $20,000 \nCover Crops \n1,800 ac $137,862 \nFencing \n11,500 ft $34,500 \nDikes \n1,500 cuyd $7,035 \nPond \n3 each $10,500 \nCritical Area Planting \n27 ac $6,330 \nField Borders \n5 ac $2,040 \nTerraces \n7,200 ft $12,411 \nPasture and Hayland Planting \n250 ac $79,253 \nTechnical Assistance* N/A $30,000 \nEducation and Outreach* N/A $24,000 \nMonitoring*  N/A $33,000 \nProject Management, Implementation, \nCoordination, Plan Revision* \n  $110,000 \nTotal Estimated Cost \n  \n$870,154 \n \nNOTE: Conservation Best Management Practices provide a 40% match at a minimum.  \n* -Denotes fields that are estimated upon two incremental funding cycles of the project  \n \nDue to the magnitude of this project, it will need to be incrementally funded.  In order to fully \naddress all suggested conservation needs in the watershed, this plan recommends funding be \nprovided in two (2) increments.  To maximize education and outreach activities and monitoring \nefforts, MDEQ plans to leverage with existing programs already allocated for funding where \npossible. \n \n\nFuller Creek-Town Creek Watershed GY 2022 \n8 \n \nBelow is the estimated budget for the second incremental funding (Phase 1) of this project: \n \nCost Estimate: Phase 1 Implementation \n \nBMPs Size/Amount \nEstimated \nCost \nGrade Stabilization Structure \n15 each  $52,329 \nGrade Stabilization Structure (Check \nDams) 2,500 tn $178,600 \nDiversions \n6,362 cuyd $23,412 \nCover Crops \n1,100 ac  $84,249 \nCritical Area Planting \n16 ac $3,780 \nTerraces \n2,700 ft $4,131 \nTechnical Assistance N/A $15,000 \nEducation and Outreach N/A $12,000 \nMonitoring  N/A $16,500 \nProject Management, Implementation, \nCoordination, Plan Revision \n  $55,000 \nTotal Estimated Phase 1 Cost \n  \n$445,001 \n \nNOTE: Conservation Best Management Practices provide a 40% match at a minimum. * \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of nonpoint source pollution: agriculture, construction, forestry, on-site \nwastewater disposal, surface mining, urban storm water runoff, and hydrologic modification.  \nAudiences from pre-school to adults throughout the state are reached with a variety of mature, \nwell-designed programs each year. These programs, events, manuals, and literature can be used \nin the watershed project by tailoring them to address pollutants of concern.  A positive approach \nis used to reach the full diversity of people in the community with projects that foster a “sense of \nplace”, a “sense of pride in community”, and a sense of the native plants, animals, and general \necology of their region.  Stakeholders and coordinators work together to participate in problem-\nsolving, brainstorming, plan development, training workshops, soil and water conservation field \ndays and other activities that promote collaboration and ownership of the watershed, as well as \nsolutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/ post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nFuller Creek-Town Creek watershed are listed below: \n\nFuller Creek-Town Creek Watershed GY 2022 \n9 \n \n \n Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe watershed. \n Mobile Classroom Education and Outreach Events - for school ages kindergarten –5\nth\n \ngrade students. \n “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Fuller Creek-Town \nCreek Watershed Implementation Team (WIT) will participate in collaborative meetings. The \npurpose of the meetings will be to identify partners, update the watershed plan, and host field \ndays to showcase the implemented BMPs for the public.  In concert with these WIT meetings, \nand to incentivize stakeholder participation, project funding will be used to purchase food and \nother refreshments for the WIT along with providing support for renting facilities in which to \nhost those events. In accordance with 41 CFR § 301-74.11, light refreshments, meals, and/or \nbeverages are an allowable expense under CWA Section 319, provided a description of the \nagenda, purpose, location, costs, etc., are outlined in an approved 319 grant workplan. At this \ntime the exact number of participants and locations are not known therefore costs have been \nestimated for the purposes of this plan and will be updated. \n \nElement f: Implementation Schedule \n \nIn the event of a Section 319 NPS funding award from MDEQ to support implementation of this \nwatershed-based plan for this HUC 12 sub-watershed, MDEQ, along with support from the \nWatershed Implementation Team and Project Manager (where applicable), will: \n \n1.    Work to develop, execute, and implement a Subgrant Agreement that specifies the roles, \ntasks, requirements, and milestones for project implementation. (Month 1) \n \n2.    Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n \n3.    Work with the Clay and Monroe SWCDs, MSWCC, NRCS, and MDEQ to inform \nlandowners and operators within the watershed about the project and work to secure \ncommitments from priority area landowners and operators who are willing to participate \nin the project.  (Months 1-6) \n \n4.    Work with the local SWCDs, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that are \n\nFuller Creek-Town Creek Watershed GY 2022 \n10 \n \ncontributing significant pollutant loads.  All BMPs shall be installed in accordance with \nthe guidelines developed in the latest edition of the NR\n\nCS Technical Field Manual, or \nother approved guidelines.  (Months 1-36) \n \n5.    Facilitate, in cooperation with MDEQ and other monitoring partners, the completion and \nimplementation of an effective and efficient plan to monitor baseline water quality \nconditions in the watershed and track changes in water quality over time resulting from \nthe BMPs implemented through this project.  (Months 3-36) \n \n6.    Submit blank copies of standard maintenance agreements to MDEQ. (Months 3-36) \n \n7.    Conduct inspections of BMPs during construction (Months 3-36) \n \n8.    Coordinate with and support the local SWCD, MSWCC and NRCS in the collection of \nrelevant GPS coordinates of all installed BMPs and incorporate this information into a \nGIS format.  All geospatial data shall be collected in a manner consistent with the Federal \nGeographic Data committee-endorsed standards.  (Months 3-36) \n \n9.    Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. (Months 3-36) \n \n10.   Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data. (1-36) \n \nElement g: Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nContinue Coordinating with the MDEQ, \nNRCS, MSWCC, USGS, and the Monroe \nand Clay Co. Soil and Water Districts to \ndetermine additional priority areas that are \ncontributing significant pollutant loads to \nFuller Creek-Town Creek Watershed \nTarget priority \nareas for BMPs \nMonths 1-36 \nEstablish Watershed Implementation \nTeam.  \nEstablish WIT \n \nMonth 1-2 \nInitiate watershed monitoring  Baseline condition \nmonitoring \nCompleted using historical \ndata \nMeet with landowners and cooperators to \ncontinue securing commitments to install \nBMPs in priority areas \nLandowner \nCommitment \nMonths 1-36 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 1-36 \n\nFuller Creek-Town Creek Watershed GY 2022 \n11 \n \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection    Months 6-36 \nBegin monitoring to collect data on post-\nBMP water quality \nPost-BMP \nMonitoring \nMonths 40-48 \nImplement the developed education and \noutreach plan \nEducation/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal: Reduce sediment loads entering waters in the Fuller Creek-Town Creek Watershed. \n \nElement h: Load Reduction Evaluation \n \nMississippi’s water quality criteria do not include a water quality standard applicable to aquatic \nlife protection due to sediment. However, a narrative standard for the protection of aquatic life \nwas interpreted to determine an applicable target for sediment TMDLs.  The narrative standard is \nthat waters shall be free from materials attributable to municipal, industrial, agricultural, or other \ndischargers producing color, odor, taste, total suspended solids, or other conditions in such \ndegree as to create a nuisance, render the waters injurious to public health, recreation, or to \naquatic life and wildlife, or adversely affect the palatability of fish, aesthetic quality, or impair \nthe waters for any designated uses.  In lieu of numeric criteria for sediment, monitoring will be \nconducted to collect data on parameters that are considered surrogates for sediment (Total \nSuspended Solids, Total Suspended Sediment, turbidity) and nutrients (chlorophyll-a) along with \nconventional in-situ parameters generally measured to determine aquatic health (e.g., Dissolved \nOxygen, pH, Temperature, Conductivity, Dissolved Solids) will also be obtained. In addition, e. \ncoli monitoring will be conducted. The following thresholds will be used to measure compliance \napplicable with water quality criteria and/or target thresholds: \n \nParameter Threshold \nDissolved Oxygen \nDaily Average of 5.0 mg/L; Instantaneous threshold of 4.0 \nmg/L \nDissolved Oxygen % \nSat. > 70% - < 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous \nthreshold less than 1500 mg/L \nChemical Oxygen \nDemand <50 mg/l \nTurbidity <100 NTU \nTotal Suspended Solids <80 mg/l \nM-BISQ East Bioregion \nAssessment threshold 71.6 (25th percentile of reference \ncondition) \n \n\nFuller Creek-Town Creek Watershed GY 2022 \n12 \n \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying trends in water quality and should provide \ninformation to help determine if the implementation activities are resulting in water quality \nimprovements.  Mississippi uses a calibrated and verified index of biotic integrity to make water \nquality assessment decisions.  This index, the Mississippi Benthic Index of Stream Quality (M-\nBISQ), was originally developed in 2000 and has undergone three recalibration efforts to refine \nthe sensitivity of the index.  As part of the index development process, the state was divided into \nunique bioregions.  Within each bioregion, the index has a defined attainment threshold that is \nused to determine if the biological community measures collected at a site are representative of \ngood water quality that can support a balanced benthic macroinvertebrate community.  If the \nscore is above the attainment threshold for the bioregion, the site is assessed as attaining the \naquatic life use designation.  The Fuller Creek-Town Creek watershed is in the East bioregion \nand the attainment threshold is 71.6.  Along with overall MBISQ scores, the in-stream habitat \nsurveys will also be used to determine change over time.     \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in the Fuller Creek-Town Creek \nwatershed.  In the event data indicate little or no positive change, a Stressor Analysis will be \nconducted to determine if any new or additional stressors are preventing improvements to water \nquality.  If any new stressors are identified, the Watershed Implementation Team will identify \nfuture actions/activities to address those stressors. \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation water quality chemical and biological monitoring \ndata have been compiled from 2001-2021 to serve as baseline data for the project.  Water quality \nmonitoring included water chemistry data (nutrients, suspended solids, oxygen demand, \nchlorides, etc.), in-situ field measurements for such parameters as dissolved oxygen, pH, \ntemperature, specific conductance, and turbidity, as well as biological community monitoring for \nbenthic macroinvertebrates. A list of this historical water quality monitoring in the Fuller Creek-\nTown Creek watershed 031601011301 is provided in the table below and their sample locations \nare shown in Figure 2. Chemistry and in-situ data for this watershed are limited to a single \nmeasurement/sample during winter MBISQ benthic sampling. \n \nStation \nID \nWater \nBody \nSample \nYear(s) \nCollecting \nAgency \nProject     Water \nChem \nIn-\nSitu \nSonde    Benthics \nand/or \nAlgal \n112D52  Fuller \nCreek \n2010, \n2017 \nMDEQ    MBISQ    X    X \n \nX \nTB116 Town \nCreek \n2001, \n2018 \nMDEQ    MBISQ    X    X      X \n\nFuller Creek-Town Creek Watershed GY 2022 \n13 \n \nStation \nID \nWater \nBody \nSample \nYear(s) \nCollecting \nAgency \nProject     Water \nChem \nIn-\nSitu \nSonde    Benthics \nand/or \nAlgal \nTB525   Town \nCreek \n2001, \n2018 \nMDEQ    MBISQ    X    X      X \n \nPost-BMP monitoring locations will be selected using best professional judgment and will be \ntargeted to reflect water quality downstream of BMP activity.  Once BMP installation is \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring \nwill be initiated.  Post BMP monitoring will be conducted in a way that allows for comparison \nwith the pre-implementation data.  Because recovery periods of streams can be dependent on \ntype and amount of BMPs installed, more than 1 year of post BMP data may be needed to \nobserve a change in water quality.  In some cases, it may take 5 or more years to see full benefits \nof BMPs. All data collection efforts will be conducted using trained personnel following \nestablished Standard Operating Procedures and adhering to agency Quality Assurance protocols.   \n \n \n ",
  "metadata": {
    "id": "fuller-creek-town-creek-9-key-element-plan-2022",
    "originalName": "fuller-creek-town-creek-9-key-element-plan-2022.pdf",
    "mergedFrom": [
      "fuller-creek-town-creek-9-key-element-plan-2022-1.json",
      "fuller-creek-town-creek-9-key-element-plan-2022-2.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.687Z",
    "length": 26699
  }
}