{
  "id": "hickahala-creek-watershed-plan",
  "rawText": "\n\n \nHICKAHALA CREEK \nWATERSHED \nIMPLEMENTATION \nPLAN \n \n \n \n \n \n \n \n \n \n \n \n \n \nREVISED \nAugust 10, 2009 \n \n \n \n\n \n2 \nHICKAHALA CREEK WATERSHED \nIMPLEMENTATION PLAN \n \n \n \n \n \n \n \n \nPrepared for \n \nYazoo River Basin Team \nMississippi Department of Environmental Quality \n \n \n \nDeveloped by  \n \nHickahala Creek Watershed Implementation Team \n \n \n \n \n \nPrepared by \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n \nWith additional technical assistance from: \n \nFTN Associates, Ltd. \n3 Innwood Circle, Suite 220 \nLittle Rock, AR 72211 \n \nMississippi Department of Environmental Quality \nOffice of Pollution Control \nP. O. Box 2261 \nJackson, MS 39225 \n \n \n \n \n \n \n \n \n \nREVISED \n \nAugust 10, 2009\n \n \n\n \n3 \n \n \n \n \n \n\n \n4 \nGoals and Actions For Hickahala Creek Watershed In The Coming Basin Management Cycle \n \nReduce organic matter \nloads, nutrient loads, \nachieve state dissolved \noxygen standards, achieve \nFish and Wildlife support \ndesignated use \nMSWCC, SWCDs Improve water quality and protect \nhigh quality waters through the \nimplementation of selected BMPs in \nthe targeted areas of the watershed  \nEntire \nWatershed \n2004-2007 \nMark Gilbert, MSWCC \n601-354-7645 \nTate Co. SWCD \n662-560-9001 ext. 3 \nPanola Co SWCD \n662-578-8045 ext. 3 \nApply Best Management Practices \n(BMPs) to agricultural lands in the \nproject area so as to reach the \ndesired outcome of reduced runoff, \nsedimentation and cattle access to \nthe streams \n2004-2007 \nInform and educate the public about \nBest Management Practices that \nbenefit water quality \n2004-2007 \nMDEQ \nWater Quality sampling \nHickahala \nCreek \n?? Alice Dossett, MDEQ \n601-961-5664 \nMSWCC, USDA \nNRCS, MSU \nCooperative \nExtension Service, \nUSACE \nContinue existing programs and \nprojects related to farmer education, \nBMP implementation, and habitat \nconservation. \nEntire \nWatershed \n2004-2008 Mark Gilbert, MSWCC \n601-354-7645 \nScott Richie, NRCS \n662-560-9001 ext. 3 \nTerry Myers, NRCS \n662-578-8045 ext. 3 \nJudd Gentry, MSU-ES \n662-563-6260 \nRobby Swayze,USACE \n601-631-5154 \n \n \n \n \n \n\n \n \nTABLE OF CONTENTS \nI. MISSION STATEMENTS          8 \nII. HICKAHALA CREEK WATERSHED IMPLEMENTATION TEAM  9 \n A.  Members, Organizations, and Agencies      9 \nIII. HICKAHALA CREEK WATERSHED       10 \n A. Watershed Description       10 \n B. Stakeholder Interests and Concerns     14 \n C. Wildlife Resources          15 \n D. Water Quality        16 \n  1. Standards        16 \n  2. Current Condition       17 \n   a. Surface Water Quality         17 \n   b. Groundwater Resources      17 \n  3. TMDLs        18 \nIV. WATERSHED IMPLEMENTATION PLAN     20 \n A. Goal            20 \n B. Management Actions       20 \n  1. Agricultural BMPs          20 \n   a. Desired Benefits        20 \n   b. Actors        21 \n   c. Activities           21 \n   d. Budget        21 \n   e. Schedule          22 \n  2. Restoration of Bobwhite Quail Habitat    24 \n   a. Desired Benefits        24 \n   b. Actors        24 \n   c. Activities           24 \n   d. Budget        25 \n   e. Schedule          25 \nV. EDUCATION STRATEGY-DESIRED RESULTS    26 \n\n \n5 \n A. Signage         26 \n  1.    Indicators        26 \n  2. Schedule        27 \n  3. Budget        27 \n B. Field Days         27 \n  1. Indicators        27 \n  2. Schedule        27 \n  3. Budget        28 \n C. Fact Sheets          28 \n  1. Indicators        28 \n  2. Schedule        28 \n  3. Budget        28 \n D. Adopt-A-Stream        29 \n  1. Indicators        29 \n  2. Schedule        29 \n  3. Budget        29 \n E. Project Learning Tree       29 \n  1. Indicators        30 \n  2. Schedule        30 \n  3. Budget        30 \n F. Watershed Harmony Puppet Play      30 \n  1. Indicators        30 \n  2. Schedule        30 \n  3. Budget        31 \n G. Storm Drain Marking Project      31 \n  1. Indicators        31 \n  2. Schedule        31 \n  3. Budget        31 \n H. Total Education Strategy Budget       32  \nVI. EVALUATION         33 \n A. Monitoring         33 \n\n \n6 \n B. Assessment of Progress       33 \n C. Plan Evaluation Procedures      33 \n D. Plan Revision Procedure       34 \nVII. REFERENCES         36 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n7 \nLIST OF TABLES \nTable 3.1 Major Soil Associations in Hickahala Creek Watershed   11 \nTable 3.2 Detailed Listing of Stakeholder Concerns     14 \nTable 3.3 Water Quality Criteria for Hickahala Creek Watershed   16 \nTable 3.4 Hickahala Organic Enrichment/Low DO TMDL (MDEQ 2003a)  18 \nTable 4.1 Budget for Hickahala Creek Watershed 319 Project   22 \nTable 5.1    Projected Costs for Signage          27 \nTable 5.2 Projected Costs for Field Days       28 \nTable 5.3 Projected Costs for Fact Sheets      28 \nTable 5.4 Projected Costs for Adopt-A-Stream Workshop    29 \nTable 5.5 Projected Costs for Project Learning Tree     30 \nTable 5.6 Projected Costs for Watershed Harmony Puppet Show   31 \nTable 5.7 Projected Costs for Storm Drain Marking     31 \nTable 5.8 Projected Costs for Education       32 \n \nLIST OF FIGURES \nFigure 3.1 Hickahala Creek Watershed         12 \nFigure 3.2 1993 Land Use in Hickahala Creek Watershed    13 \n \nLIST OF APPENDICES \n \nAPPENDIX A: Natural Heritage Inventory Species of Special Concern \nAPPENDIX B: Stressors \nAPPENDIX C: History of the Hickahala Creek Watershed Implementation Plan \nAPPENDIX D: Checklist of Watershed Implementation Plan Elements \nAPPENDIX E: Section 319 Funded Projects \n \n \n \n \n\n \n8 \n \nI. MISSION STATEMENTS \n \nThe Mississippi Department of Environmental Quality (MDEQ) mission is to \nsafeguard the health, safety, and welfare of present and future generations by \nconserving and improving Mississippi’s environment and fostering wise economic \ngrowth through focused research and responsible regulations. Restoration of Hickahala \nCreek water quality will not only contribute directly to the environmental aspect of \nMDEQ’s mission, but also contribute to economic viability within the watershed. \n The Mississippi Soil and Water Conservation Commission (MSWCC) mission is \nto effectively guide and promote the conservation, development, protection and proper \nutilization of the soil, water and related resources of the state. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n9 \n \nII. HICKAHALA CREEK WATERSHED IMPLEMENTATION \nTEAM  \n  \nA. Members, Organizations and Agencies (Acronyms) \n \nRobin McKay- Mississippi Department of Health (MSDH) \nRoger Whittington- Mississippi Department of Health (MSDH) \nMark Slocum- Tate County Soil and Water Conservation District (SWCD) \nTerry Snider- Natural Resources Conservation Service (NRCS) \nScott Richey- Natural Resources Conservation Service (NRCS) \nTerry Myers- Natural Resources Conservation Service (NRCS) \nWalter Rodgers- Landowner \nHaywood Green- Landowner \nRobert Swayze- United States Army Corp of Engineers (COE)  \nRick Robertson- United States Army Corp of Engineers (COE) \nGeorge Rowland- Resource Conservation and Development (RC&D) \nJudd Gentry- Mississippi State University- Extension Service (MSU-ES) \nReed Morris- City of Senatobia \nRonn Killebrew- Mississippi Department of Environmental Quality (MDEQ) \nPradip Bhowal- Mississippi Department of Environmental Quality (MDEQ) \nLaura Beiser- Mississippi Department of Environmental Quality (MDEQ) \nAndy Whittington- Mississippi Farm Bureau (MFBF) \nMark Gilbert- Mississippi Soil and Water Conservation Commission (MSWCC) \nBrad Shedd- Mississippi Soil and Water Conservation Commission (MSWCC) \nPatrick Vowell- Mississippi Soil and Water Conservation Commission (MSWCC) \n\n \n10 \n  III. HICKAHALA CREEK WATERSHED \n \nA. Watershed Description \n \nHickahala Creek drains approximately 149,190 acres of the Yazoo River basin in \nTate, Panola, and Marshall counties in northwestern Mississippi (Figure 3.1) (MDEQ \n2002a). We estimate that approximately 20,000 people lived in this watershed in 2000 \n(based on Census 2000 data). Portions of the cities of Senatobia, Coldwater, and Como \nare in the Hickahala Creek watershed. Other towns and cities in the watershed include \nBarr and Wyatte. Senatobia is the largest town in the watershed (DeLorme 1998). This \nwatershed is not affected by any communities that are not located in the watershed \nboundaries. In 1993 land use in the watershed was primarily pasture (59%), cropland \n(21%), and forest (15%) (see Figure 3.2) (MDEQ 2002a). This watershed has always \nbeen primarily agricultural, but is starting to become urbanized due to growth of \nsurrounding counties.  \nThe watershed is underlain by thick loess soil. The topography of the watershed \nis gently rolling hills and plains (MDEQ 2000). Table 3.1 is a list of the major soils in the \nwatershed and their characteristics. The watershed is located primarily in the \nMississippi Valley Loess Hills ecoregion, extending to the North Central Hills ecoregion \n(MDEQ 2000, MARIS online mapping accessed 8/10/04). Native vegetation in the \nwatershed includes oak, hickory, magnolia, poplar, red oak, and shortleaf pine (MARIS \nonline mapping accessed 6/26/04). There have been no significant changes to this \nwatershed to this point, but there is talk that the new bypass of Highway 4 will come \nthrough the watershed. \nNamed creeks in the watershed include Hickahala Creek, Senatobia Creek, \nBasket Creek, and Nelson Creek. Two major canals in the watershed are the Old \nSenatobia Canal and the James Wolf Canal. There are numerous small impoundments \nin the watershed (DeLorme 1998). Hickahala Creek is a tributary of Arkabutla Lake. \nApproximately 4,000 acres of wetlands occur along Hickahala Creek (MDEQ 2002a). \nThere are approximately 17 public water supply wells in the watershed (MDEQ 2000). \nPublic water supply is primarily provided from deep, confined aquifers that are generally \n\n \n11 \nprotected from contamination. Home water wells mainly pump from shallow aquifers, \nwhich can be susceptible to contamination (MDEQ 2000). \nTable 3.1. Major soil associations in Hickahala Creek watershed (MARIS online \nmap accessed 8/10/04, SCS  1967). \n \nSoil Association Description \nCollins-Falaya Nearly level, somewhat poor to \nmoderately well drained silty soils \nLoring-Grenada Gentle slope to sloping ridgetops, \nmoderately well drained silty upland soils \nthat have a fragipan \nMemphis Deep, well drained silty soils in the \nuplands, gentle to very steep slopes, \nlocated in the Western part of the county, \nbut not in the Delta \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n12 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3.1. Hickahala Creek watershed\n. \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n13 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3.2. 1993 Land use in Hickahala watershed \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n14 \nB. Stakeholder Interests and Concerns \nHickahala Creek watershed was selected for implementation of restoration activities \nbased on the 303(d) listing of water bodies in the watershed, and the high level of \nstakeholder interest (Appendix C, MDEQ 2004b). Table 3.2 is a listing of stakeholder \nconcerns that includes suspected causes, locations, and extent of the problems identified. \nOrganic enrichment/low DO and pH are excluded from the list of concerns based on the \nresults of the TMDL studies addressing these pollutants (Section 3.2.3). \nTable 3.2. Detailed listing of stakeholder concerns. \n \nConcern: Pathogens in surface water \nCauses: Failing on-site wastewater treatment systems, discharges of untreated \nwastewater from direct pipes and combined storm/sewer system overflows, \nanimals in streams, pasture runoff, failing sewer lines \nLocation: Impairment occurs in Hickahala Creek from headwaters to confluence with \nJames Wolf Creek, and from confluence with Senatobia Canal to Arkabutla \nLake flood pool; in James Wolf Creek from headwaters to confluence with \nHickahala Creek; and in Senatobia Creek from headwaters to confluence \nwith Hickahala Creek \nExtent: \n \n \nConcern: Nutrients \nCauses: \n \n \nPoint source discharges, agricultural runoff, animals in streams, silviculture, \natmospheric deposition, failing septic systems, direct discharges untreated \nwastewaters, failing sewer lines, urban runoff, catfish pond discharges \nLocation: \n \n \nPotential for impairment in Hickahala Creek from Senatobia north outfall to \nheadwaters, and in Senatobia Creek from headwaters to confluence with \nHickahala Creek \nExtent: Over 17 miles of Hickahala Creek, and over 13 miles of Senatobia Creek \n \nConcern: Sedimentation \nCauses: \n \nSoil and stream bank erosion on all lands and streams in the watershed due \nto the highly erodable nature of the soils in the watershed \nLocation: All land located in the watershed \nExtent: Entire watershed \n \nConcern: Water infiltration into sewer system and storm water \nCauses: \n \nBroken pipes through manholes, water running off rooftops, and impervious \nsurfaces  \nLocation: Urban areas in the city limits of Senatobia \nExtent: City of Senatobia \n\n \n15 \n \nConcern: Closed landfills and illegal dumping \nCauses: \nOld unidentified landfills covered up and water filtering through the trash \ncarrying contaminants into the groundwater    \nLocation: Occur in different sites and some that are not identified \nExtent: Entire watershed \n \nConcern: Flooding of low lying areas (wells) \nCauses: \n \nWater wells that have been drilled in low lying areas that are in flood plains \nflooding and contaminating the wells and the aquifer   \nLocation: Occur in the rural areas due to no community water \nExtent: Entire watershed \n \nConcern: Kudzu \nCauses: \n \nLocation: Located on most rural land in the watershed \nExtent: Entire watershed \n \nConcern: Beaver Control \nCauses: \nDisturbing the flow of water causing backups and flooding of low lying areas \nkilling timber and flooding other agricultural lands \nLocation: Creeks, streams and roadside ditches in the rural areas \nExtent: Entire watershed \n \nConcern: Loss of Quail Habitat \nCauses: Herbicide drift, Invasive weed species, and urbanization \nLocation: Located in all areas of the watershed \nExtent: Entire watershed \n \n \nC. Wildlife Resources \nThe important recreational species in the watershed include deer, turkey, all \nsmall game, bream, catfish, crappie, and largemouth bass. These species and their \nhabitat occur throughout the watershed. No threatened or endangered species are \nlisted for Tate or Panola Counties in the Mississippi Natural Heritage Inventory \n(http://museum.mdwfp.com/science/ms_endangered_species.html\n, 6/29/04). There are \nthree plant species included in the Natural Heritage Inventory as species of special \nconcern for Tate County, but no animal species of special concern. Several plant and \n\n \n16 \nanimal species are included in the Natural Heritage Inventory as species of special \nconcern for Panola County \n(http://museum.mdwfp.com/science/ms_endangered_species.html, 08/25/09). A list of \nthe Species of Special Concern by county is given in Appendix A. \n \nD. Water Quality \n1.   Standards \nThe designated use class for all surface waters of this watershed stated in the \nMississippi water quality regulations is Fish and Wildlife Support. Designated beneficial \nuses for these waters are Aquatic Life Support and Secondary Contact Recreation \n(http://www.deq.state.ms.us/MDEQ.nsf/page/WMB_yazoodesignate?OpenDocument). \nTable 3.3 lists the numeric water quality criteria applicable to Hickahala Creek \nwatershed surface waters (MDEQ 2002). \nTable 3.3. Water quality criteria for Hickahala Creek watershed. \n \nParameter Criteria \nDissolved Oxygen 5.0 mg/L daily average, 4.0 mg/L instantaneous \nPH Between 6.0 and 9.0 su \nTemperature 32.2 deg C \nFecal coliform May – October: geometric mean of 200 per 100 mL, \n400 per 100 mL less than ten percent (10%) of the \ntime during a 30 day period. \nNovember – April: geometric mean of 2000 per 100 \nmL, 4000 per 100 mL less than ten percent of the time \nduring a 30 day period. \nSpecific conductance 1000 uohms/cm \nDissolved Solids 750 mg/L monthly average, 1500 mg/L instantaneous \n \nMississippi’s water quality standard for sediment is narrative and reads as \nfollows: “Waters shall be free from materials attributed to municipal, industrial, \nagricultural or other discharges producing color, odor, taste, total suspended or \ndissolved solids, sediment, turbidity, or other conditions in such degree as to create a \nnuisance, render the waters injurious to public health, recreation or to aquatic life and \nwildlife or adversely affect the palatability of fish, aesthetic quality, or impair the waters \nfor any designated use” (MDEQ 2002). \n\n \n17 \nMDEQ uses an Index of Biotic Integrity (M-BISQ) to determine if water bodies are \nachieving their aquatic life support designated use (MDEQ 2003). The aquatic life \nsupport attainment threshold M-BISQ score for the bioregion associated with Hickahala \nCreek is 52.29. \n \n2. Current Condition \na. Surface Water Quality \nThere is not a MDEQ ambient monitoring site on Hickahala Creek nor its \n tributaries. However, MDEQ, as well as the Corps of Engineers, US Geological \n Survey, and USDA-ARS have conducted water quality studies on Hickahala, \n James Wolf, and Senatobia Creeks. Information on the sampling dates and \n parameters sampled by the various agencies at various locations in the \n watershed is provided in the Yazoo River Basin Compendium of Water Quality \n Information (MDEQ 2003) and in the TMDL for Hickahala, James Wolf, and \n Senatobia Creeks (MDEQ 2002a, 2003a). \nSegments of Hickahala, James Wolf, and Senatobia Creeks were placed on the \n 1998 Section 303(d) list for impairment of aquatic life support and secondary \n contact recreation designated uses. For Hickahala and Senatobia Creeks \n pollutant issues noted in the 303(d) list included nutrients, organic \n enrichment/low DO, biological impairment, sediment/siltation, metals, pH, \n pesticides, and pathogens. For James Wolf Creek, pollutant issues noted in the \n 303(d) list included nutrients, organic enrichment/low DO, pesticides, \n sediment/siltation, pH, and pathogens. In the 2002 303(d) list, these segments \n are slated for removal from the 303(d) list due to completion of TMDL studies, \n and reevaluation of data indicating no impairment (MDEQ 2004a). \n \nb. Groundwater Resources \nThe majority of drinking water use in this watershed is supplied by groundwater \n from the deep aquifer. Irrigation water comes primarily from the shallow aquifer \n (MDEQ 2000). No issues have yet been raised with regard to the quality or \n quantity of groundwater in this watershed. \n \n\n \n18 \n3.   TMDLs \n Segments of Hickahala, James Wolf, and Senatobia Creeks were included \n on the 1998 303(d) list (MDEQ 2002, 2003a). Total maximum daily load studies \n (TMDLs) related to these listed segments have been completed, addressing \n several of the listed parameters. \n A TMDL addressing organic enrichment/low dissolved oxygen and \n nutrients has been completed and approved by U.S. EPA (MDEQ 2003a). There \n are currently no numeric criteria for nutrient concentrations in Mississippi surface \n waters, so a TMDL for nutrients was not developed. However, nutrient \n contributions to oxygen demand were included in the dissolved oxygen analysis. \n Table 3.4 lists the target total maximum daily loads for the Hickahala Creek \n watershed. Estimated existing TBODu load to the watershed is approximately an \n order of magnitude less than the TMDL shown in Table 3.4, therefore, no \n reductions in oxygen demand load were recommended for the watershed (MDEQ \n 2003a). \n \nTable 3.4 Hickahala organic enrichment/low DO TMDL (MDEQ 2003a). \n \nLoad Type \nLoad \n(lbs/day TBODu) \nWaste Load \nAllocation \n683.2 \nLoad Allocation 678.8 \nMargin of Safety (explicit) \nTMDL 1317.0 \n \n \n A TMDL addressing pathogens in Hickahala, James Wolf, and Senatobia \n Creeks has also been completed and approved by U.S. EPA. Both point and \n nonpoint sources pathogen sources are of concern in the listed stream \n segments. Potential nonpoint pathogen sources that were considered in the \n study included failing septic systems, animal access to streams, direct \n discharges of untreated wastewater, runoff from urban areas, and failing sewer \n lines. Waste load allocations were set based on the assumption that NPDES \n permitted discharges will be treated to meet water quality standards for fecal \n\n \n19 \n coliform at the end of pipe. Load allocations were set using a load duration curve. \n Approximately 50% to 76% reductions in fecal coliform loads were recommended \n in the TMDL study (MDEQ 2002a). \n A TMDL addressing low pH in Senatobia Creek has been completed and \n approved by U.S. EPA. The TMDL study did not identify specific sources causing \n the low pH conditions, but suggested that this could be a natural condition. The \n TMDL recommended that any future NPDES permits and nonpoint source \n discharges meet the state pH water quality standards (MDEQ 2003c). \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n20 \nIV . WATERSHED IMPLEMENTATION PLAN \n \nA. Goal \n    The underlying principle of this watershed implementation plan (and the Basin \nManagement Program itself) is adaptive management. The goals and objectives of this \nplan reflect this principle. The goal for this watershed implementation plan is to reduce \npathogen loads to the water bodies in the watershed included on the 1998 303(d) list so \nthey will attain their designated uses of Aquatic Life Support and Secondary Contact \nRecreation, and achieve the state water quality standards within five years. Goals \nrelated to other existing or potential issues in this watershed will be included in future \nimplementation plans for this watershed. The following actions will need to be taken to \nmeet the watershed implementation plan goal: \n \n• Agriculture Best Management Practices (BMPs) \n• Restoration of Bobwhite Quail Habitat \n \nB. Management Actions \n Below are detailed descriptions of management actions planned for the \nnext basin management cycle. Note that the values shown for load reductions, number \nof management practices to be installed, and costs are planning estimates and subject \nto change. \n \n1. Agriculture BMPs \n \na. Desired Benefits \n The objective of this action is to apply best management practices to \n agricultural lands in the watershed that will result in reduced nonpoint source \n pollutant loadings. \n \n\n \n21 \nb. Actors \n The Mississippi Soil and Water Conservation Districts, Mississippi State \n University Cooperative Extension Service, USDA Farm Services Agency, and \n Natural Resources Conservation Service are potential sources of technical \n assistance related to these practices. Landowners, Natural Resources \n Conservation Service, and Soil and Water Conservation Districts will bear \n primary responsibility for getting these measures installed.  \n \nc.  Activities \n A project has been funded under Section 319 of the Clean Water Act for \n the installation of Best Management Practices on agricultural lands in the \n watershed. This project is being implemented by the Mississippi Soil and Water \n Conservation Commission. The estimated numbers and types of BMPs to be \n installed are contained in the 319 project workplan included in Appendix E. \n BMPs will be installed on selected sites determined by current land use maps \n and the willingness of landowners to participate. The installation and \n maintenance of installed BMPs will be the responsibility of the landowners. A \n number of practices are eligible for funding in the watershed through the USDA \n Environmental Quality Incentives Program (EQIP). The estimated funding from \n EQIP over the next 3 years is $250,000. \n(http://www.ms.nrcs.usda.gov/programs/MS%20CountyEQIP%20Information.html\n).    \n \nd. Budget \n  The following budget will be used for the implementation of the Hickahala \n Creek Watershed 319 Project. MSWCC will implement the project on the state \n level. The Tate and Panola County Soil and Water Conservation Districts will \n implement the project on the local level. \n \n \n \n \n \n\n \n22 \nTable 4.1 Budget for Hickahala Creek Watershed 319 Project  \n \nBest Management \nPractice \nUnit Cost Number of Units Total Cost \nCritical Area \nPlanting \n$250/acre 100 acres $25,000 \nGrade Stabilization \nStructure \n$1,700/ea 70 structures $119,000 \nDiversions \n$1.66/ft 20,000 feet $33,200 \nPonds \n$2,500/ea 22 ponds $55,000 \nTree Planting \n$122.20/ac 1,500 acres $183,300 \nStream Crossing \n$6,000/ea 20 crossings $120,000 \nWater and \nSediment Control \nBasin \n$2,500/ea 50 basins $125,000 \nFencing \n$.80/ft 100,000 feet $80,000 \nPasture and \nHayland Planting \n$160/ac 400 acres $64,000 \nTotal   $804,500 \n \n \ne.  Schedule \n  This project began in 2004 and is scheduled to end in August 2007. The \n following milestones have been developed for the project: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n2. Issue policies and procedures for implementing the project to the SWCD office.  \n(Month 1) \n3. Meet with the board of SWCD commissioners to get their understanding of their \nresponsibilities and participation. (Month 2) \n4. In conjunction with the local SWCD, establish a locally led watershed advisory \ngroup to assist with implementation activities. (Month 2-3) \n5. Provide training to district staff. (Month 2-3) \n\n \n23 \n6. Assist in establishing an evaluation system in conjunction with the MS \nDepartment of Environmental Quality to indicate the benefits of the project. \n(Month 2-3) \n7. Conduct a landowner meeting to inform potential participants about the project.  \n(Month 3) \n8. Secure commitments from several landowners and operators who are willing to \nparticipate in the project. (Month 3-4) \n9. Assist participants in developing a conservation plan and applying best \nmanagement practices. (Month 4-12) \n10. Establish at least one demonstration farm. (Month 4-12) \n11. Document pre-existing site conditions. (Month 2-12) (Before and after photo \ndocumentation will be conducted). \n12. Accelerate conservation planning and application assistance. Special effort will \nbe made to complete conservation plans during this time frame. (Month 13-24) \n13. Conduct at least one informational field day/tour to inform the public about the \nproject. (Month 13-24) \n14. Establish at least one demonstration farm. (Month 13-24) \n15. As requested, assist MDEQ with evaluations. (Month 0-36) \n16. Assemble data on the amount of soil saved. (Month 0-36) \n17. Erect project roadside signs which designate where water quality practices are in \nprogress or have been completed. (Month 4-36) \n18. Provide continued conservation planning and application assistance to \nparticipants. (Month 25-36) \n19. Review the status of applying best management practices to reach the objectives \nof the project. (Month 25) \n20. Based upon the needs and finding of milestone 18, assistance in planning and/or \napplication will be redirected and/or accelerated. (Month 25-36) \n21. Publish at least four articles about the project. (Month 0-36) \n22. Publicity of the project will be increased; at least one field day/tour will be \nconducted and at least 1,000 fact sheets will be developed and distributed. \n(Month 25-36) \n\n \n24 \n23. Bi-annual reports will be made to MDEQ. (Month 0-36) \n24. Make Final report to MDEQ. (Month 36) \n \n \n  MSWCC will conduct routine BMP inspections in conjunction with MDEQ \nto ensure the project is progressing in a timely manner and to ensure that installed \nBMPs are being maintained properly. \n \n \n \n2. Restoration of Bobwhite Quail Habitat \n \n a. Desired Benefits \n  The objective of this action is to increase the habitat of the Northern \n Bobwhite Quail with the installation of Habitat Buffers for Upland Birds. The loss \n of quail habitat has caused a large decline in the population numbers of quail. \n The loss of habitat is being contributed to urbanization, loss of native grasses, \n intensive agriculture, and a transitioning of once grassy fields into forests. \n \n b. Actors \n  The Mississippi Department of Wildlife, Fisheries, and Parks; Mississippi \n Fish and Wildlife Foundation; Delta Wildlife Inc.; Mississippi State University, \n Forest and Wildlife Research Center; USDA Farm Service Agency; USDA \n Natural Resources Conservation Service; US Fish and Wildlife Service; and \n Wildlife Mississippi are potential sources of technical assistance related to this \n management action. Landowners, USDA Natural Resources Conservation \n Service, and USDA Farm Service Agency bear the primary responsibilities for the \n installation of these buffers. \n \n c. Activities \n  The USDA Farm Service Agency has a conservation practice available \n called CP33: Habitat Buffers for Upland Birds that is available to farmers across \n\n \n25 \n the state of Mississippi. This practice provides food and cover for bobwhite quail \n in cropland areas. This conservation practice involves natural regeneration of \n native grasses and forbs or planting of native warm season grasses, legumes, \n wildflowers, and limited shrub and tree planting. This Conservation Practice is \n limited to 9,400 acres statewide and is on a first come, first served basis if the \n criteria for the program are met. \n \n d. Budget \n  The actual cost for this conservation practice will vary for each landowner \n and situation. There are cost share and incentive payments available with this \n conservation practice. The cost share and incentives are as follows: \n \n - Signing incentive payments of up to $100 per acre, \n - Annual rental payments and maintenance costs, \n (receive rental payments for ten years; the payment is a weighted average of the    \n   county specific rental rate for comparable land, plus practice maintenance) \n - Cost-share of up to 50% of eligible reimbursable practice costs,  \n - Practice incentive payments of up to 40% of eligible establishment cost. \n \n e. Schedule   \n  The sign-up for this conservation practice ends December 31, 2007 or \n when all 9,400 acres in the state of Mississippi have been enrolled into the \n program. \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n26 \nV.     EDUCATION STRATEGY-DESIRED BENEFITS \nThe overall objective of community education in the Hickahala Creek watershed \nis to develop an atmosphere that promotes sustained, long-term protection and \nimprovement of aquatic resources in the watershed. Specific objectives of education \nefforts in the watershed include the following: \n \n• Increase public awareness of the value of clean water. \n• Increase public awareness of how common activities affect water quality \nand critical flora and fauna. \n• Increase public awareness of how BMPs can be used to reduce negative \nwater quality and habitat affects. \n• Increase public awareness of the long term environmental and economic \nadvantages of protecting and improving water quality and habitat in the \nHickahala Creek watershed. \n• Reduce organic matter loads, nutrient loads, achieve state dissolved \noxygen standards, and achieve Fish and Wildlife support designated use. \n \n \nA. Signage \n Signs identifying the BMPs   that have been installed will be erected in \n areas where they will be visible and landowners will allow the signs to be \n erected. \n Primary partners- Mississippi Soil and Water Conservation Commission,       \n Mississippi Department of Environmental Quality, Panola County Soil and   \n Water Conservation District, Tate County Soil and Water Conservation   \n District,  Natural Resources Conservation Service, and Environmental   \n Protection Agency. \n 1. Indicators \n  There will be field days held to show other landowners and the  \n   interested these BMPs and participants will be counted at these  \n   field days. \n  \n \n\n \n27 \n 2. Schedule \n  The BMP signs will be erected as practices are completed and the  \n  signs are requested by the landowners throughout the life of the project. \n 3. Budget  \nTable 5.1 Projected Costs   for Signage. \nItem Unit Cost Total Cost \nSigns 20 $25.00 $500.00 \nTotal   $500.00 \n \n \nB. Field Days \n  There will be at least two field days held to highlight the BMPs that \n have been installed during the project period. This will allow other landowners \n and the interested public to view some of the practices that are being installed to \n benefit water quality in the watershed. \n \n Primary partners- Mississippi Soil and Water Conservation Commission,       \n Mississippi Department of Environmental Quality, Panola County Soil and   \n Water Conservation District, Tate County Soil and Water Conservation   \n District,  Natural Resources Conservation Service ,and  Environmental   \n Protection Agency \n 1. Indicators \n  Attendance at these field days will be documented and reported to  \n  MDEQ. \n 2. Schedule \n  Field days in the watershed will take place in 2006-2007. \n  \n \n \n \n \n\n \n28 \n 3. Budget \nTable 5.2 Projected Costs   for Field Days. \nItem Units Cost Total Cost \nEvent Flyers 100 .30/each $30.00 \nMailing/Delivery 100 .39/each $39.00 \nMiscellaneous 1 $950.00 $950.00 \nTotal   $1,019.00 \n \n \n C. Fact Sheets \n A fact sheet will be developed at the end of the project. This   \n fact sheet will contain information about the watershed, the number and      \n type of BMPs that were installed, the number of tons of soil being saved, and the \n number of acres impacted by the BMPs. \n \nPrimary Partners- Mississippi Soil and Water Conservation Commission, Tate \n County Soil and Water Conservation District, Panola County Soil and Water \n Conservation District, and Natural Resources Conservation Service. \n 1. Indicators \n  Fact sheets will be handed out at the final field day and will     \n  also be available in the district offices.  \n 2. Schedule \n  The fact sheet will be developed once all BMPs are in place   \n  to get a total on all tons of soil saved and the correct number of BMPs  \n  installed. \n 3.  Budget   \nTable 5.3 Projected Costs for Fact Sheets. \nItem Unit Cost Total Cost \nPrinting 1,000 .30/each $300.00 \nTotal   $300.00 \n \n\n \n29 \nD. Adopt-A-Stream \n Adopt-A-Stream is a program that promotes environmental stewardship \n through training workshops outdoor field activities, and by introducing \n participants to watershed action projects. One and Two-day workshops inform \n participants about watershed topics such as stream health, stream ecology, \n aquatic life and water chemistry.  \n \nPrimary Partners- Mississippi Department of Environmental Quality and \n Mississippi Wildlife Federation. \n 1. Indicators \n  The number of participants for the workshop will be documented.  \n  Also, the number of participants that move forward with the stream   \n  stewardship project will be documented. \n 2. Schedule \n  This workshop will take place before August 2007. \n 3. Budget \nTable 5.4 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total Cost \nAdopt A Stream Workshop 1 day workshop $1,500.00 $1,500.00 \nTotal   $1,500.00 \n \n \nE.   Project Learning Tree \n Project Learning Tree (PLT) is an award winning education program \n designed for teachers and other educators, parents, and community leaders \n working with youth from pre-K to 8\nth\n grade. PLT activity guides and modules are \n not sold, but are earned by educators who attend a six-hour workshop. The PLT \n activity guide is a 400 page book containing 96 activities written in the form of \n lesson plans. PLT’s goal is to “teach students HOW to think, not WHAT to think \n about environmental issues.” \n  \n\n \n30 \nPrimary Partners- Mississippi Department of Environmental Quality and \n Mississippi Forestry Commission. \n 1.    Indicators \n  The number of participants for the workshop will be documented.  \n 2. Schedule \n  This workshop will take place before August 2007. \n 3. Budget \nTable 5.5 Projected Costs for Project Learning Tree. \nItem Unit Cost Total Cost \nPLT Workshop 1 workshop $1,350.00 $1,350.00 \nTotal   $1,350.00 \n \nF. Watershed Harmony Puppet Show \n Watershed Harmony is a musical puppet performance aligning with  the \n fourth and fifth grade Mississippi Framework and National Science Standards. \n Audiences of all ages will delight in environmental stewardship through this toe \n tapping musical. Performances are not only enjoyed by school groups, but also \n by adults attending teacher workshops, civic clubs, and conferences. This \n program serves to inform, excite, and enlist the help of citizens in an ongoing \n effort to promote water quality in their communities. \n \nPrimary Partners- Mississippi Department of Environmental Quality and Bayou \n Town Productions. \n1. Indicators \nThe number of participants will be documented and submitted to MDEQ.  \n2. Schedule \n Watershed Harmony was presented on May 10, 2006 at Northwest \n Mississippi Community College in Senatobia, Mississippi. There were 450 \n students present and 20 teachers for the performance.  \n \n \n\n \n31 \n3. Budget \nTable 5.6 Projected Costs for Watershed Harmony Puppet Show \n Item Unit Cost Total Cost \nWatershed Harmony Puppet Show 1 show $500.00 $500.00 \nTotal   $500.00 \n \nG.    Storm Drain Marking Project \n The Storm Drain Marking Project is a project where storm drains in  urban \n areas are labeled to make people aware of where the water and trash \n thrown down goes. There are also door hangers given to homeowners in the \n area to create awareness of the project and explains some of the things they can \n do as homeowners to help keep our water clean. \n \nPrimary Partner- Mississippi Department of Environmental Quality. \n1. Indicators \n The number of participants participating in the storm drain marking, the \n number of storm drains marked, a map with the storm drain locations \n marked, and a record of trash collected at the storm drains will be recorded. \n2. Schedule \n This project will take place before August 2007. \n3. Budget \nTable 5.7 Projected Costs for Storm Drain Marking. \nItem Unit Cost Total Cost \nStorm Drain Marking 1 Project $500.00 $500.00 \nTotal   $500.00 \n \n \n \n \n \n \n\n \n32 \nH. Total Education Strategy Budget \nTable 5.8 Projected Costs for Education. \nItem Unit Cost Total Cost \nSignage   $500.00 \nField Days   $1,019.00 \nFact Sheets   $300.00 \nAdopt-A-Stream   $1,500.00 \nProject Learning Tree   $1,350.00 \nWatershed Harmony Puppet Show   $500.00 \nStorm Drain Marking Project   $500.00 \nTotal   $5,669.00 \n \n   \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n33 \nVI. EVALUATION \n \nA. Monitoring \n The monitoring that will take place on this project will include the following: \n• Before and after photo documentation on a representative sample \n of the BMPs installed, \n• Before and after soil loss collection on each BMP installed, and \n•  An R5 Load estimation Model Field Data Entry Sheet completed \n on each BMP installed.  \n \nB. Assessment of Progress  \n Agencies responsible for implementing management activities will track \n implementation and provide annual reports to the Basin Group II Coordinator. \n Progress will be assessed based on meeting the scheduled management activity \n milestones outlined in Chapter IV. Success of Section 319 funded projects in the \n watershed will be evaluated based on the criteria specified in the project \n proposals (Appendix E). \n During 2008, the Assessment year of the Basin Group II Basin \n Management Cycle, progress towards the goals of this watershed \n implementation plan will be assessed. Water quality data, as well as information \n on activities occurring in the watershed and stakeholder concerns collected \n during the period from 2004 through 2007, will be utilized. The criterion that will \n be used to determine progress toward plan goals is achievement of all state \n water quality criteria in previously impaired stream segments. Not meeting this \n criterion warrants investigation of the effectiveness of implementation of \n management practices, and/or the effectiveness of the management practices. \n \nC. Plan Evaluation Procedure \n This watershed implementation plan will be evaluated and revised every \nfive years or on an as needed basis. The evaluation of this plan will be organized \nby the Hickahala Creek Implementation Team (see Chapter II). At this time, the \nImplementation Team will develop a detailed schedule for review and revision of \n\n \n34 \nthis watershed implementation plan. The Implementation Team members will be \nresponsible for notifying their stakeholders of the opportunity to propose changes \nto the watershed implementation plan. One month will be allowed for notification \nof stakeholders. \n The plan will be evaluated by the Team, or their designee, and any \n interested stakeholders. One month will be allowed for evaluation and submittal \n of comments. Therefore, comments will be due two months after the evaluation  \n procedure is initiated. The plan will be evaluated in two ways. First, to determine \n if the plan goals have been achieved, and second, to determine if it reflects the \n current condition of the watershed, state of science, and issues in the watershed.  \n \nD. Plan Revision Procedure \n After evaluation, MDEQ will prepare a revised watershed implementation \n plan incorporating the changes requested by the reviewers. At this point it may \n be necessary to call a meeting to reconcile any conflicting comments or requests \n for change.  \n If the evaluation criteria are all being met in Hickahala Creek surface \n waters, the watershed implementation plan will be revised to address a different \n restoration issue or issues, or to protect the water quality of the watershed. If the \n evaluation criteria for the watershed are not being met, the approach for restoring \n Hickahala Creek watershed will be revised based on the knowledge that has \n been gained since 2004.  \n The draft watershed implementation plan will be submitted to the \n Implementation Team, and all others who submitted comments. Within two \n weeks of receiving the draft watershed implementation plan, the Implementation \n Team will notify their stakeholders of the availability of the revised watershed \n implementation plan for stakeholder review. One month will be allowed for review \n of the draft. Comments will be due at the end of this review period. \n Within a month after the comments on the draft watershed implementation \n plan are received, MDEQ will prepare a DRAFT watershed implementation plan. \n The DRAFT watershed implementation plan will be submitted to the \n\n \n35 \n Implementation Team for review and approval. After the DRAFT watershed \n implementation plan has been approved, the Implementation Team will notify \n their stakeholders of the completion and availability of the DRAFT plan for use as \n a guide to watershed restoration and protection activities. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n36 \nVII. REFERENCES \n \nDeLorme. 1998. Mississippi Atlas and Gazette. Yarmouth, Maine. \nFreedman, P.L., W.M. Larson, D.W. Dilks, D. Schechter, A. Nemura, T. Naperala, J.V. \nDePinto, M.G. Prothro, G.W. Boese, A. Dettelbach, L. Notham, K. Thornton, D. \nFord, P. Massirer, K.B. Stevens, J.A. Sobrinho. 2003. Navigating the TMDL \nProcess: Evaluation and Improvements. 00-WSM-1. Water Environment \nResearch Foundation. \nMDEQ. 2003. Yazoo River Basin Compendium of Water Quality Information 2003. \nMississippi Department of Environmental Quality. Jackson, Mississippi. \nMDEQ. 2004a. Mississippi 2002 Section 303(d) List of Water Bodies. Mississippi \nDepartment of Environmental Quality. Jackson, Mississippi. \nMDEQ. 2002. Mississippi Commission on Environmental Quality Regulation WPC-2: \nWater Quality Criteria for Intrastate, Interstates, and Coastal Waters. Mississippi \nDepartment of Environmental Quality. Jackson, Mississippi. \nMDEQ. 2002a. Fecal Coliform TMDL for Hickahala Creek, Yazoo River Basin, Panola \nand Tate Counties Mississippi. Mississippi Department of Environmental Quality. \nJackson, Mississippi. \nMDEQ. 2001. Mississippi’s Fish Tissue Advisories and commercial Fishing Bans August \n2001.  \nMDEQ. 2000. Yazoo River Basin Status Report 2000. Mississippi Department of \nEnvironmental Quality. Jackson, Mississippi. \nSCS (USDA Soil Conservation Service). 1967. Soil Survey of Tate County, Mississippi. \nSCS. Natural Resources Conservation Service.1999.Soil Survey of Panola County, \nMississippi. \n. \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n37 \n \n \n \n \n \n \n \n \n \n \n \nAPPENDIX A \nNatural Heritage Inventory Species of Special Concern\n\n \n38 \nPlant Species of Special Concern for Tate County. \n \n \n \n \n \n \n \n \n \n \n  \n \nPlant Species of Special Concern for Panola County. \n \nScientific Name Common Name \nCAMASSIA SCILLOIDES WILD HYACINTH \nCHELONE GLABRA WHITE TURTLEHEAD \nCHELONE OBLIQUA RED TURTLEHEAD \nPANAX QUINQUEFOLIUS AMERICAN GINSENG \nPYCNANTHEMUM PILOSUM HAIRY MOUNTAINMINT \n \nAnimal Species of Special Concern for Panola County. \n \n \nScientific Name Common Name \nHYDRASTIS CANADENSIS GOLDEN SEAL \nOSMORHIZA LONGISTYLIS SMOOTHER SWEET-CICELY \nTRIOSTEUM ANGUSTIFOLIUM NARROW-LEAF FEVER ROOT \nScientific Name Common Name \nARCIDENS CONFRAGOSUS ROCK POCKETBOOK \nCYCLEPTUS ELONGATUS BLUE SUCKER \nCYPRINELLA WHIPPLEI STEELCOLOR SHINER \nMACROCHELYS TEMMINCKII ALLIGATOR SNAPPING \nTURTLE \nPANDION HALIAETUS OSPREY \nPETROCHELIDON \nPYRRHONOTA \nCLIFF SWALLOW \nPOLYODON SPATHULA PADDLEFISH \n\n \n39 \n \n \n \n \n \n \n \n \n \n \n \n \nAPPENDIX B \nStressors\n\n \n \n40 \nDESCRIPTION OF STRESSORS \n \n \n \nStatus Description \nStressor: \nJustification: \n \nLocation: \nExtent: \nMalfunctioning on-site wastewater treatment units. \nFailing on-site wastewater treatment units have the potential to contribute \nfecal coliform, nutrients, and organic matter to surface waters.  \nNot yet been surveyed. \nNot yet been surveyed. \nStressor: \n \nJustification: \n \nLocation: \nExtent: \nDischarges of untreated wastewater from direct pipes and combined \nstorm/sewer system overflows. \nUntreated wastewater has the potential to contribute fecal coliform, nutrients, \norganic matter, and other pollutants to surface waters. \nUndetermined. \nUndetermined. \nStressor: \nJustification: \n \n \nLocation: \nExtent: \nAnimals in streams. \nAnimals, especially livestock, with access to streams can contribute nutrients \nand fecal coliform by depositing waste into streams. Livestock also damage \nstream habitat when they have access to streams. \nSee Figure 2.2 for locations of pastures adjacent to streams. \nUndetermined. \nStressor: \nJustification: \n \n \n \nLocation: \nExtent: \nRunoff from agricultural lands, pastures. \nRunoff from pastures has the potential to contain nutrients and organic matter \nfrom animal waste deposited by grazing animals and used as fertilizer, as well \nas sediment. Runoff from croplands has the potential to contribute sediment, \nnutrients, organic matter, and pesticides to surface waters. \nSee Figure 2.2 for the locations of pastures and croplands in the watershed. \nApproximately 31,000 acres of cropland and 88,000 acres of pasture in the \nwatershed in 1993. \nStressor: \nJustification: \n \nLocation: \nExtent: \nFailing sewer lines. \nFailing sewer lines have the potential to contribute fecal coliform, nutrients, \nand organic matter to surface waters. \nUndetermined. \nUndetermined. \n\n \n \n41 \nStatus Description \nStressor: \nJustification: \n \nLocation: \n \nExtent: \nNPDES point source discharges. \nNPDES point source discharges contribute fecal coliform, nutrients, and \norganic matter to streams in Hickahala Creek watershed. \nNPDES point source discharges are located primarily in the lower watershed \nnear Senatobia, Como, and Coldwater. \nThere are approximately 15 NPDES permitted point source discharges in the \nwatershed. \nStressor: \nJustification: \n \nLocation: \nExtent: \nRunoff from silvaculture. \nSilviculture operations have the potential to contribute sediment and nutrients \nto surface waters. \nSilvaculture operations that do not utilize erosion control BMPs. See Figure \n2.2 for the locations of forest lands adjacent to streams. \nDifferent locations throughout the watershed. \nStressor \nJustification \n \nLocation \nExtent: \nRunoff from urban areas. \nUrban runoff has the potential to contribute nutrients, organic matter, \nsediment, and pesticides to surface waters.  \nSenatobia, Como, Coldwater. \nApproximately 3,000 acres of urban land use were reported in the watershed \nas of 1993. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n42 \n \n \n \n \n \n \n \n \n \n \n \nAPPENDIX C \nHistory of the Hickahala Creek Watershed Implementation Plan\n\n \n \n43 \nHISTORY OF THE HICKAHALA CREEK WATERSHED  \nIMPLEMENTATION PLAN \n \nIn 1998 the Mississippi Department of Environmental Quality implemented the \nBasin Management Approach (BMA) to Water Quality to carry out the mandates of the \nClean Water Act. This approach brings together state, federal, and local agencies to \nimprove and maintain the quality of Mississippi’s water resources on a basin wide scale \nthrough comprehensive long range water quality planning and management strategies. \nThe BMA is based on a repeating, five-year management cycle, with each year \ndedicated to a different management activity (Figure C.1). This document is an \nimplementation plan from year five. \nThe BMA is implemented on a basin scale. The nine major watershed basins in \nMississippi were combined into five basin groups (Figure C.2). Hickahala Creek is \nlocated in basin group II, the Yazoo River basin. Each basin group is managed by a \nBasin Team. The agencies on the Basin Group II Basin Team are listed in Table C.1. \nThe goal of this team is to develop and implement management plans for its Basin \nGroup. \n \nTable C.1. Yazoo Basin (Basin Group II) Team Members. \n \nNatural Resources Conservation Service Mississippi Soil and Water conservation \nCommission \nU.S. Fish & Wildlife Service Mississippi Department of Health \nMDEQ Field Services Division Delta F.A.R.M. \nMDEQ OLWR U.S. Army Corps of Engineers Vicksburg District \nMDEQ SRF and DWI Loan Programs U.S. Geological Survey \nMDEQ TMDL Section USDA Cooperative Extension Service \nMDEQ NPS Program Yazoo Water Management District \nMississippi Department of wildlife, Fisheries, and \nParks \nMississippi Farm Bureau \nMississippi Farm Services Agency The Nature Conservancy \nDucks Unlimited  \n \nIn 2004, Basin Group II is in year five of its management cycle. The basin \nmanagement plan is being developed, and Hickahala Creek watershed was selected for \nimplementation of restoration activities. A ranking system was used to select \nwatersheds for implementation. \n\n \n \n44 \n The first step in the ranking process was to calculate prioritization scores for \nwaterbodies. In this first round of ranking only waterbodies for which TMDLs had been \ncompleted were prioritized. The prioritization score was based on evaluation of the \nwater quality data available for the water body, the method used to develop the TMDL, \nand the resource value of the water body based on its designated uses and the \npresence of threatened or endangered species. The water body scores were then \naggregated into watershed scores. Eight-digit hydrologic unit codes were used to define \nwatershed in the Delta portion of the basin, and 10-digit hydrologic unit codes were \nused to define watersheds in the Bluff Hills (MDEQ 2004). \nThe second step in the ranking process was to calculate a targeting score for \neach watershed. The targeting score was based on evaluation of local and agency \nsupport for restoration projects in the watershed; restoration and conservation projects \nthat were active, planned, or had been completed in the watershed; and the value of \nwater bodies in the watershed with regard to quality of life issues such as recreation and \naesthetics (MDEQ 2004). The prioritization scores and targeting scores for the \nwatersheds were combined in the final ranking score. At a Basin Team meeting in July \n2004, the Team designated approximately 15 of the highest ranked watersheds as high \npriority watersheds for restoration and development of Watershed Implementation \nPlans. Watershed Implementation Teams for these high priority watersheds were also \nformed. Table C.2 lists members of the Hickahala Creek Watershed Implementation \nTeam. \n \nTable C.2. Watershed Implementation Team Members. \n \nMississippi Soil and Water Conservation \nCommission \nMississippi Department of Environmental \nQuality \nLocal Landowners  Natural Resources Conservation Service \nCity of Senatobia Unites States Army Corp of Engineers \nMississippi State University Extension Service Mississippi Farm Bureau Federation \nNorth Central RC&D coordinator Mississippi Department of Health \nTate County Soil and Water Conservation \nDistrict \nPanola County Soil and Water \nConservation District \n\n \n \n45 \n \n \nBasin Management Cycle\nPlanning\nAssess Data,\nTMDL\nImplement Plan\nDevelop Basin\nManagement Plan\nGather Data\nRepeat\nProcess\nYear 1\nYear 2\nYear 3\nYear 4\nYear 5\nFigure C.1. Mississippi Basin Management Cycle. \n\n \n \n46 \nFigure C.2. Mississippi Basin Management Basin Groups. \n\n \n \n47 \n \n \n \n \n \n \n \n \n \n \n \n \nAPPENDIX D \nChecklist of Watershed Implementation Plan Elements\n\n \n \n48 \nFY03/04 319 Watershed-Based Plans Guide \n \n \nName of Watershed-Based Plan: Hickahala Watershed Implementation Plan  \n \n \nRequired Watershed Elements \n \nLocation \n \n \n1.    a. Non-point Source Agricultural runoff. The primary concerns are \nnutrient loading, pathogens and sedimentation. The critical areas have \nbeen identified and are being treated followed by the less critical areas. \n319 funds and USDa programs are being used to address these sites.  \n   b. Water infiltration into sewer system and storm water. Due to the \namount of growth and other unknown issues, the storm water is \ninfiltrating the sewer systems causing storm water to also be treated as \nwastewater. At this time, there are no funds to address this problem.  \n   c. Closed landfills and illegal dumping. Due to the issue of closed \nlandfills, trash and litter are being dumped wherever people can find a \nplace. There are no funds to address this issue at this time. \n   d. Flooding of low lying areas (wells). This causes contamination of \nthe wells that provide water to homes. There are no funds for \naddressing this at this time. \n   e. Kudzu Control. Kudzu is an invasive species. It takes over the land \nand is a major problem. USDA programs have monies to address this \nissue. \n   f. Beaver control. This is an issue that has been addressed in the \npast. Beavers stop up flowing water causing flooding of timber roads, \nand roadside ditches. At this time, there are no funds available to \naddress this issue.  \n   g. Loss of quail habitat. The quail population has decreased \ndramatically due to loss of habitat. USDA programs have money to \naddress this issue in the reestablishment of habitat. \n \n \n \n \n \n \n \n \n \nTable 3.2 \n \n2. a. 50 to 76% reduction in fecal coliform loading, \n    b. no reduction in discharge at this time, but making sure state \nstandards for pH levels are being met before approving any more point \nsource discharges \n \nChapter III,  \nSection D,  \nSubsection 3 \n\n \n \n49 \n \nRequired Watershed Elements \n \nLocation \n \n• Critical Area Planting (100 acres) \n• Grade Stabilization Structures ( 70 structures) \n• Diversions (20,000 feet) \n• Ponds (22 ponds) \n• Tree Planting (1,500 acres) \n• Stream Crossings (20 crossings) \n• Water and Sediment Control Basins (50 basins) \n• Fencing (100,000 feet) \n• Pasture and Hayland Planting (400 acres) \n \n \n \n \nChapter IV \nSection B \nSubsection 4 \n \n \nAg BMPS  \n 319 funds-     $804,500.00 \n USDA funds- $250,000.00 \nTable 4.1, and \nChapter IV \nSection1 \nSubsection 3 \n \nThe overall objective of the education strategy for Hickahala Creek id to \nimprove the water quality and protect high quality waters through the \nimplementation of BMPs in selected areas to reach the desired \noutcome of reduced runoff, sedimentation, and cattle access to the \nstreams. The second goal is to inform and educate the public about \nBest Management practices that benefit water quality. \n \n \nChapter V \nAll Best Management Practices using 319 funds shall be implemented \nby August 28, 2007.The Restoration of Quail Habitat funding will end \nDecember 31, 2007. \nChapter IV \nBefore and after soil losses will be collected on each installed BMP, \nand before and after photo documentation is being taken on a sample \nof the installed practices. Also, MDEQ will estimate the reduction of \nsediments and other pollutants from each BMP installed as part of this \nproject through the use of a modeling system developed by EPA. \nChapter VI \n \n \n \n  \n\n \n \n \n \n \n \n \n \n \n \n \n \n \nAPPENDIX E \nFunded 319 Project Proposal \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n \n51 \nPROJECT TITLE: \nHickahala Creek/Senatobia Creek Nonpoint Source Pollution Project \n \nPROJECT ABSTRACT: \nThis project will be located in the southeastern  portion of Tate County and the \nnortheastern portion of Panola County in Mississippi. \nThe objectives of this project will be: \n \nTo improve water quality and protect high quality waters through the \nimplementation of selected BMPs in targeted areas. \n \nTo apply Best Management Practices (BMPs) to agricultural lands in the project \narea so as to reach the desired outcome of reduced runoff, sedimentation and \ncattle access to streams. \n \nTo inform and educate the public about Best Management Practices that benefit \nwater quality. \n \nThe project cost is $864,501. Of this amount, $518,700 in 319 funds are requested with \nthe balance of $345,801 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nPatrick Vowell, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax:    (601) 354-6628 \ne-mail: pvowell@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES: \n \nTate County Soil and Water Conservation District, Panola County Soil and Water \nConservation District,  USDA Natural Resources Conservation Service,  Mississippi \nDepartment of Environmental Quality, and US Environmental Protection Agency. \n\n \n \n \n52 \nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone: (601) 354-7645 \n  (601) 497-1649  (cell) \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nHickahala Creek Watershed (08030204-100) \nSenatobia Creek Watershed (08030204-090) \n(see attachment 1 for a map depicting the targeted areas of the project) \n \nPROJECT OBJECTIVE: \n \nThe Primary objective of this project will be to implement selected Best Management \nPractices  (BMPs) in the Hickahala and Senatobia Creek sub-watersheds that will result \nin reduced pollutant loadings from agricultural nonpoint sources. The main water quality \nproblems to be addressed by this project are organic enrichment and animal waste \nnutrient loadings from agricultural lands in the watersheds.  \n \nPROJECT DESCRIPTION: \n \nSegments of Hickahala Creek, James Wolf Creek and Senatobia Creek have been \nplaced on the Mississippi 1998 Section 303(d) list of waterbodies as monitored \nwaterbody segments due to organic enrichment/low dissolved oxygen, nutrients and \nfecal coliform bacteria. The applicable state standard specifies that the DO \nconcentrations shall be maintained at a daily average of not less than 5.0 mg/l. The \napplicable state standard also specifies that for the summer months, the maximum \nallowable level of fecal coliform shall not exceed a geometric mean of 200 colonies per \n100 ml, nor shall more than ten percent of the samples examined during any month \nexceed a colony count of 400 per 100 ml. For the winter months, the maximum \nallowable level of fecal coliform shall not exceed a geometric mean of 2000 colonies per \n100 ml, nor shall more than ten percent of the samples examined during any month \nexceed a colony count of 4000 per 100 ml. Mississippi currently does not have \nstandards for allowable nutrient concentrations. \n \nLow dissolved oxygen (DO) impairments are due to the oxidation of organic material. \nOrganic enrichment is measured in terms of TBODu (Total Ultimate Biochemical \nOxygen Demand). TBODu represents the oxygen consumed by microorganisms while \nstabilizing or degrading carbonaceous and nitrogenous compounds. Nonpoint loading of \n\n \n \n \n53 \nTBODu results from the transport of pollutants into receiving waters by overland surface \nrunoff and groundwater infiltration. Land use activities within the watersheds such as \nagriculture and silviculture contribute to nonpoint source loading. Fecal coliform bacteria \nare used as indicator organisms. They are readily identifiable and indicate the possible \npresence of other pathogenic organisms in the waterbody.  \n \nThe headwaters of Hickahala Creek begin in Tate County. It flows in a westerly direction \nto its confluence with Arkabutla Lake at Coldwater, MS. Senatobia Creek flows in a \nnorthwesterly direction from Panola County into Tate County to the confluence with Old \nSenatobia Canal. \n \nThe Hickahala and Senatobia Creek watersheds encompass approximately 234.2 \nsquare miles (149,910 acres). Land uses in the watersheds include urban, forest, \ncropland, pasture, water, wetlands and aquaculture. The predominant land use in the \nwatershed is agriculture with pasture and cropland comprising 59% and 21% of the \nwatersheds respectively. The major crops within the watershed are corn, cotton and \nsoybeans   \n \nSoil types in the Hickahala/Senatobia Creek watersheds include Grenada-Loring, \nRiston-Providence and Memphis Associations. These are silty to silty/sandy soils that \nare well drained to moderately well drained found in upland areas on gently sloping to \nsteep sloping terrain in thick loess. These soil types are easily eroded without proper \nprotection. \n \nThe Mississippi Department of Environmental Quality (MDEQ) has identified segments \nof Hickahala and Senatobia Creeks in its 305(b) report as partially supporting the use of \nAquatic Life Support. They are on the Mississippi Section 303(d) list as impaired due to \norganic enrichment/low DO, nutrients and fecal coliform. This project will involve \nworking with land operators in the watersheds to address organic material and animal \nwaste entering Hickahala Creek and Senatobia Creek from agricultural non-point \nsources. As required by Section 303(d) of the Federal Clean Water Act, a Total \nMaximum Daily Load (TMDL) has been developed to address the impairments of \nHickahala and Senatobia Creeks. (A copy of the TMDLs are attached).  \n \nThis project will be implemented in three phases. Phase I will consist of analyzing \nexisting assessment data, identifying target areas within the watershed where stressors \nare causing the greatest damage and if the application of needed Best Management \nPractices will yield a beneficial reduction in pollutant loadings. Education and outreach \nactivities will also be conducted during this phase to inform landowners in the watershed \nabout the objectives of the project. The Mississippi Soil and water Conservation \nCommission will cooperate with the MS Department of Environmental Quality, the \nNRCS and the Tate and Panola County Soil and Water Conservation Districts in \nidentifying the appropriate Best Management Practices for targeted areas in the \nwatershed and educating landowners as to the need for their participation. \n \n\n \n \n \n54 \nPhase 2 will consist of (based upon the findings of phase 1) the application of Best \nManagement Practices (BMPs) on targeted areas in the watershed that will result in \ndesired pollutant load reductions. The MSWCC will accomplish this through it's water \nquality cost share program. In this project, records will be kept at both the state level \nand local level so as to determine the progress being made in carrying the project out \nand the benefits that are being received as related to the improvement of water quality \nwithin the project. During the planning process with participants, the amount of soil loss \nfrom the area to be treated with a particular BMP will be determined and recorded. The \namount of soil saved as a result of applying the BMP will also be determined and \nrecorded. Since pesticides, fertilizer/plant nutrients animal waste and organic matter are \ntransported to the waters as by overland flow, this information will indicate the project \neffectiveness in reducing pollutant loadings. Participants in the project will be required to \nmaintain BMPs for a period of up to ten years after installation. \n \nAdditional education and outreach efforts will be conducted during this phase to inform \nand educate the public about Best Management Practices that benefit water quality. \nThis will be accomplished by the following: \nEstablishing at least two demonstration farms to inform the public about best \nmanagement systems. \nConduct at least two field day/tours during the life of the project. \nPrepare and distribute at least 1,000 fact sheets highlighting the benefits derived from \nthe project. \nPublish at least four articles about the project in newsletters and local newspapers. \nErect at least 20 project roadside signs which designate where water quality practices \nare in progress or have been completed. \n \nTo address the above stated water quality problems Best Management Practices \n(BMPs) will be installed on agricultural lands in the project area. Potential BMPs to be \ninstalled include but are not limited to: \n100 acres of critical area planting \n70  grade stabilization structures \n20,000 feet of diversions \n22 ponds \n2020 acres of tree planting \n20 stream crossings \n50 water & sediment control basins \n100,000 feet of fencing \n400 acres pasture & hayland planting \n2,000 acres prescribed grazing \n \n \nPhase 3 will consist of post BMP evaluation to determine the pollutant load reductions \nachieved by the application of Best Management Practices. The MSWCC will \ncoordinate with the MDEQ in collecting information on installed BMPs. \n \n \n\n \n \n \n55 \n \nMILESTONES: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n \n2. Issue policies and procedures for implementing the project to the SWCD office.  \n(Month 1) \n \n3. Meet with the board of SWCD commissioners to get their understanding of their \n responsibilities and participation. (Month 2) \n \n4. In conjunction with the local SWCD, establish a locally led watershed advisory \n group to assist with implementation activities. (Month 2-3) \n \n5. Provide training to district staff. (Month 2-3) \n \n6. Assist in establishing an evaluation system in conjunction with the MS \n Department of Environmental Quality to indicate the benefits of the project. \n (Month 2-3) \n \n7. Conduct a landowner meeting to inform potential participants about the project.  \n (Month 3) \n \n8. Secure commitments from several landowners and operators who are willing to \n participate in the project. (Month 3-4) \n \n9. Assist participants in developing a conservation plan and applying best \n management practices. (Month 4-12) \n \n10. Establish at least one demonstration farm (Month 4-12) \n \n11. Document pre-existing site conditions. (Month 2-12) (Before and after photo \n documentation will be conducted.) \n \n12. Accelerate conservation planning and application assistance. Special effort will \n be made to complete conservation plans during this time frame. (Month 13-24) \n \n13. Conduct at least one informational field day/tour to inform the public about the \n project. (Month 13-24) \n \n14. Establish at least one demonstration farm. (Month 13-24) \n \n15. As requested, assist MDEQ with evaluations. (Month 0-36) \n \n16. Assemble data on the amount of soil saved. (Month 0-36) \n\n \n \n \n56 \n17. Erect project roadside signs which designate where water quality practices are in \n progress or have been completed. (Month 4-36) \n \n18. Provide continued conservation planning and application assistance to \n participants. (Month 25-36) \n \n19. Review the status of applying best management practices to reach the objectives \n of the project. (Month 25) \n \n20. Based upon the needs and finding of milestone 18, assistance in planning and/or \n application will be redirected and/or accelerated. (Month 25-36) \n \n21. Publish at least four articles about the project. (Month 0-36) \n \n22. Publicity of the project will be increased; at least one field day/tour will be \n conducted and at least 1,000 fact sheets will be developed and distributed. \n (Month 25-36) \n \n23. Bi-annual reports will be made to MDEQ. (Month 0-36) \n \n24. Make Final report to MDEQ. (Month 36) \n\n \n \n \n57 \nMEASURES OF PROJECT SUCCESS \n(also see Phase 1 and 3 information under Project Objective) \nThe following measures and indicators of progress will be utilized to track the success \nof this project: \n \nNPS Pollutant Load Reduction – the amount of soil saved as a result of the installation \nof best management practices (BMPs) in this project will be a direct indicator of organic \nmaterial and animal waste reductions to Hickahala and Senatobia Creeks. Since \npesticides, fertilizer/plant nutrients, organic material and animal waste are transported to \nthe waters by surface runoff, BMPs installed to reduce sediment will also result in a \nreduction of concentrated surface runoff thereby enhancing the effectiveness and \nsuccess of the project.  \n \nImplementation of NPS Controls – this project will involve the installation of Best \nManagement Systems. Best Management Systems are defined as a combination of \nBMPs, both structural and vegetative, which are the most practical, effective and \neconomical means of preventing or reducing pollution from nonpoint sources to a level \ncompatible with water quality goals. The estimated types and numbers of BMPs to \nbe installed as part of  Best Management Systems are listed in the project \ndescription of this proposal. The application of best management systems in the \nproject will be the responsibility of the landowners and operators participating in the \nproject as cooperators of the local soil and water conservation district. \n \nPublic Education, Awareness, and Action -  this project will include the establishment of \nat least 2 demonstration farms that will be used to inform the public about best \nmanagement systems. These will be utilized during the 2 field day/tours that will be \nconducted in the project. Also, at least 1,000 informational fact sheets highlighting the \nbenefits derived from the project will be developed and distributed as well as the \npublishing of at least 4 articles about the project in newsletters and local newspapers. At \nleast 20 project roadside sign will be erected where water quality practices are installed \nin the project. Other educational actions will be conducted to measure the success of \nthe project. These include such things as increased public awareness; before and after \nphoto documentation; increased cooperation among agencies, associations, public \nbodies and educational institutions; and the economic benefits of applying best \nmanagement practices. The Mississippi Soil and Water Conservation Commission will \nrequest information through the local soil and water conservation district that will assist \nin measuring the success of the project in the demonstration area. \n \nPROJECT PERIOD \n \nThe length of this project will be three years. \n \n  \n ",
  "metadata": {
    "id": "hickahala-creek-watershed-plan",
    "originalName": "Hickahala_Creek_Watershed_Plan_2009.pdf",
    "mergedFrom": [
      "hickahala-creek-watershed-plan-2009.json"
    ],
    "pageCount": 58,
    "mergedAt": "2025-10-02T06:41:26.692Z",
    "length": 71007
  }
}