{
  "id": "jasper-creek-watershed-plan-2019",
  "rawText": "\n\nJASPER CREEK WATERSHED BASED PLAN \n \n \n \n \n \n \n \n \n \nJune 30, 2019 \n\nJasper Creek  \n Watershed Based Plan \nHUC 080302010404 \n \n \n \n \n \n \n \n \n \n \n \nPrepared for: \n \nJasper Creek Watershed Implementation Team \n \nMississippi Department of Environmental Quality \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \n680 Monroe St., Suite B \nJackson, MS 39202 \n \n\niii \n \nTABLE OF CONTENTS \nExecutive Summary ........................................................................................................................ 1 \nVision Statement ............................................................................................................................. 3 \nMission Statement ........................................................................................................................... 3 \nWatershed Implementation Team ................................................................................................... 4 \nWatershed Description .................................................................................................................... 5 \nStakeholder Interest ........................................................................................................................ 8 \nWater Resources ............................................................................................................................. 8 \nHistory of Activity in the Watershed .......................................................................................... 8 \nWildlife and Fisheries ................................................................................................................. 9 \nWater Body Classifications and Designated Uses .................................................................... 11 \nWater Quality Status ................................................................................................................. 11 \nTotal Maximum Daily Load (TMDL) ...................................................................................... 12 \nWatershed Management Actions .................................................................................................. 15 \nNutrient and Sediment Best Management Practices ................................................................. 15 \nStakeholder Interests ............................................................................................................. 15 \nRoles and Responsibilities .................................................................................................... 15 \nGoals and Objectives ............................................................................................................ 15 \nManagement Actions ............................................................................................................ 15 \nProject Tracking and Assessment of Progress ...................................................................... 16 \nDesired Results/Benefits ....................................................................................................... 16 \nBudget ................................................................................................................................... 17 \nEducation and Outreach Activities ............................................................................................... 18 \nWater Quality Monitoring......................................................................................................... 23 \nPlan Revision ................................................................................................................................ 24 \nPlan Revision Procedure ........................................................................................................... 24 \nResults of WBP Plan Revision ............................................................................................. 24 \nEvaluation ..................................................................................................................................... 25 \nPlan Evaluation Procedure ........................................................................................................ 25 \nFindings from Plan Evaluation ............................................................................................. 25 \nResources ...................................................................................................................................... 26 \nAppendix A ................................................................................................................................... 27 \nMilestones for Section 319 Watershed Implementation Project ............................................... 27 \nAppendix B ................................................................................................................................... 30 \n\niv \n \nChecklist of Watershed Implementation Elements ................................................................... 30 \nAppendix C ................................................................................................................................... 32 \nProject Summary Scorecard ...................................................................................................... 32 \n \nTable of Figures \n \nFigure 1: Landuse Map of Jasper Creek Watershed ....................................................................... 5 \nFigure 2: Government Boundary Map: Jasper Creek Watershed ................................................... 7 \nFigure 3: Jasper Creek Watershed Monitoring Locations ............................................................ 12 \nFigure 4: Map of 303(d) Listed Segment for Jasper Creek (MS900511) ..................................... 14 \n \nTable of Tables \n \nTable 1:Jasper Creek Watershed Management Action Plan ........................................................... 2 \nTable 2: Animals of Special Concern in Union County ................................................................. 9 \nTable 3: Animals of Special Concern in Tippah County ................................................................ 9 \nTable 4: Plant Species of Special Concern in Union County ....................................................... 10 \nTable 5: Plant Species of Special Concern Tippah County .......................................................... 10 \nTable 6: Conservation Practices Implemented through EQIP (2016-2018) ................................. 17 \nTable 7: Budget for BMPs Implemented Using Section 319 Funds ............................................. 17 \nTable 8: Budget for Education and Outreach Activities ............................................................... 18 \nTable 9: Total Budget for Jasper Creek Watershed Based Plan and Implementation .................. 18 \nTable 10: Education and Outreach Objectives .............................................................................. 20 \nTable 11: Water Quality Thresholds for Jasper Creek Watershed ............................................... 23 \n \n \n\n1 \n \nEXECUTIVE SUMMARY \n \nThe Jasper Creek Watershed (HUC 080302010404) was identified as a priority watershed by the \nMississippi Department of Environmental Quality (MDEQ) and the Yazoo River Basin Team.  \nJasper Creek, the main stem drainage in the watershed, was included on Mississippi’s 2006 \nSection 303(d) List of Impaired Water bodies for biological impairment.  The Mississippi Soil \nand Water Conservation Commission (MSWCC), Union County Soil and Water Conservation \nDistrict, Tippah County Soil and Water Conservation District and USDA Natural Resources \nConservation Service (NRCS) thought a great impact on water quality could be made in this \nwatershed.  As a result, the MSWCC submitted a proposal to MDEQ’s Section 319 grant \nprogram to educate landowners/operators about water quality and measures they could take to \nhelp improve the water quality in this watershed along with the installation of Best Management \nPractices (BMPs) to address water quality concerns.  To build partnerships and increase \nopportunities for conservation practice implementation, the MSWCC worked to assemble a \nWatershed Implementation Team to address water quality and identify any other concerns within \nthe watershed.  As a result of this effort, the Watershed Based Plan (WBP) contained within this \ndocument was developed based on input from the watershed team and water quality and \nconservation professionals. \n \nAfter the original impairment §303(d) listing in 2006 for biological impairment, an inter-\ndisciplinary group of water quality subject matter experts performed a stressor analysis to \nidentify what pollutant was most likely causing the impairment to the biological community in \nJasper Creek.  As a result of the stressor analysis, sediment pollution was identified as the cause \nof the impairment and a TMDL was developed in 2019.   Because MS soils have a high \nphosphorus content and the same BMPs that are used to address sediment are also used to \naddress nutrients; this WBP will address both sediment and nutrient loading in the Jasper Creek \nWatershed.  The goal of this watershed based plan include reducing the nutrients and sediment \nentering the streams and creeks in the watershed and in response to those reductions restore \nJasper Creek to a state where it can attain water quality standards.  To improve water quality, one \nof the management actions undertaken was to implement a Section 319 funded watershed \ndemonstration project within the watershed.  The targeted landuse for this project was \nagricultural lands in Union and Tippah Counties that fell within the watershed boundaries.    \n \nThe groups that supported the efforts undertaken to educate landowner/operators about water \nquality and installing BMPs on the landscape included staff from the Union County Soil and \nWater Conservation District, the Tippah County Soil and Water Conservation District, USDA \nNatural Resources Conservation Service, and the Mississippi Soil and Water Conservation \nCommission.  The Union County Soil and Water Conservation District and the Natural \nResources Conservation Service can be contacted at 662-538-0030 ext. 3 for information and \nassistance about this project. The Tippah County Soil and Water Conservation District and the \nNatural Resource Conservation Service can be contacted at 662-837-4464 ext. 3.  \n\n2 \n \nTable 1: Jasper Creek Watershed Management Action Plan \nGoal Who What  Where When Contacts \nReduce nutrient and sediment   \nloading to water bodies in the \nwatershed thereby allowing \nthem to meet MS’s Fish and \nWildlife Support designated \nuse  \nMSWCC,  \nUSDA NRCS, \nUnion County Soil \nand Water \nConservation \nDistrict, Tippah \nCounty Soil and \nWater Conservation \nDistrict \nContinue existing programs and \nprojects related to \nlandowner/operator education, BMP \nimplementation, and habitat \nconservation \nEntire \nwatershed \n2016-2019 Nick Ivy, MSWCC  \n601-354-7645 \n \nUnion County \nNRCS/SWCD \n662-538-0030 ext. 3 \n \nTippah  County     \nNRCS/ SWCD \n662-647-8857 ext. 3 \nLocal Landowners \nand operators \nGrade Stabilization Structures \nStreambank and Shoreline Protection \nCritical Area Planting \nHeavy Use Area Protection \nTank/Trough \n   \n \n \nEntire \nWatershed \n2016-2019 Local landowners \n\n3 \n \nVISION STATEMENT \n \nThe vision of the Jasper Creek Watershed Implementation Team is to improve and/or protect the \nwater quality of streams and creeks in the watershed through the effective management of \nagricultural and other land use activities.  This is a place where people want to live, work, \nrecreate and raise a family and want to make sure the watershed continues to support those \nactivities.  Farming is a way of life for many of the landowners in this watershed.  They desire to \npreserve and conserve their natural resources so that future generations can enjoy and utilize the \nland as they have been able to do. \n \nMISSION STATEMENT \n \nThe mission of the Jasper Creek Watershed Implementation Team is to educate landowners on \nthe use and effects of new/innovative best management practices and land use planning methods \nthat will help attain designated water body uses in the watershed. \n \n\n4 \n \nWATERSHED IMPLEMENTATION TEAM \n \nMembers of the Watershed Implementation Team for the Jasper Creek Watershed include the \nfollowing participants: \n \nTracy Rodgers- Landowner \n \nLamar Frazier- Landowner \n \nJohn Haynes- Landowner \n \nChris Coombs- Land operator \n \nDavid Kitchens- Landowner \n \nGina Wills- Union County Cooperative Extension Service (Extension) \n \nMark Gilbert- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nNick Ivy- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nLee Smith- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nAndy Whittington- Mississippi Farm Bureau Federation (MFBF) \n \nChristy Robinson- Natural Resources Conservation Service (NRCS) \n \nJohn Estes- Natural Resources Conservation Service (NRCS) \n \nRichard Rebich-United States Geological Survey (USGS) \n \nPatrick Vowell- Mississippi Department of Environmental Quality (MDEQ) \n \nNatalie Segrest- Mississippi Department of Environmental Quality (MDEQ) \n \nThe Watershed team members were identified through a collaborative effort between Union \nCounty SWCD, Tippah County SWCD, NRCS, MSWCC and MDEQ. \n\n5 \n \nWATERSHED DESCRIPTION \n \nThe Jasper Creek watershed consists of approximately 19,657 acres.  The land uses for the Jasper \nCreek Watershed include approximately 6,893 acres of pastureland (35%), 8,017 acres of \nforestlands (41%), 2,316 acres of cropland (12%), 1,067 acres of urban (5%) and 1,364 acres \nother (7%).  Figure 1  shows the land uses in the Jasper Creek watershed.  \nFigure 1: Landuse Map of Jasper Creek Watershed\n\n6 \n \n \nJasper Creek is located in the North central portion of Union County, Mississippi and the \nsouthwestern portion of Tippah County, Mississippi (Figure 2).   This watershed is located in a \nrural area with a sparse population of about 1,900 to 2,200.  Portions of the towns of New \nAlbany and Blue Mountain are located in this watershed.  Economic conditions that influence \nthis watershed include the closing of industry jobs and low timber prices.  The significant \nchanges in land use in this watershed in the last 20 years are pastureland being converted to \ncropland.  There are no historical events or customs that have affected the culture in the \nwatershed.   \n \nJasper Creek watershed falls within the boundaries of both the Northern Hilly Gulf Coastal \nPlains (65e) and Flatwoods/Blackland Prairie Margins (65b) ecoregions; however, 90% of the \nwatershed is classified as Flatwoods/Blackland Prairie.  This is a transitional region with more \nforested plains and hills.  The flatwoods are mostly forested lowland areas with little slope where \nthe soils are characterized by heavy clay.  The Blackland Prairie Margins have a more rolling \nlandscape with more slope but also tend to have heavier clay-like, sticky soils.  Oak and hickory \nalong with pine can be found in the forest areas as the dominant vegetation.  The Northern Hilly \nGulf Coastal Plains ecoregion runs laterally along the eastern boundary of the watershed.  With \nonly 1,955 acres of the watershed belonging in this ecoregion, this area is characterized by soils \nwith higher silt and sand content.  Most notably in this area, the sands on the surface have \nweathered into a reddish color.  This ecoregion also has a higher density of upland hardwood \nforests.  Predominant soils in the watershed include Mantachie Silt Loam, Jean Silt Loam, \nProvidence, Smithdale, Tippah, Falkner, and Gillsburg associations.   These soil types range \nfrom nearly flat to rolling hills and have high to very high run-off potential. \n \nJasper Creek represents the mainstem perennial drainage in the watershed.  Near the headwaters \nof Jasper Creek, Guyten Creek flows into Jasper from the northeastern boundary of the \nwatershed.  Other tributaries flowing into Jasper Creek include West Branch Jasper Creek, \nMcAllister Creek, and Damnation Creek.  At the mouth of the watershed, Jasper Creek empties \ninto the Little Tallahatchie River.  Hell Creek Wildlife Management Area is located partially \nwithin the watershed, but there are no other state or federal parks, national forest or other \nsignificant environmental management areas within the watershed. \n \n\n7 \n \nFigure 2: Government Boundary Map: Jasper Creek Watershed\n\n8 \n \nSTAKEHOLDER INTEREST \n \nThe stakeholders of Jasper Creek want to conserve and preserve the soil, water, and wildlife \nhabitat of this watershed.  Farming is a way of life for many in this watershed, and therefore, \nwanting to conserve and preserve the agricultural lands within the watershed is of utmost \nimportance to stakeholders.  Stakeholders want to restore the watershed’s creeks and streams to a \nstate of good water quality by reducing runoff (stopping erosion and loss of topsoil) as well as \nimproving wildlife habitats.  Sediment and nutrient loading to the waterbodies within the \nwatershed is another concern of the landowners and stakeholders.  Although currently, there is \nlittle impact from developing areas, stakeholders want to monitor any entities or developments \nthat may have a negative impact on this watershed, and take the necessary actions to prevent \nthem.  Stakeholders have also witnessed trash and household appliances that have been discarded \ninto the creeks and streams, which retard the flow of water, causing flooding.  Once the \nfloodwaters recede, topsoil is washed away causing sedimentation and nutrient loading from the \neroded topsoil.  Within this watershed, landowners note that there are numerous tile drains and \nculverts that have failed either due to collapse or improper installation, and believe that this is \ncontributing to much of the nonpoint source pollution within this watershed. This problem occurs \nfairly consistently \n\nthroughout the watershed, and is not concentrated in one particular area.  \nBecause of this, the problem is considered to be expansive and affects the majority of this \nwatershed.       \n \nThe stakeholders believe that educating landowners about the effectiveness of best management \npractices, and implementation of these best management practices within the watershed will \ngreatly improve water quality in the Jasper Creek Watershed.  \n \nWATER RESOURCES \n \nHistory of Activity in the Watershed \n \nThe primary partners in restoration and /or conservation efforts in the Jasper Creek Watershed \nhave been the Natural Resources Conservation Service, the Union County Soil and Water \nConservation District, the Tippah County Soil and Water Conservation District, and the \nMississippi Soil and Water Conservation Commission.  Local landowners and operators have \nalso played a major role in the restoration and conservation of the natural resources in this \nwatershed by installing best management practices on their land.  Several environmental and \nagricultural conservation programs have been utilized by landowners in the watershed in past \nyears.  These programs include the Environmental Quality Incentive Program (EQIP) and \nConservation Reserve Program (CRP).  These programs, funded by USDA, have helped many \nlandowners implement conservation practices on the ground while reducing soil loss, enhancing \nwildlife habitat, improving water quality, increasing agriculture and silviculture production, and \npromoting conservation education.    \n \n\n9 \n \nWildlife and Fisheries \n \nThere are important recreational species located throughout the watershed.  These species \ninclude deer, turkey, bass, catfish, bream, rabbits, squirrel, and raccoon.  Also, trapping is an \nimportant recreation that takes place in this watershed.   The list of plants and animals of special \nconcern are provided below for Union and Tippah Counties.  There are no animals and plants \nthat are threatened or endangered in this watershed. \n \nTable 2: Animals of Special Concern in Union County \n Scientific Name  Common Name \nAimophila aestivalis  Bachman's Sparrow  \nAlligator mississippiensis  American Alligator  \nAnodontoides radiatus  Rayed Creekshell  \nCyprinella spiloptera  Spotfin Shiner  \nCyprinella whipplei  Steelcolor Shiner  \nEtheostoma raneyi  Yazoo Darter  \nLeptodea fragilis  Fragile Papershell  \nLigumia subrostrata  Pondmussel  \nStaphylea trifolia  American Bladdernut  \nUniomerus tetralasmus  Pondhorn  \nUrsus americanus  Black Bear  \nVillosa lienosa  Little Spectaclecase  \nTable 3: Animals of Special Concern in Tippah County \n Scientific Name  Common Name \nArigomphus villosipes Unicorn Clubtail \nCyprinella whipplei Steelcolor Shiner \nEtheostoma raneyi Yazoo Darter \nGomphus modestus Gulf Coast Clubtail \nNoturus gladiator Piebald Madtom \nOphisaurus attenuatus Slender Glass Lizard \nProcambarus ablusus Hatchie River Crayfish \nStylogomphus albistylus Eastern Least Clubtail  \nStylurus laurae Laura's Clubtail \nTachopteryx thoreyi Gray Petaltail \n\n10 \n \nTable 4: Plant Species of Special Concern in Union County \nScientific Name Common Name \nAcorus calamus  Sweet Flag  \nAplectrum hyemale  Puttyroot  \nAsarum canadense  Canada Wild-ginger  \nAsplenium rhizophyllum  Walking-fern Spleenwort  \nCarex meadii  Mead's Sedge  \nCladrastis kentukea  Yellowwood  \nEuonymus atropurpureus  Burning Bush  \nFrasera caroliniensis  American Colombo  \nGalearis spectabilis  Showy Orchis  \nHexalectris spicata  Crested Coralroot  \nHybanthus concolor  Green Violet  \nJuglans cinerea  White Walnut  \nOsmorhiza longistylis  Smoother Sweet-cicely  \nPachysandra procumbens  Allegheny-spurge  \nPanax quinquefolius  American Ginseng  \nPolemonium reptans  Jacob's Ladder  \nSymphyotrichum ericoides  White Heath Aster  \nTriosteum angustifolium  Narrow-leaf Fever Root  \nTable 5: Plant Species of Special Concern Tippah County \nScientific Name Common Name \nAdiantum capillus-veneris Southern Maidenhair-fern \nAgalinis oligophylla Ridge-stem False-foxglove \nAsarum canadense Canada Wild-ginger \nAsplenium rhizophyllum  Walking-fern Spleenwort  \nCarex picta Boott's Sedge \nChelone glabra White Turtlehead  \nCypripedium parviflorum var. pubescens Yellow Lady's-slipper \nDeparia acrostichoides Silvery Spleenwort \nDiplazium pycnocarpon Glade Fern \nGalearis spectabilis Showy Orchis \nGoodyera pubescens Downy Rattlesnake-plantain \nHybanthus concolor Green Violet \nIsotria verticillata Large Whorled Pogonia \nJuglans cinerea Butternut \nLigusticum canadense Nondo Lovage \n\n11 \n \nWater Body Classifications and Designated Uses \n \nSurface waters in Mississippi are used for a number of purposes.  Waters are used for drinking \nand food processing, shellfishing, recreation, fishing, and aquatic life support.  Water bodies are \nclassified and assigned various use classifications by MDEQ in the state’s Regulations for Water \nQuality Criterial for Intrastate, Interstate, and Coastal Waters (11 Miss. Admin. Code Pt. 6, Ch. \n2) (MDEQ, 2016) based on the use of the waterbody identified by the public and other entities.  \nThe use classifications and associated USEPA designated uses for water quality assessment \npurposes recognized by the State of Mississippi are as follows: \n \nUse Classification   USEPA Associated Designated Use   \n \nPublic Water Supply   Drinking Water Supply \n Recreation    Contact Recreation \nFish and Wildlife Aquatic Life Use, Fish Consumption, Secondary \nContact Recreation \n Shellfish Harvesting   Shellfish Consumption \n \nThe water use classification for Jasper Creek and other water bodies within this watershed is Fish \nand Wildlife.  As described above, the associated designated uses with this classification are \naquatic life support, fish consumption and secondary contact recreation.   \n \nWater Quality Status \n \nMDEQ has conducted statewide biological monitoring using benthic macroinvertebrates as the \nindicator to develop a regionally-calibrated Index of Biological Integrity (IBI) for wadeable \nstreams. This index, known as the Mississippi Benthic Index of Stream Quality (M-BISQ), was \nused in the biological assessment of the State’s wadeable streams and rivers including Jasper \nCreek.  Based on the M-BISQ scores, this water body was determined to be impaired. Therefore, \nJasper Creek (MS900511) was placed on the Mississippi 2006 Section 303(d) List of Impaired \nWater Bodies (MDEQ, 2006) for Biological Impairment.  Biological community data were \ncollected at two sampling locations along Jasper Creek (Figure 3) and samples were collected in \n2003, 2013 and 2015.  Biological community data were collected at both the upstream and \ndownstream sampling locations in 2003 and scored using M-BISQ protocols.  These scores were \n47.17 and 40.05 points below the attainment threshold for streams in the bioregion.  In 2013, the \ndownstream location was resampled and the score was 32.2 points below the attainment \nthreshold.  In 2015, the upstream monitoring location was resampled, and while showing some \nimprovement, the score was still 31.1 points below the attainment threshold.  All data described \nhere represent the status of the stream prior to implementation of the conservation practices \nidentified in this watershed plan.  Monitoring will be scheduled 2-3 years post implementation to \ngive the stream time to recover and allow the conservation practices to take effect.   \n \n\n12 \n \n \nFigure 3: Jasper Creek Watershed Monitoring Locations \n \nTotal Maximum Daily Load (TMDL) \n \nWhen water bodies are assessed as not attaining their designated use(s), those waters are \ncompiled into a list as required by Section 303(d) of the Clean Water Act.  This list represents \nwaters that are deemed impaired for one or more designated use(s) and as a result, a total \n\n13 \n \nmaximum daily load (TMDL) for the pollutant determined to be causing the impairment must be \ndeveloped pursuant to 40 CFR part 130.  The TMDL is representative of a stream budget where \npollutant specific allowable loads are developed to ensure the water body can meet appropriate \nwater quality criteria and designated uses.   \n \nJasper Creek (MS900511) was first listed on MS’s Section 303(d) List of Impaired Water Bodies \nin 2006 for biological impairment.  Figure 4 provides a map of the listed segment.  Using \nbiological community metrics, habitat data, water quality, and measures of stream \ngeomorphology, a stressor identification analysis was completed for the Jasper Creek watershed \nto determine the most likely cause(s) of the impairment. This analysis identified sediment as the \nprimary probable stressor of the water body and a TMDL was developed in 2019.  The \nRegulations for Water Quality Criterial for Intrastate, Interstate, and Coastal Waters (11 Miss. \nAdmin. Code Pt. 6, Ch. 2) (MDEQ, 2016) does not include a numeric water quality standard for \naquatic life protection due to sediment. As stated in the TMDL, the narrative standard for the \nprotection of aquatic life is sufficient for justification of TMDL development, but does not \nprovide a quantifiable TMDL target. The target is based on reference sediment yields developed \nby the Channel and Watershed Processes Research Unit (CWPRU) at the USDA, Agricultural \nResearch Service, National Sedimentation Laboratory (NSL).  \n \nThe CWPRU developed reference sediment yields, or targets, for each level III ecoregion within \nMississippi. These yields were derived from the empirical analysis of historical flow and \nsuspended sediment concentrations for stable streams in each level III ecoregion. The methods \nused to develop the level III reference yields are described in detail in the reports titled \n“Reference” and “Impacted” Rates of Suspended-Sediment Transport for Use in Developing \nClean Sediment TMDLs: Mississippi and the Southeastern United States (Simon, et al., 2002b) \nand Actual and Reference Sediment Yields for the James Creek Watershed – Mississippi (Simon, \net al., 2002a).  \n \nFor the Jasper Creek watershed, the estimated allowable range of sediment loads for stable \nstreams is 0.0004 to 0.0019 tons per acre per day at effective discharge.  Also based on this \nanalysis, a range of unstable values was assigned to the listed waterbodies within HUC \n080302010404 based on the level III ecoregion unstable stream values.  The unstable range is \nrepresentative of the existing loads that would be expected for water bodies within HUC \n080302010404.  The unstable range for water bodies within HUC 080302010404 is 0.002 to \n0.054 tons per acre per day at the effective discharge.  The ecoregion approach was used to \nestimate existing load ranges for unstable streams and this range was then used to estimate the \nexisting load for the Jasper Creek Watershed to be 39.3-1,035 tons per day.  The load allocation \ndeveloped by the TMDL is an estimation of the acceptable contribution of all nonpoint sources \nin the watershed and includes contributions from the channel and surface runoff in the \nwatershed.  The load allocation developed for the Jasper Creek Watershed is 14.4 tons per day.  \nThe estimated existing loading is higher than the target loading; therefore, a reduction in \nsediment loading of 63.4%-98.6% is recommended for HUC 080302010404.  The TMDL \nrecommends the implementation of streambank and riparian zone buffer best management \npractices along with any other conservation practices to limit sediment from entering streams in \nthe watershed.\n\n14 \n \nFigure 4: Map of 303(d) Listed Segment for Jasper Creek (MS900511) \n\n15 \n \nWATERSHED MANAGEMENT ACTIONS \n \nNutrient and Sediment Best Management Practices \n \nStakeholder Interests \n \nThe major concerns of the stakeholders include nutrient and sediment loadings to water bodies in \nthe Jasper Creek watershed.     \n \nRoles and Responsibilities \n \nThere are several different groups with responsibilities in this watershed.  NRCS staff has the \nresponsibility of identifying landowners, providing technical assistance, designing the BMPs and \nmaking payments for practices installed under EQIP.  The landowners have the responsibility of \nimplementing BMPs in the project area.  The Jasper Creek Watershed Implementation Team has \nthe role of helping gather the information needed to write the Watershed Based Plan.  The \nMSWCC has the responsibility of compiling all the information, writing and updating the plan \nfor the watershed and providing oversight for the Section 319 project.  The Union and Tippah \nCounty Soil and Water Conservation Districts will have and responsibility of helping in the \nidentification of potential participants for the project, coordinating all the paperwork for \npayments of practices, and assisting in helping plan and conduct the field days for the project.   \n \nGoals and Objectives \n \nThe goal of this watershed implementation team and resulting watershed based plan is to reduce \nthe nutrient and sediment loading coming from agricultural and other land use activities in an \neffort to improve water quality in the Jasper Creek Watershed.  This approach provides the \nstakeholders an opportunity to restore Jasper Creek by addressing the sediment and associated \nnutrient loadings into the stream.  \n \nManagement Actions \n \nThe management actions identified to address nutrient and sediment loadings involve installation \nof agricultural BMPs, water quality monitoring, public outreach/education and other measures.  \nThese BMPs included:  \n Streambank and Shoreline Protection,  \n Grade Stabilization Structures,  \n Critical Area Planting, \n Heavy Use Area Protection, \n Tank/Trough and others. \n \n\n16 \n \nThese BMPs were installed by the participating landowners in the watershed utilizing funds \nthrough a Section 319 Water Quality Project and the NRCS Environmental Quality Incentives \nProgram (EQIP) program.  Local NRCS staff provided the technical/planning assistance for \nBMP implementation on both programs.  The NRCS also provided funding for the BMP \nimplementation for the EQIP practices.  Most of the BMPs that were installed are permanent \nstructures and must be maintained by the landowner for a period of 10-15 years.  NRCS \nemployees, as well as Tippah and Union County Soil and Water District employees identified \nlandowners in the watershed that had agricultural land needing treatment and participated in \nproject.   \n \nProject Tracking and Assessment of Progress \n \nThe Jasper Creek Watershed project began in late 2016.  All BMPs that have been installed \nbefore the beginning of the project through the NRCS EQIP program are tracked by utilizing the \nRevised Universal Soil Loss Equation (RUSLE) on all acres affected by the BMPs.  This is the \nsame method that was used to track all EQIP practices that were implemented in the project area \nduring the life of the project (2016-2019) and any practices installed with 319 funding.  In \naddition to the calculation of soil savings accomplished using RUSLE, MDEQ used the U.S. \nEnvironmental Protection Agency (EPA) Region 5 Model to estimate total phosphorus, total \nnitrogen, and sediment savings achieved through the implementation of the practices funded \nusing Section 319 dollars.   \n \nThe Region 5 Model was originally developed in 1999 by the Michigan Department of \nEnvironmental Quality and provides a gross estimate of sediment and nutrient load reductions \nfrom the implementation of conservation practices.  In 2018, the model was updated to estimate \nflow captured by infiltration practices and enhanced to include the functionality of estimating \nbaseline load from annual rainfall and event mean concentration in surface runoff.  This model is \na simplistic model available for download from USEPA’s website that is easy to use while \nallowing the end user to provide some estimate of water quality benefit from conservation \npractice implementation.   \n \nDesired Results/Benefits \n \nThe desired results of this project were to improve water quality in the watershed by reducing \nsediment and nutrient loading to the streams, engage the landowners and encourage conservation \npractice implementation, and educate stakeholders on the benefits of BMPs and how nonpoint \nsource pollution affects the waters in the watershed and the rest of the state.   \n \nAs part of this project, the BMPs that were installed using Section 319 grant funding were \ntracked individually and entered in the Region 5 Model to estimate nutrient and sediment \nreductions achieved from these practices.  Through this project, approximately 1,129 tons of \nsediment were kept from entering the streams and total nitrogen and total phosphorus were \nreduced by 1,255 lbs/yr and 3,053 lbs/yr respectively.  Because MDEQ did not have access to \ndetailed individual practice data implemented using NRCS EQUIP funds, the reduction estimates \ncould not be calculated for those practices.   \n \n\n17 \n \nBudget \n \nUsing information from the USDA Protracts database, aggregated data was queried and provided \nfor use in this report for the Jasper Creek Watershed.  Under the EQIP program funded through \nNRCS, there has been over $96,000 spent on conservation practices in Union and Tippah \nCounties from 2008-2018.  The table below provides a list of the practices funded through EQIP \nduring the Jasper Creek Watershed Implementation Project (2016-2018). \n \nTable 6: Conservation Practices Implemented through EQIP (2016-2018) \nNRCS Practice Number/Amt. $ Spent \nMulching 1.9 ac $907.35 \nLand Clearing 1 ac $1,935.00 \nGrade Stabilization Structure 5 no $22,248.70 \nCritical Area Planting 1.9 ac $801.12 \nHerbaceous Weed Control 32.8 ac $803.82 \nHeavy Use Protection Area 2 no $1,431.25 \nWatering Facility 2 no $2,145.01 \nLivestock Pipeline 950 ft $2,104.60 \nHigh Tunnel System 2160 sq ft $4,829.76 \nCover Crop 0.7 ac $87.40 \nMicro-irrigation System 0.7 ac $174.72 \nTotal \n \n$37,468.73 \n \nAs part of this plan, the MSWCC along the MDEQ allocated money from the FY2015 Section \n319(h) grant to fund the implementation of on the ground conservati\n\non practices along with \neducation and outreach activities for stakeholders in the watershed to improve water quality.  \nThe table below provides a list of the BMPs installed using Section 319 funds as part of this \nproject.   \n \nTable 7: Budget for BMPs Implemented Using Section 319 Funds \nBMP Number/Amt. $ Spent \nStreambank and Shoreline Protection \n990 feet $78,555.00 \nGrade Stabilization Structure 42 ea $398,624.06 \nStream Crossing 1 ea $10,500.00 \nHeavy Use Protection Area 1 ea $4,260.00 \nTank and Trough 4 ea $9,225.86 \nFencing 2,802 feet $6,990.42 \nDiversion 2,040 feet $16,066.29 \nSub Surface Drain 1ea $3,951.23 \nTotal \n \n$528.172.86 \n\n18 \n \nIn addition to the implementation of on the ground conservation practices in the watershed, \nfunding was also spent to implement the education and outreach plan describe in the next \nsection.  The funding spent for education and outreach activities is summarized below: \n \nTable 8: Budget for Education and Outreach Activities \nActivity Cost \nSignage $ 2,000.00 \nField Days $ 1,590.26 \nEducational Literature $ 1,000.00 \nMobile Classroom $ 1,300.00 \nPresentations $    150.00 \nAdopt-A-Stream $ 1,000.00 \nTotal Estimated Cost $7,040.26 \n \nStaff from the MSWCC and the Tippah and Union County Soil and Water District offices also \nprovided technical assistance during the implementation of the BMPs in the watershed and in the \ndevelopment and revision of the Jasper Creek Watershed Based Plan.  The total budget, \nincluding the estimates from the conservation practices implemented by NRCS through the EQIP \nprogram are provided below. \n \nTable 9: Total Budget for Jasper Creek Watershed Based Plan and Implementation \nActivity Cost \nSection 319 Grant Funded BMPs $528,172.86 \nNRCS EQIP Funded BMPs $37,468.73 \nEducation and Outreach  $7,040.26 \nTechnical Assistance $24,899.93 \nTotal $597,581.78 \n \nDuring the implementation of this project, partners provided matching contributions in the \namount of $534,837.55 bringing the total project funding to $1,132,419.30. \nEDUCATION AND OUTREACH ACTIVITIES \n \nThe overall objective of community education in the Jasper Creek Watershed is to develop an \natmosphere that promotes sustained, long-term protection and improvement of the aquatic \nresources in the watershed.  Specific goals of education efforts in the watershed include the \nfollowing: \n \n Increase public awareness of the value of clean water; \n Increase public awareness of agricultural runoff and encourage behaviors that will help reduce \nlevels of nutrients and sediment in the watershed, watershed characterization and stewardship \nopportunities; \n\n19 \n \n Increase public awareness of how BMP’s can help improve water quality and habitat restoration; \nand, \n Increase public awareness of the long term environmental and economic advantages of \nprotecting and improving water quality and habitat in the Jasper Creek Watershed.  \n \nTable 10 outlines objectives, indicators, and implementation schedule identified in order to meet \nthe education and outreach goals defined above. \n\n20 \n \n \nTable 10: Education and Outreach Objectives \nEducation Objective Indicator Partners Schedule Outputs \nWatershed Signage: Signs \nidentifying the installed \nBMP’s will be erected \nthroughout the watershed \nwith permission of the \nlandowner’s. \nA field day will be held to \nshow other landowners and \nthe interested public the \nBMP’s installed.  Also, the \nassociated benefits from \nBMP installation will be \ndemonstrated to the \nparticipants.  Participants \nwill be counted at this field \nday.  Traffic through the \nwatershed cannot be \ndocumented, but we will \nattempt to install signage in \nheavily trafficked areas, in \norder to bring attention to the \nproject and promote public \ninterest. \nMSWCC, \nMDEQ, Union \nCounty Soil and \nWater \nConservation \nDistrict, Tippah \nCounty Soil and \nWater \nConservation \nDistrict, NRCS, \nand USEPA \nThe BMP signs will be \nerected as practices are \ncompleted and/or \nrequested by the \nlandowner throughout \nthe life of the project. \n \n20 signs were \nimplemented at \nlocations were BMPs \nwere installed in the \nwatershed \nField Days: A field day \nwill be held to showcase \nsome of the BMP’s \ninstalled under the National \nWater Quality Initiative.  \nThis will allow the \nlandowners and the \ninterested public to view \nsome of the practices that \nare being installed to \nbenefit water quality in the \nwatershed. \n \nAttendance at this field day \nwill be documented and \nreported. \n \nMSWCC, \nMDEQ, Union \nCounty Soil and \nWater \nConservation \nDistrict, Tippah \nCounty Soil and \nWater \nConservation \nDistrict, NRCS, \nand USEPA \nField day was held April \n18, 2019. \n200 flyers were \nmailed out the \nstakeholders in the \nwatershed and \napproximately 20 \npeople attended the \nfield day  \n\n21 \n \nEducation Objective Indicator Partners Schedule Outputs \nEducational Literature: \nBrochures and a fact sheet \nhave been developed about \nthis project.  Brochures will \nbe developed to inform \nlandowners/operators about \nwater quality and ways \nthey can protect and \nimprove the water quality \nin their watershed.  The \nfact sheet contains \ninformation about the \nwatershed and the numbers \nand types of BMP’s \ninstalled. \n \nBrochures and fact sheets \nwill be distributed.  These \nbrochures and fact sheets \nwill be handed out at the \nfield days and outreach \nmeetings and will also be \navailable at the district \noffices. \n \nMSWCC, \nMDEQ, Union \nCounty Soil and \nWater \nConservation \nDistrict, Tippah \nCounty Soil and \nWater \nConservation \nDistrict, NRCS, \nand USEPA \nAvailable at District \nOffices and provided to \npublic during the on farm \ndemonstration field day. \n1,000 fact sheets \nwere printed and \nprovided at the on \nfarm demonstration \nfield day sponsored in \nthe watershed. \nEnvironmental Education \nMobile Classroom: A \nmobile, interactive \nclassroom activity targeted \nfor K through 5th grade \nstudents providing \ninformation about NPS \npollution in watersheds and \nwhat people can do to \nimprove water quality. \nActivities presented in the \nprogram align with the \nstandards adopted by the \nMississippi Department of \nEducation. \nThe number of participants \nwill be documented and \nsubmitted \n \nMSWCC, \nMDEQ, Bayou \nTown \nProductions, \nUSEPA \nMobile Classroom was \npresented at a \nConservation Field Day \nevent hosted by Union \nCounty Soil and Water \nConservation District \nand the Union County \nGarden Club on May 17-\n18, 2017 \nDuring the \nConservation Field \nday, 25 Adults and \n316 students attended \nthe Mobile \nClassroom Education \noutreach event.   \n\n22 \n \nEducation Objective Indicator Partners Schedule Outputs \nPresentations: \nPresentations related to \nwater quality will be made \nto civic organizations.  \nThese presentations will \ninform individuals about \nways they can improve \nwater quality and reduce \nnon-point source pollution. \nThe number of people in \nattendance will be \ndocumented. \n \nMSWCC, \nMDEQ, Union \nCounty Soil and \nWater \nConservation \nDistrict, and \nTippah County \nSoil and Water \nConservation \nDistrict \nThese presentations will \nbe made before month 32 \nof this program. \nThere were presentations \nmade on June21, 2018 in \nPittsboro and May 30, \n2019 in Oxford. \nThere were \napproximately 75 \npeople in Pittsboro \nand 110 in Oxford \nthat attended these \npresentations. \nAdopt-A-Stream: Adopt-\na-stream is a program that \npromotes environmental \nstewardship through \ntraining workshops, \noutdoor field activities, and \nby introducing participants \nto watershed action \nprojects.  One and two day \nworkshops inform \nparticipants about \nwatershed topics such as \nstream health, stream \necology, aquatic life, water \nchemistry. \nThe number of participants \nwill be documented \n \nMDEQ, The \nWildlife \nFederation, and \nUSEPA \nThere was an Adopt-a-\nstream program \nconducted April 16, 2019 \nin Ripley. \nThere were \napproximately 325 \nstudents and teachers \npresent at this \ntraining. \n\n23 \n \nWater Quality Monitoring \n \nIn lieu of numeric criteria for sediment and nutrients, the monitoring will be conducted to collect \ndata on parameters that are considered surrogates for sediment (Total Suspended Solids, Total \nSuspended Sediment, turbidity) and nutrients along with conventional in-situ parameters \ngenerally measured to determine aquatic health (e.g. Dissolved Oxygen, pH, Temperature, \nConductivity, Dissolved Solids) will also be obtained.  The following thresholds will be used to \nmeasure compliance applicable with water quality criteria and/or target thresholds: \n \nTable 11: Water Quality Thresholds for Jasper Creek Watershed \nParameter Threshold \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of \n4.0 mg/L \nDissolved Oxygen % Sat ≥ 70% - ≤ 125% \npH 6.0 – 9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less than 1000 micromhos/cm \nDissolved Solids Monthly average less than 750 mg/L; instantaneous  \nthreshold  less than 1500 mg/L \nChemical Oxygen Demand 35 mg/L \nTotal Suspended Solids 65 mg/L \nTurbidity 75 NTU \nM-BISQ East Bioregion 71.6 Calibration 3 (Applicable to waters outside the \nMississippi Alluvial Plain) \n \nIn addition to chemical data, biological community data and in-stream habitat surveys were \ncollected at two monitoring locations on Jasper Creek to determine attainment of the Aquatic \nLife Designated Use.  These data are extremely helpful in identifying positive trends in water \nquality and should provide information to help determine if the implementation activities are \nresulting in water quality improvements.  As the implementation activities continued through \nmost of 2019, the stream will need sufficient time to recover before post BMP monitoring is \nscheduled.  Along with overall MBISQ scores, the in-stream habitat surveys will also be used to \ndetermine change over time.   \n \nOnce post BMP biological community data are collected, those data will be analyzed to \ndetermine if it indicates improvements to water quality in Jasper Creek.  In the event data \nindicate little or no positive change, a Stressor Analysis will be conducted to determine if any \nnew or additional stressors are preventing improvements to water quality.  If any new stressors \nare identified, the Watershed Implementation Team will identify future actions/activities to \naddress those stressors. \n \n \n\n24 \n \nPLAN REVISION \n \nPlan Revision Procedure \n \nAfter evaluation, the Jasper Creek WIT will prepare a revised watershed implementation plan by \nincorporating the changes requested by the reviewers and reconciling any conflicting comments \nor requests for change.  \n \nIf the evaluation criteria are all being met for Jasper Creek watershed, the WBP will be revised to \naddress a different restoration issue or issues, in order to protect the water quality of the \nwatershed. If the evaluation criteria for the watershed are not being met, the approach for \nrestoring Jasper Creek watershed will be revised based on the knowledge that has been gained \nthrough BMP installation and monitoring activities performed.  \n \nThe draft WBP will be submitted to the WIT, and all others who submitted comments. Within \ntwo weeks of receiving the draft WBP, the WIT will notify their stakeholders of the availability \nof the revised WBP for stakeholder review. One month will be allowed for review of the draft. \nComments will be due at the end of this review period. \n \nWithin a month after the comments on the draft WBP are received, an updated implementation \nplan will be submitted to the WIT for review and approval. After the updated WBP has been \napproved, the WIT will notify their stakeholders of the completion and availability of the final \nupdated plan for use as a guide to watershed restoration and protection activities. \n \nResults of WBP Plan Revision \n \nThe WBP has been updated to include updated milestones for the education/outreach activities \nthat have taken place in the watershed during the Jasper Creek Watershed Implementation \nProject funded through the FY 2015 Section 319(h) Grant funds along with a listing of all \nconservation practices that have been implemented using those funds 2016-2019.  In addition, \nusing data provided from the USDA Protracts data system, a list of conservation practices \nimplemented in the watershed 2016-2018 through the NRCS EQIP program have been provided.   \n \nUsing EPA’s Region 5 Model, estimates of sediment, total phosphorus, and total nitrogen \nreductions were made for those practices implemented using Section 319 grant funds.   \n \nThis section will be further revised based on the results from the WIT feedback once the updated \nWBP has been reviewed and comments have been received. \n \n\n25 \n \nEVALUATION \n \nPlan Evaluation Procedure \n \nThe success of the implementation of the Jasper Creek WBP will be evaluated and consequently, \nthe plan will be revised as needed.  The evaluation of this WBP will be conducted by the Jasper \nCreek WIT or its designees by comparing results to the targets to help determine: \n \n If the plan goals have been achieved; \n If the plan implementation restores the water quality of Jasper Creek; and \n If it addresses the priority issues as identified by the WIT. \n \nThe WIT will measure the resources (financial, technical, and time) used; (ii) the implementation \nactivities  (e.g.,  BMPs  installation)  conducted;  and  (iii)  the  environmental  benefits  (e.g.,  water \nquality improvement) achieved. \n \nThe  evaluation  information  will  be  provided  to  all  interested  stakeholders  to  help  facilitate \nnecessary revision of the WBP.  The WIT will develop a detailed schedule for review and revision \nof  the  Jasper  Creek  WBP  to  determine  the  effectiveness  of  implementing  the  management \nmeasures, and water quality improvement. \n \nFindings from Plan Evaluation \n \nThis revisions/updates were provided to the WIT.  Based on the information provided, the WIT \nagreed the project, as designed and implemented, facilitated the placement of sediment and \nnutrient conservation practices within the watershed.  As these BMPs continue to remove \nsediment and nutrients from receiving streams in the Jasper Creek Watershed, improvements to \nwater quality should be achieved.  The implementation of these BMPs achieved the goals \nestablished by the WIT.  Based on this evaluation, the WIT has reviewed the WBP for Jasper \nCreek Watershed and determined it to be final at this time until additional water quality data are \navailable for further evaluation. \n \n \n \n \n\n26 \n \nRESOURCES \n \n \nNatural Heritage Inventory: Search Animal Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_animals.asp> \n \nNatural Heritage Inventory: Search Plant Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_plants.asp \n \nMDEQ. 2003a. Development and Application of the Mississippi Benthic Index of Stream Quality  \n(M-BISQ). Prepared by Tetra Tech, Inc., Owings Mills, MD, for the Mississippi \nDepartment of Environmental Quality, Office of Pollution Control, Jackson, MS. \n \nMDEQ. 2006. Mississippi List of Waterbodies, Pursuant to Section 303(d) of the Clean Water  \n Act. Office of Pollution Control. Jackson, MS \n \nMDEQ. 2014. State of Mississippi Water Quality Assessment 2014 Section 305(b) Report. Office \n Of Pollution Control. Jackson, MS. \n \nMDEQ. 2016. Regulations for Water Quality Criterial for Intrastate, Interstate, and Coastal \nWaters (11 Miss. Code Ann. Admin. Code Pt. 6, Ch. 2). Web 2019. Office of Pollution \nControl. Jackson, MS.   \n \nMDEQ. 2019. Total Maximum Daily Load Yazoo River Basin Jasper Creek HUC 080302010404 \nfor Impairment due to Sediment.  Office of Pollution Control. Jackson, MS. \n \nSimon, A., Bingner, R.L., Langendoen, E.L., and Alonso, C.V. 2002a. Actual and Reference  \nSediment Yields for the James Creek Watershed--Mississippi. Research Report No. 31, \nUSDA-ARS National Sedimentation Laboratory, xvi+185 pp. \n \nSimon, Andrew, Roger A. Kuhnle, and Wendy Dickerson. 2002b. “Reference” and “Impacted”  \nRates of Suspended-Sediment Transport for Use in Developing Clean Sediment TMDLs: \nMississippi and the Southeastern United States. National Sedimentation Laboratory \nReport 25. Oxford, MS. United States Department of Agriculture. Agricultural Research \nService. National Sedimentation Laboratory. Channel and Watershed Processes Research \nUnit. \n \nUSDA. SCS. 1979. Soil Survey of Union County, Mississippi. \n \n \n \n \n\n27 \n \nAPPENDIX A \n \nMilestones for Section 319 Watershed Implementation \nProject \n\n28 \n \nMilestones for the portion of the WBP that was funded through Mississippi’s FY 2015 Section \n319(h) Grant are provided below.  These milestones and the work outlined therein were \nimplemented through a sub-grant agreement between the Mississippi Department of \nEnvironmental Quality and the Mississippi Soil and Water Conservation Commission. \n \nMilestones: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n \n2. Determine priority areas that are contributing significant loads in the watershed.  (Month \n1) \n \n3. Issue policies and procedures for implementing the project to the SWCD office. (Month \n1) \n \n4. Meet with the board of SWCD commissioners to get their understanding of their \nresponsibilities and participation. (Month 2) \n \n5. Provide training to district staff. (Month 2-3) \n \n6. Assist in establishing an evaluation system in conjunction with the MS Department of \nEnvironmental Quality to indicate the benefits of the project. (Month 2-3) \n \n7. Conduct a landowner meeting to inform potential participants about the project. (Month \n3) \n \n8. Secure commitments from several landowners and operators who are willing to \nparticipate in the project. (Month 3-4) \n \n9. Assist participants in developing a conservation plan and applying best management \npractices (Month 4-12) \n \n10. Establish at least demonstration farm (Month 4-12) \n \n11. Document pre-existing site conditions. (Month 2-12) (Before and after photo \ndocumenta\n\ntion will be conducted). \n \n12. Accelerate conservation planning and application assistance.  Special effort will be made \nto complete conservation plans during this time frame. (Month 13-24) \n \n13. Conduct at least 1 informational field day/tour to inform the public about the project. \n(Month 13-24) \n \n14. Establish at least 1 demonstration farm. (Month 13-24) \n \n15. As requested, assist DEQ with evaluations. (Month 0-36) \n\n29 \n \n \n16. Collect GPS coordinates and other data required by MDEQ on all BMPs installed in the \nproject. (Month 0-36) \n \n17. Assemble data on the amount of soil saved. (Month 0-36) \n \n18. Erect project roadside signs which designate where water quality practices are in progress \nor have been completed. (Month 4-36) \n \n19. Provide continued conservation planning and application assistance to participants. \n(Month 25-36) \n \n20. Review the status of applying best management practices to reach the objectives of the \nproject.  (Month 25) \n \n21. Based upon the needs and finding of milestone 18, assistance in planning and/or \napplication will be redirected and/or accelerated. (Month 25-36) \n \n22. Publish at least 4 articles about the project. (Month 0-36) \n \n23. Publicity of the project will be increased; at least 1 field day/tour will be conducted and at \nleast 1,000 fact sheets will be developed and distributed. (Month 25-36) \n \n24. Bi-annual reports will be made to MSDEQ. (Month 0-36) \n \n25. Make Final report to MSDEQ. (Month 36) \n \n\n30 \n \nAPPENDIX B \n \n \nChecklist of Watershed Implementation Elements \n \n\n31 \n \n \nRequired 9 Elements for §319 Grant Location in Watershed Based Plan \n1. Causes and Sources of Pollution Total Maximum Daily Load (TMDL), page 12 \n2. Load Reductions Needed Total Maximum Daily Load (TMDL), pages 12-14 \n3. Management Measures to Achieve Goals \nManagement Actions pg. 15; Table 6 pg. 17; Table 7 pg. 17; \nTable 10 pg. 20 \n4. Technical and Financial Support Needed \nTable 9: Total Budget for Jasper Creek Watershed Based Plan and \nImplementation, page 18 \n5. Education and Outreach Education and Outreach Activities, page 18 \n6. Implementation Schedule \nMilestones for Section 319 Watershed Implementation Project, \npage 27 \n7. Milestones \nMilestones for Section 319 Watershed Implementation Project, \npage 27 \n8. Criteria to Measure Progress \nProject Tracking and Assessment of Progress, page 16; Desired \nResults/Benefits, page 16; Water Quality Monitoring, page 23 \n9. Monitoring Water Quality Monitoring, page 23 \n\n32 \n \nAPPENDIX C  \n \n \nProject Summary Scorecard \n\n33 \n \n \nFor more information, contact Patrick Vowell at pvowell@mdeq.ms.gov or (601) 961-5387\nProject Partners: Mississippi Department of Environmental Quality, U.S. EPA, Mississippi Soil and Water Conservation \nCommission, Union County and Tippah County Soil and Water Conservation Districts, and the USDA Natural Resource \nConservation Service.\nSection 319(h) Grant4,864,460\nNRCS EQIP Program\n2016 - 2019\nTotal\n212,000434144\n2,469\n2,613\nJasper Creek Watershed Nutrient and Sediment Load Reductions\nLoad reductions are calculated using the EPA's Region 5 \nLoad Reduction Model. \nNutrient estimates only consider sediment bound N \nand P, not dissolved components.\nPractices do not include the many unassisted practices \ndesigned and installed by private landowners.\nSediment Saved: 5,076,460 lbs.\nEnough to fill 210 dump trucks (14 CuYd bed)!\nNitrogen Saved: 2,613 lbs.\nEnough to fill 21 wheelbarrows (2 ft\n3\n)!\nPhosphorus Saved: 5,780 lbs.\nEnough to fill 47 wheelbarrows (2 ft\n3\n)!\nx17\nx39\nx177\nLanduse Across Jasper Creek Watershed    \n2016 National Land Cover Dataset\n5,780\nNitrogen \nReduction (lbs)\nPhosphorus \nReduction (lbs)\nSediment \nReduction (lbs)\nTime PeriodFunding Source\n5,346\n2016 - 2018\n5,076,460",
  "metadata": {
    "id": "jasper-creek-watershed-plan-2019",
    "originalName": "jasper-creek-watershed-plan-2019.pdf",
    "mergedFrom": [
      "jasper-creek-watershed-plan-2019-1.json",
      "jasper-creek-watershed-plan-2019-2.json",
      "jasper-creek-watershed-plan-2019-3.json",
      "jasper-creek-watershed-plan-2019-4.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.694Z",
    "length": 57751
  }
}