{
  "id": "mill-creek-watershed-plan",
  "rawText": "\n\n 1 \nRANKIN COUNTY BOARD OF SUPERVISORS \n \nMILL CREEK WATERSHED IMPLEMENTATION PLAN (MCWIP) \n \nPROPOSAL FOR  \nNON-POINT SOURCE SEDIMENT CONTROL PROJECT \n(Section 319h Funding) \n \nPROJECT TITLE: The Mill Creek Watershed Implementation Plan (MCWIP) is \nsponsored by the Rankin County Board of Supervisors with the intended purpose of \nformulating a strategic plan for the stabilization of channel inverts and banks along Mill \nCreek, the reduction of non-point source pollutants (NPSP) throughout the entire Mill \nCreek watershed, the development of water quality educational programs for citizens \nwithin the watershed, and the development of ordinances designed to promote low impact \ndevelopment.  The details of the MCWIP will de developed by a Watershed \nImplementation Team (WIT). \n \nThe Non-Point Source Sediment Control Project addresses one component of the \nMCWIP, that is, the reduction of non-point source (NPS) pollutants, more specifically, \nsediment, within Mill Creek. \n \nPROJECT ABSTRACT: The Non-Point Source Sediment Control Project involves \nthe placement of sedimentation\\detention basins throughout the watershed, placed at \nstrategic locations, with the specific intent to reduce the solids (sediment) content \nentering Mill Creek. The sedimentation\\detention basins can accomplish this goal \nthrough the direct removal of sediment that appears in the stormwater runoff and by \nreducing formation of sediment through the reduction in peak flows (and velocities) from \nsignificant rainfall events. The preliminary opinion of the total cost of this project is \n$1,109,437 ($665,662 Section 319 Funds, $443,773 local funds). A preliminary site map \nof the proposal is included in the application information. \n \nLEAD ORGANIZATION: The lead organization will be the Rankin County Board of \nSupervisors, 211 East Government Street, Brandon, Mississippi, 39042, telephone (601) \n825-1475, facsimile (601) 825-9600. \n \nCOOPERATING ORGANIZATIONS: Other organizations expected to be interested \nin becoming part of the WIT are the City of Flowood, the Castlewood Homeowners \nAssociation, Inc., the Mill Creek Homeowners Association, Inc., Castlewood Golf \nCourse, Noranco Utilities, Inc., Langford Water Association, Inc., United States \nGeological Survey (USGS), The Natural Resources Conservation S (NRCS), The Pearl \nRiver Valley Water Supply District (PRVWSD), The Rankin County School District \n(RCSD), Mississippi Department of Transportation (MDOT), Mississippi Department of \nNatural Resources, Office of Pollution Control (DEQ, OPC), and various large land \nowners, and other miscellaneous citizen groups and homeowner associations. \n \n\n 2 \nAPPLICANT’S FINANCIAL OFFICER: Norman McLeod, County Administrator, \n211 East Government Street, Brandon, Mississippi, 39042, telephone (601) 825-1475, \nfacsimile (601) 825-9600. \n \nPROJECT LOCATION: The mouth of the Mill Creek watershed lies on the south side \nof Pelahatchie Bay in the Ross Barnett Reservoir in Rankin County, Mississippi. The \nwatershed runs southeastward from the reservoir and terminates along Mississippi Hwy \n471 approximately north of Brandon. The watershed is bounded on the west by Grants \nFerry Road and the east by Mississippi Hwy 471. The watershed consist of approximately \n6,250 acres. Areas to be explored for locations of NPS sediment and therefore, \nsedimentation\\detention basins being proposed at this time include all existing \ndevelopments south and east of Mississippi Hwy 25 and the Castlewood Golf Course. \n \nPROJECT OBJECTIVE: The objective of the MCWIP is to improve water quality in \nMill Creek by stabilizing the channel invert and banks along Mill Creek and reducing \nnon-point source pollutants to the creek. The objective of The Non-Point Source \nSediment Control Project  currently being proposed is to reduce non-point source \npollutants, specifically solids (sediment), entering Mill Creek (and ultimately the Ross \nBarnett Reservoir). \n \nPROJECT DESCRIPTION: The MCWIP will be a multi component strategic plan for \nimproving water quality in Mill Creek. The plan will involve the formation of a \nWatershed Implementation Team (WIT) comprised of various groups interested in \nimproving water quality within Mill Creek. The WIT will develop low impact \ndevelopment plans and ordinances designed to improve water quality by stabilizing \nphysical portions of the creek while also reducing non-point source pollutants, especially \nsediment. It is believed that sediment is the major non-point source pollutant entering \nMill Creek. The major cause of sediment introduction is thought to be development and \nconstruction operations. Future development will be controlled through previously \ndeveloped Phase II regulations. The MCWIP will attempt to address non-point source \npollutants contributed by existing conditions. The reduction of non-point source \npollutants will be accomplished by various methods but the Best Management Practices \n(BMP’s) outlined in the Mississippi Department of Environmental Quality Manual on \nStormwater Management will be used as a guideline. Strategically placed dry \nsedimentation\\detention basins are expected to be instrumental in reducing sediment \nquantities in Mill Creek. Periodic sampling at various points along the creek will be \nconducted to measure the success of the sediment reduction project and to identify other \npollutants in the creek and help determine the source of those pollutants and possible \nreduction measures.  \n \nOther components of the MCWIP currently under contract include a portion of Mill \nCreek immediately northwest of Mississippi Hwy 25. The construction contract includes \nchannel invert and bank stabilization with the placement of rip rap stone. The project is \nbeing funded through a NRCS grant. Construction is scheduled to begin mid August 2005 \nand be completed by October 2005. The total cost of the project is $225,000. \n \n\n 3 \nAn additional $750,000 in funding for continued bank and channel invert stabilization is \nexpected in FY 06. Presentations have been made to NRCS and the State’s congressional \ndelegation for a total of 5.8 million dollars to complete bank and invert stabilization \nprojects along Mill Creek. \n \nThe Non-Point Source Sediment Control Project will evaluate all existing \ndevelopments, residential and commercial, as well as the Castlewoods Golf Course in an \nattempt to determine the most feasible location for up to three dry \nsedimentation\\detention basins. The specific intent of the basins will be to reduce the \nentrance of solids (sediment) into Mill Creek by forming a “calming zone” in the flow \npattern allowing heavier material to settle to the bottom of the basin. A secondary benefit \nof the basins will be the reduction of peak flow during significant rainfall events. The \nreduction in peak flow will reduce flow velocities and reduce the potential for scour, \nbank erosion, and invert head cutting. \n \nPROJECT TIMELINE AND PROJECT MILESTONES:  \n \nMonth 0- Grant Award* \nMonth 1-2 Organize WIT* \nMonth 3- D evelop criteria for evaluation of existing developments for NPSP contribution \nMonth 4/5- Evaluate existing developments for NPSP contribution; begin formulation of \nMCWIP \nMonth 6- Develop master plan of strategically placed dry sedimentation\\detentions basins \nand prioritize based on cost/benefit; continue formulation of MCWIP \nMonth 7- Select top three locations and begin negotiation with property owners: continue \nformulation of MCWIP \nMonth 8/9- Complete ROW acquisition; Begin design*: continue formulation of MCWIP \nMonth 9/11- Complete design: continue formulation of MCWIP \nMonth 12- Advertise project: continue formulation of MCWIP \nMonth 13- Open bids: continue formulation of MCWIP \nMonth 14- Issue Notice to Proceed*: continue formulation of MCWIP \nMonth 15/20- C onstruction: continue formulation of MCWIP \nMonth 21- Complete Construction*: continue formulation of MCWIP \n \n*Milestones \n \nMEASURE(S) OF PROJECT SUCCESS: The most direct measure of project success \nwill be the amount of sediment removed from each sedimentation\\detention basin during \nmaintenance operations. Baseline turbidity and solids concentrations will be determined \nand periodic post-project testing will be compared to baseline data to measure project \nsuccess. Indirect benefits, while not quantitatively measurable, will be the reduction in \npeak flow during periods of significant rainfall events. This reduction in peak flow will \ncertainly reduce erosion and sediment introduction into Mill Creek.  \n \nPROJECT PERIOD: 21 months \n \n\n 4 \nBUDGET: Summary \n \nBudget Category Federal Funds Local Funds Total Funds \nProject Development  $            24,072   $            16,048   $            40,120  \nDesign Engineering  $            37,305   $            24,870   $            62,175  \nEnvironmental  $            44,601   $            29,734   $            74,335  \nLand Acquisition  $            47,916   $            31,944   $            79,860  \nConstruction  $           473,800   $           315,867   $           789,667  \nConstruction Engineering  $            18,228   $            12,152   $            30,380  \nOn-site Representative  $            19,740   $            13,160   $            32,900  \nTotals  $           665,662   $           443,775   $        1,109,437  \n    \nCategory Details \n   \nProject Development \n   \nPosition Hours Hourly Billing Total \nAdministrator 40  $                 100   $              4,000  \nSupervisor 1 40  $                 100   $              4,000  \nSupervisor 2 40  $                 100   $              4,000  \nCounty Road Manager 24  $                 100   $              2,400  \nCounty Engineer 1 80  $                 135   $            10,800  \nCounty Engineer 2 120  $                 115   $            13,800  \nSecretarial 16  $                   35   $                 560  \nDrafting 16  $                   35   $                 560  \nTotal    $            40,120  \n    \nDesign Engineering \n   \nPosition Hours Hourly Billing Total \nCounty Engineer 50  $                 135   $              6,750  \nProject Manager 60  $                 115   $              6,900  \nProject Engineer 225  $                   85   $            19,125  \nDrafting 80  $                   35   $              2,800  \nSecretarial 60  $                   35   $              2,100  \nReproduction 1  $                 500   $                 500  \nData Collection 200  $                 120   $            24,000  \n     \nTotal    $            62,175  \n    \nEnvironmental \n   \nPosition Hours Hourly Billing Total \nCounty Engineer 12  $                 135   $              1,620  \nProject Manager 24  $                 115   $              2,760  \nProject Engineer 48  $                   85   $              4,080  \nDrafting 10  $                   35   $                 350  \nSecretarial 15  $                   35   $                 525  \nEnvironmental Consultant 100  $                 150   $            15,000  \nMitigation (Allowance) 1  $            50,000   $            50,000  \n     \n\n 5 \nTotal    $            74,335  \n    \nLand Acquisition \n   \nPosition Hours Hourly Billing Total \nCounty Engineer 8  $                 135   $              1,080  \nProject Manager 8  $                 115   $                 920  \nProject Engineer 36  $                   85   $              3,060  \nDrafting 24  $                   35   $                 840  \nSecretarial 16  $                   35   $                 560  \nLegal 60  $                 150   $              9,000  \nSurvey 120  $                 120   $            14,400  \nLand (Allowance) 1  $            50,000   $            50,000  \nTotal    $            79,860  \n    \nConstruction \n   \nItem Quantity Unit Price Extension \nMobilization, LS 1  $            25,000   $            25,000  \nClearing/Grubbing, AC 35  $              2,000   $            70,000  \nExcavation, CY, FM 282333  $                    2   $           564,667  \nOutfall Structures, EA 3  $            10,000   $            30,000  \nSite Restoration, AC 35  $              2,000   $            70,000  \nRip Rap Stone, Ton 600  $                   50   $            30,000  \n    $                   -    \n    $                   -    \nTotal    $           789,667  \n    \nConstruction Engineering \n   \nPosition Hours Hourly Billing Total \nCounty Engineer 40  $                 135   $              5,400  \nProject Manager 60  $                 115   $              6,900  \nProject Engineer 120  $                   85   $            10,200  \nDrafting 40  $                   35   $              1,400  \nSecretarial 48  $                   35   $              1,680  \nSurvey 40  $                 120   $              4,800  \n    $                   -    \n    $                   -    \nTotal    $            30,380  \n    \nOn-Site Representative \n   \nPosition Hours Hourly Billing Total \nOn-Site Representative, Reg 700  $                   42   $            29,400  \nOn-Site Representative, O.T. 70  $                   50   $              3,500  \n    $                   -    \n    $                   -    \n    $                   -    \n    $                   -    \n    $                   -    \n\n 6 \n    $                   -    \nTotal    $            32,900  \n \n \nConstruction excavation quantity based on thirty-five total acres at an average cut of five \nfeet. ",
  "metadata": {
    "id": "mill-creek-watershed-plan",
    "originalName": "mill-creek-watershed-plan.pdf",
    "mergedFrom": [
      "mill-creek-watershed-plan-2005.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.710Z",
    "length": 13381
  }
}