{
  "id": "muddy-bayou-opossum-bayou-9-key-element-plan-2022",
  "rawText": "\n\nMuddy Bayou Watershed Plan GY2022 \n1 \n \nMuddy Bayou Watershed Plan \n9 Key Element Plan \nHUC 080302020403 \nMWS 9334 \nGY 22 Project Area \nVersion 0 (9/22/2022) \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Muddy Bayou Watershed is located in the south-central portion of Quitman County and the \nnorthwestern part of Tallahatchie County in North Mississippi covering approximately 32,731 \nacres.  From its headwaters east of Stover, Mississippi, Muddy Bayou meanders south from the \nnorthern areas of the watershed moving east along the boundary and finally draining into \nOpossum Bayou at the mouth of the watershed. The Muddy Bayou watershed (MWS 9334) is \nlocated in the Mississippi River Delta region within level III ecoregion (73) Mississippi Alluvial \nPlain and level IV (73b) Loess Plains. Most streams in the Muddy Bayou watershed are \nintermittent except for Muddy Bayou and several drainage canals. According to the 2019 \nNational Land Cover Database (NLCD), the landuse within this watershed is comprised of \napproximately 76% cropland, 21% wetlands, and 3% other (water and urban) as depicted in \nFigure 1. \n \nThe water-use classification for all water bodies in this watershed, as established by Regulations \nfor Water Quality Criteria for Intrastate, Interstate, and Coastal Waters (MDEQ, 2021), is Fish \nand Wildlife. Waters with this classification are intended for fishing and propagation of fish, \naquatic life, and wildlife. Waters that are classified as Fish and Wildlife should also be suitable \nfor secondary contact recreation, which is defined as incidental contact with water including \nwading and occasional swimming.   \n \nWhile this watershed does not have an active listing on Mississippi’s Section 303(d) List of \nImpaired Streams, Muddy Bayou serves as the mainstem drainage for the watershed which \nultimately empties directly into Opossum Bayou.  Opossum Bayou (MS TMDL segment \nMS269E) located east of Sumner, Mississippi was originally included as an “evaluated” \nassessment in Mississippi’s Section 303(d) List in 1998.  Assessments designated as “evaluated” \nwere performed using anecdotal data and information from the watershed, but there was no \nactual monitoring data to support the determination.  Based on the evaluated information \nprovided, the entire Opossum Bayou watershed was listed as being impacted for a suite of \ncauses: pesticides, nutrients, siltation, organic enrichment/low dissolved oxygen and pathogens. \nAs such, Muddy Bayou is a contributing source to the nutrient and sediment TMDLs that have \nbeen developed for Opossum Bayou (MS269E).  \n \n\nMuddy Bayou Watershed Plan GY2022 \n2 \n \n \n \nFigure 1: Landuse Distribution in the Muddy Bayou Watershed \n \nOpossum Bayou (MS269E) is included in the regional sediment TMDL that was developed for \nthe Yazoo River Basin: Total Maximum Daily Load Yazoo River Basin Delta Region for the \nDelta Region  in 2008. There are only two facilities in the Muddy Bayou Watershed with \n\nMuddy Bayou Watershed Plan GY2022 \n3 \n \nNPDES permits that include limits for Total Suspended Solids (TSS) which is used as an \nindicator of sediment contributions from permitted activities.  These are the town of Lambert \nPOTW and the Quitman County Correctional Facility located in the very upper part of the \nMuddy Bayou watershed. However, these two facilities are considered minor as these sources \nprovide negligible loadings of suspended solids to the receiving waters compared to wet weather \nsources (e.g., NPDES regulated construction activities and nonpoint sources). Also, the TSS \ncomponent of a NPDES permitted facility is different from the pollutant addressed within that \nsediment TMDL. The pollutant of concern for that TMDL is sediment from landuse runoff and \nin-channel processes.  Certain contaminants may be associated with sediment such as pesticides \nand nutrients. These contaminants were not addressed directly within the sediment TMDL. \nHowever, these contaminants would also be controlled by the same best management practices \n(BMPs) that control the sediment from nonpoint sources of pollution.  The TMDL calls for an \n80-84% reduction in sediment.  Nonpoint loading of sediment in a water body results from the \ntransport of material into receiving waters by the processes of mass wasting, head cutting, \ngullying, and sheet and rill erosion. Sources of sediment include agriculture, silviculture, \nrangeland, construction sites, roads, urban areas, mass wasting areas, gullies, surface mining, in-\nchannel and instream sources, and historical land use activities and channel alterations. \n \nOpossum Bayou (MS269E) has an additional TMDL for nutrients: Total Maximum Daily Load \nTotal Nitrogen and Total Phosphorus for Opossum Bayou  (MDEQ, 2008).  Mississippi does not \nhave water quality standards for allowable nutrient concentrations. MDEQ currently has a \nNutrient Task Force (NTF) working on the development of criteria for nutrients.  The TMDL \nidentified an annual concentration of 1.06 mg/l as an applicable target for Total Nitrogen (TN) \nand 0.16 mg/l for Total Phosphorus (TP) for water bodies located in the west side of the Delta \nRegion in the Yazoo Basin.  This TMDL calls for TP to be reduced by 84.7% and TN to be \nreduced by 94.4%. Non-point loading of nutrients and organic material in a water body results \nfrom the transport of the pollutants into receiving waters by overland surface runoff, \ngroundwater infiltration, and atmospheric deposition. Unlike nitrogen, phosphorus is primarily \ntransported in surface runoff when it has been sorbed by eroding sediment.  These contaminants \nwould also be controlled by the same best management practices (BMPs) that control the \nsediment from nonpoint sources of pollution. \n \nFigure 2 shows the location of the impaired segment along with the water quality monitoring \nlocation in the Muddy Bayou Watershed. \n \n \n\nMuddy Bayou Watershed Plan GY2022 \n4 \n \n \nFigure 2: Muddy Bayou Watershed Monitoring Location and Opossum Bayou Segment MS269E\n\nMuddy Bayou Watershed Plan GY2022 \n5 \n \nElement b: Expected Load Reduction \n \nThe MDEQ will work with agency resource partners to identify and implement BMPs to address \npathogen and sediment concerns in the Muddy Bayou Watershed.  Conservation practices that \naddress sediment often provide an additional benefit in the reduction of nutrients as they attach \nto sediment particles in run-off.  The United States Department of Agriculture (USDA) Natural \nResource Conservation Service (NRCS) has a list of approved BMPs to address sediment issues \nand this list will be used to identify candidate BMPs in the watershed. \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2021) regulation does not include a numerical water quality standard for aquatic life \nprotection due to sediment; however, a narrative standard for the protection of aquatic life was \ninterpreted to determine an applicable target for the sediment TMDL in the Muddy Bayou \nwatershed.  The narrative standard states “...waters shall be free from materials attributable to \nmunicipal, industrial, agricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions in such degree as to create a nuisance, render the waters \ninjurious to public health, recreation, or to aquatic life and wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or impair the waters for any designated use.” The regional \nsediment TMDL for the Delta which includes the Opossum Bayou (MS269E) watershed \nconcluded that sediment yields would need to be reduced by 80 to 84% in the watershed.  All \nsediment yield reductions were developed from suspended sediment concentration data measured \nat stable streams in the same ecoregion(s).  The targets were developed to reflect stable stream \nconditions using reference sediment yields.  These reference conditions were established by the \nUSDA’s Channel and Watershed Processes Research Unit (CWPRU) at the National \nSedimentation Laboratory (NSL). \n \nMDEQ does not have numeric nutrient criteria. To develop the TN and TP targets included in the \nOpossum Bayou TMDL, a percentile approach was used following EPA recommendations. The \nTotal Nitrogen and Total Phosphorus TMDL for Opossum Bayou (MS269E) recommended an 84.7% \nreduction in Total Phosphorus (TP) with a target annual concentration of 0.16 mg/L.  The TMDL \nalso recommended a 94.4% reduction in Total Nitrogen (TN) with an annual target concentration of \n1.06 mg/L.  \n \nThe MDEQ will work with agency resource partners to identify and implement BMPs to address \nsediment and nutrient concerns in the Muddy Bayou Watershed. The United States Department \nof Agriculture (USDA) Natural Resource Conservation Service (NRCS) has a list of approved \nBMPs to address water quality concerns.  Conservation practices that address sediment often \nprovide an additional benefit in the reduction of nutrients as they attach to sediment particles in \nrun-off.    Practices approved by NRCS will be used to identify candidate BMPs in the Muddy \nBayou watershed.   \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC), the Natural Resource Conservation Service (NRCS), and the local Soil \nand Water Conservation Districts (SWCDs) throughout the state.  These SWCDs are typically \nhoused within USDA Service Centers co-located with NRCS offices.  Routine work within these \n\nMuddy Bayou Watershed Plan GY2022 \n6 \n \noffices includes regular communication with the local landowners and operators within the \nwatershed as they work to support sign-ups for Farm Bill initiatives.  Technical support staff in \nthese offices routinely coordinate with local stakeholders to gauge landowner interest and based \non their expertise, have identified a suite of BMPs that should be effective in addressing \nnonpoint source pollution sources in the Muddy Bayou Watershed.   \n \nStaff from MSWCC and the SWCD depend upon assistance from their NRCS partners in \ndetermining landowner interest in the watershed because they are on the farms and in the fields \nwith the landowners, understand the needs at the local level, and have knowledge of unfunded \napplications for federal program assistance which meet Section 319 eligibility requirements.  \nBased on their analysis, installation of the following BMPs would mitigate sediment issues in the \nMuddy Bayou watershed helping the stream recover: grade stabilization structures, streambank \nand shoreline protection, cover crops, and the instillation of dikes and other water control \nstructures.  Factors considered for determining specific locations for the placement of BMPs \nincluded the following attributes based upon best professional judgement of trained NRCS, \nSWCD and MDEQ Staff: \n \n1. Likely water quality benefit; \n2. Willingness of landowners to participate; \n3. Implementation of the recommendations included in the TMDL(s); \n4. Ease of measuring effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the grant period); \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project who may contribute match include MSWCC, Quitman and Tallahatchie \nCounty Soil and Water Conservation Districts, NRCS, and/or local landowners and operators.  \nFor project implementation, administration, management, and watershed plan revision, as well as \nhosting and facilitating team meetings, MDEQ plans to work under a memorandum of agreement \n(MOA) with the MSWCC to implement this project.  Project partners provided the funding \namounts used to estimate costs for BMP installation.  Below is summary of estimated costs for \npotential BMPs and overall project implementation: \n \n\nMuddy Bayou Watershed Plan GY2022 \n7 \n \nCost Estimate: Full Project Implementation \n \nBMPs \n \nSize/Amount \nEstimated \nCost \nGrade Stabilization Structure (low flow) \n \n15 each $52,329 \nGrade Stabilization Structure (med. flow) \n \n20 each $263,123 \nGrade Stabilization Structure (high flow) \n \n10 each $205,373 \nGrade Stabilization Structure (very high \nflow) \n \n10 each $330,332 \nCover Crops \n \n1,132 acres $79,705 \nDikes \n \n130,000 CuYd $544,700 \nStructure for Water Control \n \n24,216 Inft $91,536 \nStreambank and Shoreline Protection \n \n1,135 ft $730,385 \nTechnical Assistance* \n \nN/A $45,000 \nEducation and Outreach* \n \nN/A $28,000 \nMonitoring*  \n \nN/A $25,000 \nProject Management, Implementation, \nCoordination, Plan Revision* \n \n  $135,000 \nTotal Estimated Cost \n \n  $2,530,483 \n \nNOTE: Conservation Best Management Practices provide a 40% match at a minimum \n* Denotes fields that are estimated upon three incremental funding cycles of the project  \n \nDue to the magnitude of BMP needs, this project will need to be funded incrementally using \nmultiple sources of funds. To fully address all suggested conservation needs in the watershed, \nthis plan recommends funding be provided in 3 increments. To maximize education and outreach \nactivities and monitoring efforts, MDEQ plans to leverage with existing programs already \nallocated for funding where possible. Below is the estimated budget for the first incremental \nfunding (Phase 1) of this project: \n \n\nMuddy Bayou Watershed Plan GY2022 \n8 \n \nCost Estimate: Phase 1 Implementation: \n \nBMPs Amount \nEstimated \nCost \nGrade Stabilization Structure (low \nflow)  15 ea  $52,329 \nDikes \n30,000 cy $125,700 \nStructure for Water Control \n4,216 Inft $15,935 \nCover Crops \n107 ac $8,195 \nStreambank & Shoreline Protection \n135 ft. $95,477 \nTechnical Assistance N/A $15,000 \nEducation and Outreach N/A $12,000 \nMonitoring  N/A $16,000 \nProject Management, \nImplementation, Coordination, \nPlan Revision \n  $55,000 \nTotal Estimated Phase 1 Cost \n  \n$395,636 \n \nNOTE: Conservation Best Management Practices provide a 40% match at a minimum. \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of nonpoint source pollution: agriculture, construction, forestry, on-site \nwastewater disposal, surface mining, urban storm water runoff, and hydrologic modification.  \nAudiences from pre-school to adults throughout the state are reached with a variety of mature, \nwell-designed programs each year. These programs, events, manuals, and literature can be used \nin the watershed project by tailoring them to address pollutants of concern.  A positive approach \nis used to reach the full diversity of people in the community with projects that foster a “sense of \nplace”, a “sense of pride in community”, and a sense of the native plants, animals, and general \necology of their region.  Stakeholders and coordinators work together to participate in problem-\nsolving, brainstorming, plan development, training workshops, soil and water conservation field \ndays and other activities that promote collaboration and ownership of the watershed, as well as \nsolutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nMuddy Bayou watershed are listed below: \n \n  Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n\nMuddy Bayou Watershed Plan GY2022 \n9 \n \n Teacher workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Muddy Bayou Watershed. \n  Mobile Classroom Education and Outreach Events - for school ages kindergarten –5\nth\n \ngrade students. \n “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Muddy Bayou \nWatershed Implementation Team (WIT) will participate in collaborative meetings. The purpose \nof the meetings will be to identify partners, update the watershed plan, and host field days to \nshowcase the implemented BMPs for the public.  In concert with these WIT meetings, and to \nincentivize stakeholder participation, project funding will be used to purchase food and other \nrefreshments for the WIT along with providing support for renting facilities in which to host \nthose events. In accordance with 41 CFR § 301-74.11, light refreshments, meals, and/or \nbeverages are an allowable expense under CWA Section 319, provided a description of the \nagenda, purpose, location, costs, etc., are outlined in an approved 319 grant workplan. At this \ntime the exact number of participants and locations are not known therefore costs have been \nestimated for the purposes of this plan and will be updated. \n \nElement f: Implementation Schedule \n \nThe following schedule describes the approaches and tasks that the grantee shall collaboratively \nperform with proj\n\nect partners to advance and implement this watershed-based plan. During this \neffort, resource agency partners will work with the Watershed Implementation Team and MDEQ \nProject Manager (where applicable), to perform the tasks identified below: \n  \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the \nroles, tasks, requirements, and milestones for project implementation. (Month 1) \n \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n \n3. Work with the Quitman and Tallahatchie County SWCDs, MSWCC, NRCS, and \nMDEQ to inform landowners and operators within the watershed about the project \nand work to secure commitments from priority area landowners and operators who \nare willing to participate in the project.  (Months 1-6) \n \n4. Work with the local SWCDs, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that \nare contributing significant pollutant loads.  All BMPs shall be installed in \n\nMuddy Bayou Watershed Plan GY2022 \n10 \n \naccordance with the guidelines developed in the latest edition of the NRCS Technical \nField Manual, or other approved guidelines.  (Months 1-36) \n \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion \nand implementation of an effective and efficient plan to monitor baseline water \nquality conditions in the watershed and track changes in water quality over time \nresulting from the BMPs implemented through this project.  (Months 3-36) \n \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 3-36) \n \n7. Conduct inspections of BMPs during construction (Months 3-36) \n \n8. Coordinate with and support the local SWCD, MSWCC and NRCS in the collection \nof relevant GPS coordinates of all installed BMPs and incorporate this information \ninto a GIS format.  All geospatial data shall be collected in a manner consistent with \nthe Federal Geographic Data committee-endorsed standards.  (Months 3-36) \n \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. (Months 3-36) \n \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data. (1-36) \n \nElement g:  Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nMSWCC, and the Quitman and \nTallahatchie Co. Soil and Water \nConservation Districts to determine \npriority areas that are contributing \nsignificant pollutant loads to Muddy \nBayou \nTarget priority areas \nfor BMPs \nMonth 1-36 \nEstablish Watershed Implementation \nTeam.  \nEstablish WIT \n \nMonth 1-2 \nInitiate watershed monitoring Baseline Condition \nMonitoring \nMonths 1-12 \nMeet with landowners and cooperators \nto secure commitments to install BMPs \nin priority areas \nLandowner \nCommitment \nMonths 1-36 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT Meetings Months 1-36 \nImplement BMPs BMP Instillation Months 6-36 \n\nMuddy Bayou Watershed Plan GY2022 \n11 \n \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection Months 6-36 \nBegin monitoring to collect data on \npost-BMP water quality \nPost-BMP Monitoring  Months 40-48 \nImplement education and outreach plan   Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal: Reduce sediment and nutrient loads entering waters in the Muddy Creek Watershed that could \ncontribute to impairment in Opossum Bayou. \n \nElement h:  Load Reduction Evaluation \n \nMississippi’s water quality criteria do not include a water quality standard applicable to aquatic \nlife protection due to sediment or nutrients. However, a narrative standard for the protection of \naquatic life was interpreted to determine an applicable target for Opossum Bayou (TMDL \nMS269E) which serves as the receiving stream for the drainage from the Muddy Bayou \nWatershed. The narrative standard is that waters shall be free from materials attributable to \nmunicipal, industrial, agricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions in such degree as to create a nuisance, render the waters \ninjurious to public health, recreation, or to aquatic life and wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or impair the waters for any designated uses.  In lieu of \nnumeric criteria for sediment, monitoring will be conducted to collect data on parameters that are \nconsidered surrogates for sediment concentrations and may include measurements for Total \nSuspended Solids, Total Suspended Sediment, and turbidity along with conventional parameters \ngenerally measured to determine aquatic health (e.g. Dissolved Oxygen, pH, Temperature, \nConductivity).  Water quality samples will be taken to measure total nitrogen and total \nphosphorus as well.  The following thresholds will be used to measure compliance with water \nquality criteria and/or target thresholds:   \n \nSuccess Measurement Thresholds: \nParameter Threshold \nDissolved Oxygen \nDaily Average of 5.0 mg/L; Instantaneous threshold of 4.0 \nmg/L \nDissolved Oxygen % \nSat. > 70% - < 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous \nthreshold less than 1500 mg/L \nChemical Oxygen \nDemand <50 mg/l \nTurbidity <100 NTU \n\nMuddy Bayou Watershed Plan GY2022 \n12 \n \nTotal Suspended Solids <80 mg/l \nTotal Nitrogen 1.05 mg/L  \nTotal Phosphorus 0.16 mg/L \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Muddy Bayou.  In the event data \nindicate little or no positive change, a Stressor Analysis will be conducted to determine if any \nnew or additional stressors are preventing improvements to water quality.  If any new stressors \nare identified, the Watershed Implementation Team will identify future actions/activities to \naddress those stressors. \n \nElement i: Monitoring  \n \nPrior to BMP installation, pre-implementation water quality chemical monitoring will be \ncollected to serve as baseline data for the project along with any historical data available in \nMuddy Bayou. Water quality monitoring will include water chemistry data (nutrients, suspended \nsolids, oxygen demand, chlorides, etc.), in-situ field measurements for such parameters as \ndissolved oxygen, pH, temperature, specific conductance, and turbidity, datalogger (sonde) \ndeployment for continuous in-situ field measurement data. A list of this historical water quality \nmonitoring in the Muddy Bayou watershed is provided in the table below and the sample \nlocations are shown in Figure 2. \n \nStation \nID \nWater \nSample \nYear(s) \nCollecting \nAgency \nProject \nWater \nChem \nIn-\nSitu \nSonde Benthics \nBody \n113B47 \nMuddy \nBayou \n2012   MDEQ    D-BISQ    X     X \n \nX \n \nMonitoring locations will be selected using best professional judgment and will be targeted to \nreflect water quality downstream of BMP activity.  Once BMP installation is complete, and there \nhas been sufficient time for the stream to stabilize, post BMP monitoring will be initiated.  Post \nBMP monitoring will be conducted in a way that allows for comparison with the pre-\nimplementation data.  Because recovery periods of streams can be dependent on type and amount \nof BMPs installed, more than 1 year of post BMP data may be needed to observe a change in \nwater quality.  In some cases, it may take 5 or more years to see full benefits of BMPs. All data \ncollection efforts will be conducted using trained personnel following established Standard \nOperating Procedures and adhering to agency Quality Assurance protocols.   \n \n ",
  "metadata": {
    "id": "muddy-bayou-opossum-bayou-9-key-element-plan-2022",
    "originalName": "muddy-bayou-opossum-bayou-9-key-element-plan-2022.pdf",
    "mergedFrom": [
      "muddy-bayou-opossum-bayou-9-key-element-plan-2022-1.json",
      "muddy-bayou-opossum-bayou-9-key-element-plan-2022-2.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.712Z",
    "length": 26102
  }
}