{
  "id": "north-tippah-creek-watershed-plan-2013",
  "rawText": "\n\n \n NORTH TIPPAH CREEK WATERSHED \nIMPLEMENTATION PLAN \n \n \n \n \nDraft \nMay 2013 \n\n \n 2 \n \nNorth Tippah Creek  \n Watershed Implementation Plan \n \n \n \nPrepared for: \n \nNorth Tippah Creek Watershed Implementation Team \n \nMississippi Department of Environmental Quality \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n \n \n \n \n \n \n\n \n 3 \nTable of Contents \n \nI. Executive Summary          6 \n \nII. Vision Statement          8 \n \nIII. Mission Statement          8 \n \nIV. Watershed Implementation Team        9 \n \n V. Watershed Description         10 \n  \nVI. Stakeholder Interests         14 \n \nVII. Water Resources          15 \n     A.  History of Activity in the Watershed        15 \n     B. Wildlife and Fisheries         16 \n     C. Designated Use Classifications and Water Quality Standards    16 \n     D.  Current Status of Waterbodies in the Watershed     16 \n     E. TMDLs           16 \n \nVIII. Watershed Management Actions       17 \n       Implementation of Best Management Practices       \nA. Sediment and Nutrient BMPs       17 \n    1. Stakeholders Interests        17 \n    2. Goals/Objectives         17 \n    3. Management Actions        17 \n   4. Project Tracking/Assessment of Progress      18 \n    5. Desired Results/Benefits        18 \n    6. Roles/Responsibilities        18 \n    7. Budget          19 \n \nIX. Education/Outreach Activities        20 \n       A. Educational Activities to be implemented      20 \n 1. Signage          20 \n     a. Indicators          20 \n     b. Schedule          21 \n     c. Budget          21 \n 2. Field Day          21 \n     a. Indicators          21 \n     b. Schedule          21 \n     c. Budget          21 \n 3. Educational Literature        22 \n     a. Indicators          22 \n     b. Schedule          22 \n     c. Budget          22 \n\n \n 4 \n 4. Watershed Harmony Puppet Show       22 \n     a. Indicators          23 \n     b. Schedule          23 \n     c. Budget          23 \n 5. Tippah County Fair         23 \n     a. Indicators          23 \n     b. Schedule          23 \n     c. Budget          24 \n 6. Water Bill Mailers         24 \n     a. Indicators          24 \n     b. Schedule          24 \n     c. Budget          24 \n 7. Presentations         25 \n     a. Indicators          25 \n     b. Schedule          25 \n     c. Budget          25 \n 8. Radio Advertisements        25 \n      a. Indicators          25 \n     b. Schedule          25 \n     c. Budget          26 \n 9. Adopt-A-Stream         26 \n      a. Indicators          26 \n     b. Schedule          26 \n     c. Budget          26 \n 10. Project: Food, Land and People       27 \n      a. Indicators          27 \n     b. Schedule          27 \n     c. Budget          27 \n 11. Tippah County Conservation Carnival      27 \n      a. Indicators          27 \n     b. Schedule          27 \n     c. Budget          28 \n 12. Displays          28 \n      a. Indicators          28 \n     b. Schedule          28 \n     c. Budget          28 \n 13. Total Projected Cost of Education/Outreach Activities    29 \n 14. Total Budget North Tippah Creek  Watershed Implementation Plan  29 \n \n \n \nX. Evaluation           30 \n     A. Plan Evaluation Procedure        30 \n     B. Implementation Evaluation Strategy       30 \n 1. MSWCC          30 \n 2. MDEQ          30 \n\n \n 5 \nXI. Plan Revision          31 \n    A. Plan Revision Procedure        31 \n \nXII. Resources          32 \n \n \n \nList of Figures \n \nFigure 5.1 Land Use in North Tippah Creek Watershed     11 \nFigure 5.2 North Tippah Creek Watershed       12 \nFigure 5.3 County Map North Tippah Creek Watershed     13 \n \nList of Tables \n \nTable 1.1 North Tippah Creek Watershed Management Action Plan       7 \nTable 8.1 Funded NWQI BMPs        19 \nTable 9.1 Projected Costs for Signage       21 \nTable 9.2 Projected Costs for Field Day       21 \nTable 9.3 Projected Costs for Educational Literature      22 \nTable 9.4 Projected Costs for Watershed Harmony Puppet Show    23 \nTable 9.5 Projected Costs for Tippah County Fair      24 \nTable 9.6 Projected Costs for Water Bill Mailers      24 \nTable 9.7 Projected Costs for Presentations       25 \nTable 9.8 Projected Costs for Radio Advertisements      26 \nTable 9.9 Projected Costs for Adopt-A-Stream Workshop     26 \nTable 9.10 Projected Costs for Project: Food, Land and People Workshop   27 \nTable 9.11 Projected Costs for Tippah County Conservation Carnival   28 \nTable 9.12 Projected Costs for Displays       28 \nTable 9.13 Total Projected Education Budget      29 \nTable 9.14 North Tippah Creek Watershed Implementation Plan Total Budget  29  \n \n \nList of Appendices \n \nAppendix A- Plant and Animal Species of Special Concern \nAppendix B- Funded 319 Project Proposal \nAppendix C- Checklist of Watershed Implementation Elements \n \n \n \n\n \n 6 \nI. EXECUTIVE SUMMARY \n \n North Tippah Creek Watershed has been identified as a priority watershed by the \nMississippi Department of Environmental Quality.  North Tippah Creek is listed on Mississippi’s \n2012 303(d) List of Impaired Water bodies for biological impairment.  The Mississippi Soil and \nWater Conservation Commission, Tippah County Soil and Water Conservation District and \nUSDA Natural Resources Conservation Service thought a great impact on water quality could be \nmade in this watershed. MSWCC submitted a proposal to educate landowners/operators about \nwater quality and measures they can take to help improve the water quality in this watershed. \nThat proposal was selected for funding by MDEQ and a contract was awarded to MSWCC.  \nUnder that contract, MSWCC is required to assemble a Watershed Implementation Team to \naddress other issues and concerns within the watershed and write a Watershed Implementation \nPlan. The USGS will be monitoring waters within the watershed to determine the water quality \nand if there is a need for additional Best management Practices (BMPs) to be installed.  \n The key natural resource problems in this watershed are thought to be nutrient loading \nand sedimentation.  The Watershed Implementation Plan has the goals of reducing the nutrients \nand sediment entering the streams and creeks in the watershed, and meeting water quality \nstandards in the North Tippah Creek Watershed.  To help solve this problem, one of the \nmanagement actions is to implement a 319 water quality educational project within the \nwatershed.  The targeted area for this project is land in Tippah County that lies within the \nwatershed boundaries.  This is a one year project that will end in September of 2013.  The groups \nthat will be implementing the management action of educating landowner/operators about water \nquality include the Tippah County Soil and Water Conservation District, Natural Resources \nConservation Service, and the Mississippi Soil and Water Conservation Commission.  The \nTippah County Soil and Water Conservation District and the Natural Resources Conservation \nService can be contacted at 662-837-4464 ext. 3 for information and assistance about this \nmanagement action.  \n \n\n \nTable 1.1 North Tippah Creek Watershed Management Action Plan \n \n \n \n \n7 \nGoal Who What  Where When Contacts \nReduce nutrient and sediment   \nloading, achieve standards for Low \nDO/Organic enrichment and \nnarrative standards for nutrient \nloading, and Fish and Wildlife \nSupport designated use  \nMSWCC,  \nUSDA NRCS, Tippah \nCounty Soil and Water \nConservation District \nContinue existing programs and projects \nrelated to landowner/operator education, \nBMP implementation, and habitat \nconservation \nEntire \nwatershed \n2012-2013 Mark Gilbert, MSWCC  \n601-354-7645 \nNRCS \n662-287-7223 ext. 3 \nTippah Co. SWCD \n662-287-7223 ext. 3 \nLocal Landowners and \noperators \nGrade Stabilization Structures \nStreambank and Shoreline Protection \nCritical Area Stabilization \n   \n \n \nEntire \nWatershed \n2012-2013 Local landowners \n\n \n 8 \nII. VISION STATEMENT \n \n  The vision of the North Tippah Creek Watershed Implementation Team is to improve \nand/or protect the water quality of streams and creeks in the watershed through the effective \nmanagement of agricultural and other land use activities.  This is a place where people want to live, \nwork, recreate and raise a family.   \n \n \n \n \n \n \n \nIII. MISSION STATEMENT \n \n  The mission of the North Tippah Creek Watershed Implementation Team is to educate \nlandowners on the use and effects of new/innovative BMPs and land use planning methods that will help \nattain designated water body uses in the watershed. \n \n \n \n \n \n \n \n \n \n\n \n 9 \nIV. WATERSHED IMPLEMENTATION TEAM \n \nMembers of the Watershed Implementation Team for the North Tippah Creek Watershed include as \nfollows: \n \nLarry Freeman- Landowner \n \nTony Hill- Landowner \n \nMike Graves- Landowner \n \nPaul Lowry- Land operator \n \nDavid Clemmer- Landowner \n \nNick Simmons- Tippah County Cooperative Extension Service (Extension) \n \nDanny Braddock- Tippah County Soil and Water Conservation District (SWCD) \n \nLiz Cockrell- Tippah County Soil and Water Conservation District (SWCD) \n \nMark Gilbert- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nPatrick Vowell- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nGail Spears- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nAndy Whittington- Mississippi Farm Bureau Federation (MFBF) \n \nTom Heard- Natural Resources Conservation Service (NRCS) \n \nJustin Presson- Natural Resources Conservation Service (NRCS) \n \nJohn Estes- Natural Resources Conservation Service (NRCS) \n \nShane Stocks- United States Geological Survey (USGS) \n \nPradip Bhowal- Mississippi Department of Environmental Quality (MDEQ) \n \nSteven Utroska- Mississippi Department of Environmental Quality (MDEQ) \n \nJanet Chapman- Mississippi Department of Environmental Quality (MDEQ) \n \n \nThe Watershed team members were identified through a collaborative effort between Tippah County \nSWCD, NRCS , MSWCC and MDEQ. \n\n \n 10\nV. WATERSHED DESCRIPTION \n The North Tippah Creek watershed consists of approximately 35,521 acres.  The land uses for \nthe North Tippah Creek Watershed include approximately 3,553 acres of pastureland (10%), 8,881 acres \nof forestlands (25%), 21,316 acres of cropland (60%), and 1,776 acres other (5%).   Figure 5.1 shows the \nland uses in the North Tippah Creek watershed.  \n North Tippah Creek is located in the western portion of Tippah County, Mississippi (Figure 5.2).   \nThis watershed is located in a rural area with a sparse population of about 1,800 to 2,000.  Portions of \nthe towns of Ripley and Blue Mountain are located in this watershed.  Economic conditions that \ninfluence this watershed include the closing of industry jobs and low timber prices.  The significant \nchanges in land use in this watershed in the last 20 years are pastureland being converted to cropland.  \nTheer are no historical events or customs that have affected the culture in the watershed.   \n The soils in the watershed include Wilcox-Dulac-Falkner association (somewhat poorly drained \nand moderately well drained silty and clayey soils with slopes less than 17 percent), Ruston-Cutbert-Ora \nassociation (well drained to moderately well drained sandy soils) and Falaya-Urbo-Waverly association \n(somewhat poorly drained silty and clayey soils on wide stream bottoms).  The foregoing soil types are \ndeveloped on the outcropping Porter’s Creek formation, a marine clay depositional unit. \nNorth Tippah Creek watershed is located in the Northern Hilly Gulf Coastal Plains and \nFlatwoods/Blackland Prairie Margins ecoregions.  The wetland areas in the watershed are typically the \nareas that have backwater from the watershed structures.  \n Other named water bodies in the watershed include South Tippah Creek, Medlock Branch, \nBowling Branch, and Little Burger Branch.  There are no state or federal parks, wildlife management \nareas, national forest or other significant environmental management areas within the watershed. \n  \n \n \n \n\n \n 11\n \n\n \n 12\n \n\n \n 13\n\n \n 14\nVI. STAKEHOLDER INTERESTS \n \n   \nStakeholders in the watershed want to restore the watershed creeks and streams to a state of good \nwater quality.  The stakeholders also want to conserve and preserve the soil, water and wildlife habitat.  \nBy reducing runoff (stopping erosion and loss of topsoil) and improving habitat for fish and wildlife, \nstakeholders believe that water quality can be improved. Trees and shrubs that have washed into the \ncreeks and streams during heavy rainfall events have led to piles of debris catching on snags along the \ncreek side and slowing down the flow of the water.  Damage from beavers in the watershed is extensive.  \nThe large dams built by the beavers have also been responsible for large areas of debris that slows down \nthe water.  This has caused retarded water flow leading to localized flooding.   Due to the geography of \nthe area in the watershed, creeks rise and fall quickly adding to the flooding issue.  Once the flood \nwaters recede the topsoil is washed away taking nutrients and chemicals with it.  This increases the \npotential of starting head cuts and gullies and increasing the instability of the banks of the streams, while \nleaving debris in pastures and on cropland.  Stakeholders think utilizing a beaver control program would \nhelp reduce the sediment and nutrients entering the streams.  This would, in turn, help reduce the \nsediment and nutrients entering the streams.   \nIt is the concern of the landowners that sediment and other contaminants will affect the water \nquality in the watershed.  Another concern of the landowners is the nutrient loading into the streams \nfrom pastureland.  This could be addressed by fencing cattle out of the streams and providing alternative \nwater sources for the cattle.  The landowners are concerned with the degradation and contamination of \nthe natural springs located throughout the watershed.  The stakeholders would like to protect the natural \nsprings that are located in this watershed.  These issues and concerns occur throughout the watershed \ndue to it being a rural area in Tippah County. \n \n   \n \n \n \n \n \n\n \n 15\nVII. Water Resources \n \nA. History of Activity in the Watershed \n \n The primary players in restoration and /or conservation efforts in the North Tippah Creek \nWatershed are the Natural Resources Conservation Service, Tippah County Soil and Water \nConservation District and the Mississippi Soil and Water Conservation Commission.  Local landowners \nand operators will play a major role in the restoration and conservation of the natural resources in this \nwatershed by installing best management practices on their land and implementing the activities learned \nin this educational project.  Several environmental and agricultural conservation programs have been \nutilized by landowners in the watershed in past years.  These programs include the Environmental \nQuality Incentive Program (EQIP), Conservation Reserve Program (CRP), Emergency Watershed \nProgram (EWP), Hold Our Topsoil (HOT), and the Agricultural Conservation Program (ACP).  These \nprograms have helped many landowners apply conservation practices on the ground while reducing soil \nloss, enhancing wildlife habitat, enhancing water quality, conserving water quantity, increasing \nagriculture/silviculture production and promoting conservation education.    \n In May 2012, NRCS launched a new National Water Quality Initiative (NWQI) committed to \nimproving Pelahatchie Creek-Ashlog Creek, Porter Bayou and North Tippah Creek watersheds in \nMississippi.   NRCS identified these priority watersheds with the help of MDEQ and other partners.  \nNRCS manages the initiative by making funds available to farmers, ranchers and forest landowners to \nhelp reduce the flow of nutrients, sediment and other pollutants into these impaired streams. \n As the management agency for Agricultural Nonpoint Source Pollution in Mississippi, the \nMississippi Soil and Water Conservation Commission (MSWCC) determined that the North Tippah \nCreek Watershed would be a good candidate for education and possible restoration.  After meetings with \nlocal landowners, Tippah County Soil and Water Conservation District (SWCD) commissioners and \nstaff and Natural Resources Conservation Service (NRCS) employees that work in this area, the \nMSWCC thought there was enough interest in the watershed that a measurable difference could be \nshown, and submitted a proposal to MDEQ for a Nonpoint Source Pollution Grant (#C9994866-11-0) \nunder the provisions of section 319(h) of the Clean Water Act.   \n \n \n\n \n 16\nB. Wildlife and Fisheries \nThere are important recreational species located throughout the watershed.  These species \ninclude deer, turkey, bass, catfish, bream, rabbits, squirrel, and raccoon.  Also, trapping is an important \nrecreation that takes place in this watershed.   The list of plants and animals of special concern are \nincluded as Appendix A.  There are no animals and plants that are threatened or endangered in this \nwatershed. \n \nC. Designated Use Classifications and Water Quality                 \n     Standards \n \n The designated beneficial uses for the North Tippah Creek and other water bodies  in the \nwatershed are aquatic life support, fish consumption and secondary contact.  The water use classification \nfor North Tippah Creek is fish and wildlife support according to the 2012 303 (d) List of Impaired Water \nBodies.  The Mississippi Benthic Index of Stream Quality (M-BISQ) was used for assessment of North \nTippah Creek.  MDEQ developed the M-BISQ for use as a tool to help assess water quality of \nMississippi’s streams. \n \n \n \nD. Current Status of Water Bodies in the Watershed \n \n North Tippah Creek is listed on the Mississippi list of impaired water bodies (303 (d) list for biological \nimpairment \nE. TMDL \n    A TMDL has not been developed for North Tippah Creek.  EPA Region 4 encourages local \nwatershed restoration efforts that are developed in advance of TMDLs.  This approach provides the \nstate an \n\nopportunity to work with the public and private stakeholders to develop a watershed \nimplementation plan that should help improve water quality without the need for a TMDL.  The North \nTippah Creek Watershed is being used to pilot this approach. \n  \n \n \n\n \n 17\nVIII. WATERSHED MANAGEMENT  \nACTIONS \n \nImplementation of Best Management Practices  \n \nA. Nutrient and Sediment BMPs  \n \n1. Stakeholder Interests \n \n The major concerns of the stakeholders include nutrient and sediment loadings to water bodies in \nthe North Tippah Creek watershed.  Sediment runoff is a major issue because nutrients attach to \nsediment particles.   \n \n2. Goals/Objectives \n \n The goal/objective is to reduce the nutrient and sediment loading coming from agricultural and \nother land use activities in an effort to restore impaired water bodies in the North Tippah Creek \nWatershed prior to developing TMDLs.  This approach provides Mississippi an opportunity to restore \nthe impaired North Tippah Creek Watershed without the need for a TMDL.  \n \n3. Management Actions \n \n The management actions that will be taken to address nutrient and sediment loadings may \ninvolve installation of agricultural BMPs, water quality monitoring, public outreach/education and other \nmeasures.  These BMPs may include but are not limited to:  \n Stream bank and Shoreline Protection,  \n Grade Stabilization Structures,  \n Critical Area Stabilization, and other. \n \n  These BMPs will be installed by the participating landowners in the watershed utilizing funds \nthrough the NRCS National Water Quality Initiative (NWQI).  NRCS will provide the \ntechnical/planning assistance including funding for this BMP implementation.  Most of the BMPs that \nwill be installed are permanent structures and must be maintained by the landowner for a period of 10 \n\n \n 18\nyears.  NRCS and Tippah County Soil and Water District employees identified landowners in the \nwatershed that have agricultural land needing treatment.   \n \n4. Project Tracking/Assessment of Progress \n \n The North Tippah Creek project began in 2012.  NRCS is tracking progress of this project \nutilizing the Revised Universal Soil Loss Equation (RUSLE) on all acres affected by the Best \nManagement Practices (BMPs); also MDEQ will evaluate the monitoring data collected by USGS to \ndetermine effectiveness of the installed BMPs. \n                          \n \n5. Desired Results/Benefits \n \n The desired benefit of this project will be to restore and remove the impaired segments of North \nTippah Creek from Mississippi’s 303(d) List of Impaired Water bodies. \n \n6. Roles/Responsibilities \n \n There are several different groups with responsibilities in this watershed.  NRCS staff has the \nroles and responsibilities of identifying landowners, providing technical assistance, designing the BMPs \nand making payments to the landowners who install the BMPs.  The landowners have the responsibility \nof implementing BMPs in the project area.  The North Tippah Creek Watershed Implementation Team \nhas the role of helping gather the information needed to write the Watershed Implementation Plan.  \nMSWCC has the responsibility of compiling all the information and writing the initial plan for the \nwatershed and carrying out the 319 education project.  Other programs that are available to landowners \nin the watershed include EQIP, CRP, and WHIP.  Under these three programs, there has been \napproximately $375,506 spent over the last three years with another $416,000 projected to be spent over \nthe next three years in Tippah County. \n \n \n \n \n \n\n \n 19\n7. Budget \n \nThe table below shows a list of BMPs installed under the NWQI.   \n \nTable 8.1 Funded NWQI BMPs. \nBMPs Area Affected BMP Cost BMP Total \nStreambank and Shoreline Protection 2,308 feet $160.69/ft $370,855.40 \nGrade Stabilization Structure 4 structures $8,711.67 /ea $34,846.67 \nCritical Area Stabilization 1.4 acres $354.93/ac $496.89 \nTotal \n  \n$406,198.96 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n 20\nIX. EDUCATION/OUTREACH ACTIVITIES \n \nA. Educational Activities to be Implemented \n \n The overall objective of community education in the North Tippah Creek watershed is to develop \nan atmosphere that promotes sustained, long-term protection and improvement of aquatic resources \nin the watershed. Specific objectives of education efforts in the watershed include the following: \n \n Increase public awareness of the value of clean water. \n Increase public awareness of agricultural runoff and encourage behaviors that will help \nreduce levels of nutrients and sediments in the watershed, watershed characterization and \nstewardship opportunities. \n Increase public awareness of how BMPs can help improve water quality and habitat \nrestoration. \n Increase public awareness of the long term environmental and economic advantages of \nprotecting and improving water quality and habitat in the North Tippah Creek watershed. \n \n \n 1. Signage \nSigns identifying the installed BMPs will be erected throughout the watershed with the \nparticipating landowners’ permission. \n \n \n  Primary partners- Mississippi Soil and Water Conservation Commission,  Mississippi \nDepartment of Environmental Quality, Tippah County Soil and Water Conservation District, \nNatural Resources Conservation Service, and Environmental Protection Agency. \n \n a. Indicators   \n  There will be a field day held to show other landowners and the interested public the \nBMPs installed.  Also, the associated benefits from BMP installation will be demonstrated to the \nparticipants.  Participants will be counted at this field day.  Traffic through the watershed cannot be \ndocumented, but some areas where signs will be erected are along heavily traveled state highways.  \n\n \n 21\n b. Schedule \n  The BMP signs will be erected as practices are completed and/or requested by the \nlandowners throughout the life of the project. \n \n c. Budget  \n Table 9.1 Projected Costs for Signage. \nItem Unit Cost Total Cost \nSigns 20 $100.00 $2,000.00 \nTotal   $2,000.00 \n \n2. Field Day \n A field day will be held to showcase some of the BMPs installed under the National Water \nQuality Initiative.  This will allow other landowners and the interested public to view some of the \npractices that are being installed to benefit water quality in the watershed. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, Tippah County Soil and Water Conservation District, \nNatural Resources Conservation Service, and Environmental Protection Agency \n a. Indicators \n  Attendance at this field day will be documented and reported.   \n b. Schedule \n  Field day in the watershed will take place before September 2013. \nc. Budget \n Table 9.2 Projected Costs for Field Day. \nItem Units Cost Total Cost \nEvent Flyers 100 .60/each $60.00 \nMailing/Delivery 100 .45/each $45.00 \nMiscellaneous (Field Day, \nsupplies) \n1 $3,000.00/each $3,000.00 \nTotal   $3,105.00 \n\n \n 22\n3. Educational Literature \n  Brochures and a fact sheet will be developed about the project.  Brochures will be \ndeveloped to inform landowner/operators about water quality and ways they can protect and improve \nthe water quality in their watershed.  The fact sheet will contain information about the watershed and \nthe number and type of BMPs that were installed.  \n \n Primary Partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, Tippah County Soil and Water Conservation District, and \nNatural Resources Conservation Service. \n a. Indicators \n  Brochures and fact sheets will be designed and distributed.  These brochures and fact \nsheets will be handed out at the field day, during the Tippah County Fair, during the Conservation \nCarnival and will also be available in the district office.   \n b. Schedule \n  The brochures and fact sheet will be developed before the field day and county fair. \n c. Budget \n Table 9.3 Projected Costs for Educational Literature. \nItem Unit Cost Total Cost \nFact Sheet 1,000 1.00/each $1,000.00 \nBrochures 5,000 3.00/each $15,000.00 \nTotal   $16,000.00 \n \n4. Watershed Harmony Puppet Show \n Watershed Harmony is a musical puppet performance aligning with the fourth and fifth grade \nMississippi Framework and National Science Standards.  Audiences of all ages will delight in \nenvironmental stewardship through this toe tapping musical.  Performances are not only enjoyed by \nschool groups, but also by adults attending teacher workshops, civic clubs, and conferences.  This \nprogram serves to inform, excite, and enlist the help of citizens in an ongoing effort to promote \nwater quality in their communities. \n \n Primary Partners- Mississippi Department of Environmental Quality and Bayou Town \nProductions. \n\n \n 23\n a. Indicators \n The number of participants will be documented and submitted to MDEQ.   \n b. Schedule \n  Watershed Harmony will be presented before August 2013. \n c. Budget \n Table 9.4 Projected Costs for Watershed Harmony Puppet Show \nItem Unit Cost Total Cost \nWatershed Harmony Puppet Show 1 show $1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n5. Tippah County Fair \n A booth will be set up at the fair with information about the project with pictures of BMPs within \nthe watershed and other educational materials about nonpoint source pollution and the North Tippah \nCreek 319 project.  The booth will be set up for the entire fair with information available to the \npatrons of the fair.  Coloring books, crayons and other educational materials will be given to the \nchildren on family night.  Also, Sam E Soil will be making special appearances throughout the night \non family night. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, Natural Resources Conservation Service and Tippah County \nSoil and Water Conservation District. \n a. Indicators \n  The number of brochures that are handed out to adults will be documented.  The number \nof children who receive Sam E. Soil coloring books and adults that receive informational items on \nfamily night will be documented.  \nb. Schedule \n  The exhibit will be at the 2013 Tippah County Fair. \n  \n \n \n \n \n\n \n 24\nc. Budget \n Table 9.5 Projected Costs for Tippah County Fair. \nItem Units Cost Total Cost \nBrochures 1,000 .65/each $650.00 \nColoring Books 2,000 .38/each $760.00 \nLitter Bags 1,250 .42/each $525.00 \nInformational Items 1,702 5.00/each $8,510.00 \nTotal   $10,445.00 \n \n \n6. Water Bill Mailers \n A flyer will be designed and mailed out to the homes in the North Tippah watershed.  This flyer \nwill inform homeowners of ways they can help improve water quality in the watershed.  This will be \nmailed with their monthly water bill. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, and Tippah County Soil and Water Conservation District. \na. Indicators \nThe number of flyers sent out will be documented. \n \nb. Schedule \nThe flyers will be mailed before August 2013. \n \nc. Budget \nTable 9.6 Projected Costs for Water Bill Mailers. \nItem Units Cost Total Cost \nMailing 500 .45/each $225.00 \nEnvelopes 500 .10/each $50.00 \nFlyer 500 .65/each $325.00 \nTotal   $600.00 \n\n \n 25\n7. Presentations \n Presentations relating to water quality will be made to civic organizations.  These presentations \nwill inform individuals about ways they can improve water quality and reduce nonpoint source \npollution. \n \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, and Tippah County Soil and Water Conservation District. \na. Indicators \nThe number of people in attendance will be documented. \n \nb. Schedule \nThese presentations will be made before August 2013. \n \nc. Budget \nTable 9.7 Projected Budget for Presentations. \nItem Units Cost Total Cost \nMiscellaneous 3 $50.00/each $150.00 \nTotal   $150.00 \n \n8. Radio Advertisements \n Radio advertisements will be run on the local radio station to inform people about water quality \nand nonpoint source pollution.  Each spot will run 5 times a days for 2 weeks. \n \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, and Tippah County Soil and Water Conservation District. \n \na. Indicators \nThe number of radio ads run and produced will be recorded. \n \nb. Schedule \nThe ads will run before August 2013. \n \n\n \n 26\nc. Budget \nTable 9.8 Projected Costs for Radio Advertisements. \nItem \nUnits \nCost Total Cost \nAds 3 $200.00/each $600.00 \nTotal   $600.00 \n \n9. Adopt-A-Stream \n Adopt-A-Stream is a program that promotes environmental stewardship through training \nworkshops, outdoor field activities, and by introducing participants to watershed action projects.  \nOne and two-day workshops inform participants about watershed topics such as stream health, \nstream ecology, aquatic life and water chemistry.  \n \n Primary Partners- Mississippi Department of Environmental Quality and Mississippi Wildlife \nFederation. \n a. Indicators \n  The number of participants and the number of participants that carry on the adoption \nactivities will be documented. \n \n b. Schedule \n  At least one event will take place before September 2013.     \n \n c. Budget \n Table 9.9 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total Cost \n1 Day Adopt A Stream \nWorkshop \n1 day \nworkshop \n$1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n \n \n \n\n \n 27\n10. Project: Food, Land and People  \n Project: Food, Land and People is a program that promotes conservation education through \nteacher workshops and hands on activities. These FLP workshops are 6 hours long and provide the \neducator with .6 Continuing Education Units.  This program brings to the forefront many \nconservation issues and understanding of how agriculture affects our day to day life.   \n \n Primary Partner- Mississippi Soil and Water Conservation Commission and Tippah County Soil \nand Water Conservation District. \n a. Indicators \n  The number of participants that attend the workshop will be documented. \n \n b. Schedule \n  At least one event will take place before September 2013.     \n \n c. Budget \n Table 9.10 Projected Costs for Project: Food, Land and People Workshop. \nItem Unit Cost Total \nCost \nProject: Food, Land \nand People Workshop \n1 day workshop $1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n11. Tippah County Conservation Carnival  \n The Conservation Carnival teaches students the importance of our natural resources and what \nthey can do to help protect these resources.   \n \n Primary Partner- Mississippi Soil and Water Conservation Commission and Tippah County Soil \nand Water Conservation District. \n a. Indicators \n  The number of participants that attend the conservation carnival will be documented. \n \n b. Schedule \n  At least one event will take place before September 2013.     \n\n \n 28\n c. Budget \n Table 9.11 Projected Costs for Tippah County Conservation Carnival. \nItem Unit Cost Total Cost \nLunch Bags 1,200 $5.50 $6,600.00 \nWater Bottles 1,200 $3.75 $4,500.00 \nTotal   $11,100.00 \n \n12. Displays  \n Displays will be developed as an educational tool to teach individuals about water quality and \nways they can help improve the water quality in the watershed.   \n \n Primary Partner- Mississippi Soil and Water Conservation Commission, Mississippi Department \nof Environmental Quality, Natural Resources Conservation Service and Environmental Protection \nAgency. \n a. Indicators \n  These displays will be set up for the entire fair and the number of individuals who view \nthe display will be approximately7,612.  This display will also be set up for the field day. \n \n b. Schedule \n  The display will be set up for the county fair and the North Tippah Creek Field Day.   \n  \n c. Budget \n Table 9.12 Projected Costs for Displays. \nItem Unit Cost Total \nCost \nDisplays 2 displays $2,500.00 $5,000.00 \nTotal   $5,000.00 \n \n \n \n \n\n \n 29\n 13. Total Projected Cost of Education/Outreach Activities \n Table 9.13 Total Projected Education Budget  \nItem Unit Cost Total Cost \nSignage 20 $100.00 $2,000.00 \nField Day 1 $3,105.00 $3,105.00 \nEducational Literature                              \n-Fact Sheets                                             \n-Brochures \n         \n1,000 \n5,000 \n             \n$1.00    \n$3.00 \n                 \n$1,000.00                  \n$15,000.00 \nWatershed Harmony Puppet Show 1 $1000.00 $1,000.00 \nTippah County Fair 1 $10,445.00 $10,445.00 \nWater Bill Mailers 1 $600.00 $600.00 \nPresentations 3 $50.00 $150.00 \nRadio Ads 3 $200.00 $600.00 \nAdopt-A-Stream 1 $1,000.00 $1,000.00 \nProject: Food, Land and People 1 $1,000.00 $1,000.00 \nTippah County Conservation Carnival 1 $11,100.00 $11,100.00 \nDisplays 2 $2,500.00 $5,000.00 \nTotal \n  \n$52,000.00 \n \n$50,000 of the Education/Outreach activities will come from a NPPS 319 grant and $33,333.34 \nin match will be provided by the Mississippi Soil and Water Conservation Commission. \n \n \n14. Total Budget for North Tippah Creek Watershed Implementation Plan \n \n Table 9.14 North Tippah Creek Watershed Implementation Plan Total Budget \nItem Cost \nBMPs $406,198.96 \nEducation/Outreach $52,000.00 \nTotal $458,198.96 \n \n \n \n\n \n 30\nX. EVALUATION \n \nA. Plan Evaluation Procedure \n \n This watershed implementation plan will be evaluated and revised on an as needed basis.  The \nevaluation of this plan will be organized by the North Tippah Creek WIT.  At that time, the WIT will \ndevelop a detailed schedule for review and revision of this watershed implementation plan. The WIT \nmembers will be responsible for notifying their stakeholders of the opportunity to propose changes \nto the watershed implementation plan. One month will be allowed for notification of stakeholders. \n The plan will be evaluated by the team, or their designee, and any interested stakeholders. One \nmonth will be allowed for evaluation and submittal of comments. Therefore, comments will be due \ntwo months after the evaluation procedure is initi\n\nated. The plan will be evaluated in two ways. First, \nto determine if the plan goals have been achieved, and second, to determine if it restores the water \nquality of North Tippah Creek and addresses priority issues as identified by the WIT. \n \n \nB. Implementation Evaluation Strategy \n \n1. The following measures and indicators of progress will be utilized to track the              \nsuccess of this plan by MSWCC:  \n \n The number of individuals who attend the Tippah County Fair,  \n    The number of fact sheets and brochures distributed, \n The number of children who attend the Conservation Carnival, \n The number of teachers who attend the workshops, and \n The number of individuals what attend the field day. \n \n \n 2.  MDEQ will be responsible for reviewing water quality monitoring data collected during \nthe implementation of this project to determine the effectiveness of BMPs implemented in the \nwatershed.   \n \n\n \n 31\nXI. PLAN REVISION \n \nA. Plan Revision Procedure \n \n  After evaluation, MDEQ will prepare a revised watershed implementation plan incorporating \nthe changes requested by the reviewers. At this point it may be necessary to call a meeting to \nreconcile any conflicting comments or requests for change.  \n If the evaluation criteria are all being met in North Tippah surface waters, the watershed \nimplementation plan will be revised to address a different restoration issue or issues, in order to \nprotect the water quality of the watershed. If the evaluation criteria for the watershed are not being \nmet, the approach for restoring North Tippah Creek watershed will be revised based on the \nknowledge that has been gained through BMP installation and monitoring performed in the NWQI \narea.  \n The draft watershed implementation plan will be submitted to the Implementation Team, and all \nothers who submitted comments. Within two weeks of receiving the draft watershed implementation \nplan, the Implementation Team will notify their stakeholders of the availability of the revised \nwatershed implementation plan for stakeholder review. One month will be allowed for review of the \ndraft. Comments will be due at the end of this review period. \n Within a month after the comments on the draft watershed implementation plan are received, the \nDRAFT watershed implementation plan will be submitted to the Implementation Team for review \nand approval. After the DRAFT watershed implementation plan has been approved, the \nImplementation Team will notify their stakeholders of the completion and availability of the plan for \nuse as a guide to watershed restoration and protection activities. \n \n \n \n \n \n\n \n 32\n \nXII. RESOURCES \n \n\"Natural Heritage Inventory: Search Animal Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_animals.asp> \n \n\"Natural Heritage Inventory: Search Plant Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_plants.asp> \n  \nUSDA. SCS. 1966. Soil Survey of Tippah County, Mississippi. \n \nMDEQ. 2012. Mississippi 2012 Section 303(d) List of Impaired Water Bodies. MDEQ. Jackson, MS. \n \nMDEQ. 2012. State of Mississippi Water Quality Assessment 2012 Section 305 (b) Report.  MDEQ. Jackson, \nMS. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n 33\n \n \nAppendix A \n \n \n \nPlant and Animal Species of Special \nConcern \n \n \n \n \n \n \n \n \n\n \n 34\nAnimals of Special Concern in Tippah County \nScientific Name Common Name \nCYPRINELLA WHIPPLEI STEELCOLOR SHINER \nNOTURUS STIGMOSUS NORTHERN MADTOM \nPROCAMBARUS ABLUSUS A CRAYFISH \n \n \n \nPlant Species of Special Concern in Tippah County \nScientific Name Common Name \nCHELONE GLABRA WHITE TURTLEHEAD \nADIANTUM CAPILLUSVENERIS SOUTHERN MAIDENHAIR-FERN \nPLATANTHERA PERAMOENA PURPLE FRINGELESS ORCHID \nAGALINIS PSEUDAPHYLIA SHINERS’ FALSE-FOXGLOVE \nSILENE OVATA OVATE CATCHFLY \nASARUM CANADENSE CANADA WILD-GINGER \nASPELENIUM RHIZOPHYLLUM WALKING-FERN SPLEENWORT \nATHYRIUM PYCNOCARPON GLADE FERN \nCAREX PICTA PAINTED SEDGE \nCYPRIPEDIUM PUBESCENS YELLOW LADY’S-SLIPPER \nGOODYERA PUBESCENS DOWNY RATTLESNAKE-PLANTAIN \nHYBANTHUS CONCOLOR GREEN VIOLET \nJUGLANS CINEREA WHITE WALNUT \nLIGUSTICUM CANADENSE NONDO LOVAGE \nORCHIS SPECTABILIS SHOWY ORCHID \nPANAX QUINQUEFOLIUS AMERICAN GINSENG \nPHILADELPHUS INODORUS ODORLESS MOCK-ORANGE \nTRIOSTEUM ANGUSTIFOLIUM NARROW-LEAF FEVER ROOT \n \n \n \n \n\n \n 35\n \n \n \n \n \n \n \n \n \n \n \n \nAppendix B \n \n \n \nFunded 319 Project Proposal \n \n \n \n \n \n \n \n \n\n \n 36\nPROJECT TITLE: \nTippah River Watershed Agricultural Nonpoint Source Pollution Education Project \n \nPROJECT ABSTRACT: \nThis project will be located in the Western Tippah County in north Mississippi. \nThe objectives of this project will be: \n \nTo inform and educate the public about their watershed and the things they can do that will \nbenefit water quality.  \n \nTo organize a watershed team and develop a watershed implementation plan that will have \nsuggestions and ideas about how to improve water quality within the watershed. \n \nTo develop a monitoring plan and acquire monitoring data to determine if there is a need for a \nproject to implement Best Management Practices. \n \nThe project cost is $208,334.  Of this amount, $125,000 in 319 funds are requested with the balance of \n$83,334 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nMark E. Gilbert, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES: \n \nTippah County Soil and Water Conservation District; USDA Natural Resources Conservation Service; \nMississippi Department of Environmental Quality; United States Geological Survey \n \n\n \n 37\nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone: (601) 354-7645 \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nNorth Tippah Creek Watershed (North Tippah Creek 08030201-250) \n(see attachment 1 for a map depicting the targeted demonstration areas of the project) \n \nPROJECT OBJECTIVE: \n \nThe overall objective of this project will be to educate individuals living in this watershed about water \nquality in the Upper Tippah Creek Watershed.  The education component of this project is designed to \ninform individuals about water quality and nonpoint source pollution and measures that can help in \nreducing nonpoint source pollution.   Monitoring of the waters in the watershed will be done as part of \nthis project to determine if there is a need for implementation of Best Management Practices to improve \nwater quality.  Soils in the watershed are very erosive, with gully erosion occurring on sloping cropland \nand pastureland.  The State’s 2012 303(d) list of impaired water bodies lists North Tippah Creek \ndesignated use of fish and wildlife support as impaired due to biological impairment.   \n \nPROJECT DESCRIPTION: \n \nThis project will include development of a watershed team, development of a watershed plan, education \nactivities, and a monitoring component.  MSWCC will work with NRCS, MDEQ and the Tippah County \nSoil and Water Conservation District to identify stakeholders and others who need to serve on the \nwatershed team.  Once identified, MSWCC will facilitate the meetings of this team and the development \nof the Watershed Implementation Plan.  The education activities will be carried out to educate \nindividuals living in the North Tippah Creek watershed about nonpoint source pollution and ways that \nthey can help in preventing it.  The monitoring component of the project will include a monitoring plan \ndeveloped and monitoring data collected by USGS.   \n \n \nThe current land uses in the Tippah River Watershed include 60% (approximately 21,316 acres) \ncropland, 10% approximately 3,553 acres) pasture land, 25% (approximately 8,881 acres) timber land \nand 5% (approximately 1,776 acres) other lands. \n \n \n \n \n\n \n 38\nTo address the above stated objectives, education activities may include but are not limited to: \n \n-Signage, \n-Field days, \n-Lunch bags, \n-Fact sheets, \n-Brochures,  \n-Project Food Land and People, \n-Adopt a Stream,  \n-Direct Mailers,  \n-Public Service Announcements,  \n-Stream Cleanup, and \n-Fair Exhibits. \n \nMILESTONES: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n \n2. With assistance from MDEQ, NRCS and the Tippah County SWCD, form the North Tippah \nCreek Watershed Team. (Month 1-2) \n \n3. Facilitate quarterly meetings of the North Tippah Creek Watershed team. (Month 1-12) \n \n4. Convene a kickoff meeting of the newly formed North Tippah Creek Watershed team. (Month 3) \n \n5. With assistance from the watershed team, develop a Watershed Implementation Plan that is \nconsistent with MDEQ guidance. (Month 3-8) \n \n6. Carry out the education/outreach activities of the project. (Month 1-12) \n \n7. Assist MDEQ in establishing an evaluation system to indicate the benefits of the project. (Month \n4) \n \n8. Present a draft watershed plan to the watershed team for review and comments. (Month 6) \n \n9. Present a final draft to the watershed team for approval. (Month 8) \n \n10. With the approval of the watershed team, submit a final draft to MDEQ for approval. (Month 9) \n \n11. Submit biannual reports to MDEQ. (Month 1-12) \n \n12. Make project presentations as requested by MDEQ. (Month 1-12)  \n \n13. Make a final report to MDEQ. (Month 12) \n \n \n\n \n 39\n \nINDICATORS OF SUCCESS \n \nThe following measures and indicators will be utilized to track the success of this project: \n \n Watershed Team Formed \n Watershed Implementation Team Developed \n Monitoring Plan Developed \n Fact Sheet About The Watershed Developed \n Number of Student Reached and Give Educational Materials, and \n Monitoring Data Collected. \n \n \nPROJECT PERIOD \n \nThe length of this project will be 1 year. \n \n \n \n \nPROJECT BUDGET \n \nBUDGET   FEDERAL   NON-FEDERAL  TOTAL \nCATEGORY   FUNDS   FUNDS \n \nInformation/Education $   50,000   $   33,334 *   $    83,334 \n \nContractual (Monitoring) $   75,000   $   50,000 *   $  125,000 \n \n \nTOTAL   $ 125,000   $  83,334   $  208,334 \n \n*   Non-federal match for information/education and monitoring will be provided the local soil and \nwater conservation district commissioners, soil and water conservation district staff and Mississippi Soil \nand Water Conservation Commission staff time spent on the project. \n\n \n 40\n \n \n   \n\n \n 41\n \n \n \n \n \n \n \n \n \n \nAppendix C \n \n \n \n \n \n \n \n \n \nChecklist of Watershed Implementation \nElements \n \n \n \n \n \n\n \n 42\n \nTable D. 9 Key Elements of a Watershed Plan for 319 Grant  \n \nRequired WIP Elements for 319 Grant \n \nLocation in Watershed Implementation Plan \n \n1. Watershed Description and Background \n \nChapter V, Chapter VII Section A \n \n2.  Implementation \n \nChapter VIII Section A Subsection 3 \n \n3. Project Goals \n \nChapter VIII Section A Subsections 2 and 5 \n \n4. Project Costs \nChapter VIII Section A Subsection 7 \nChapter IX Section A Subsection 13,14 \n \n5. Education and Outreach \n \nChapter IX \n \n6. Implementation Schedule \n \nChapter VIII Section A Subsection 4 \n \n7. Milestones \n \nChapter VIII Section A Subsection 4 \n \n8. Adaptations and Revisions \n \nChapter X Section A, Chapter XI Section A \n \n9. Monitoring \n \nChapter X Section B Subsections 1 and 2 \n\n \n43 \n \n ",
  "metadata": {
    "id": "north-tippah-creek-watershed-plan-2013",
    "originalName": "north-tippah-creek-watershed-plan-2013.pdf",
    "mergedFrom": [
      "north-tippah-creek-watershed-plan-2013-1.json",
      "north-tippah-creek-watershed-plan-2013-2.json",
      "north-tippah-creek-watershed-plan-2013-3.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.717Z",
    "length": 47395
  }
}