{
  "id": "owl-creek-little-hatchie-river-9-key-element-plan-2020",
  "rawText": "\n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n1 \n \nOwl Creek-Little Hatchie River 9 Key Element Watershed Plan \nHUC 080102070101 (MWS 3014) \nGY20 Project Area \nApril 20, 2021 \nRevised February 2022 \n \nElement a: Identification of Causes and Sources of Impairment \nThe Owl Creek-Little Hatchie River Watershed is located in Ripley Mississippi (MS).  The \nentirety of the 25,740-acre watershed lies within Tippah County in northeast Mississippi and is \npart of the North Independent Streams Basin.  According to the 2016 National Land Cover \nDatabase (NLCD), the landuse in this watershed is comprised of approximately 59% (15,195 \nacres) forestry, 22 % (5,780 acres) pastureland, and 2% (455 acres) cropland (Figure 1). \n \nThe water-use classification for streams in the Owl Creek-Little Hatchie River Watershed, as \nestablished by Regulations for Water Quality Criteria for Intrastate, Interstate, and Coastal \nWaters (11 Miss. Admin. Code Pt. 6, Ch. 2), is Fish and Wildlife. Waters with this classification \nare intended for fishing and propagation of fish, aquatic life, and wildlife. Waters included in the \nFish and Wildlife Classification should also be suitable for secondary contact recreation, which \nis defined as incidental contact with water including wading and occasional swimming.   \n \nThe largest water body in the Owl Creek-Little Hatchie River Watershed is Little Hatchie River \nand serves as the receiving stream for the majority of the drainage in the watershed.  The only \nother named stream in the watershed is Owl Creek, which flows into the Little Hatchie River.  \nBoth Little Hatchie River and Owl Creek have a history with Mississippi’s Section 303(d) List of \nImpaired Water Bodies.  Little Hatchie River, water body segment MS201E, was initially listed \nas evaluated on the 1996 Section 303(d) List as impaired for pesticides, nutrients, siltation, \npathogens, and organic enrichment (O.E.)/low dissolved oxygen (D.O.).  It remained on the 1998 \nlist for the same pollutants.  The entire drainage area was considered as an “evaluated” §303(d) \nlisting versus a “monitored” listing as there were no water quality data to verify impairment \nstatus of the water bodies in the watershed.  In 2002, the impairment to Little Hatchie River was \nchanged to biological impairment and the listing was moved from the “evaluated” portion of the \n§303(d) list to the “monitored” portion of the list.  This same listing was included in the 2004 \n§303(d) List.  After performing a stressor identification study, sedimentation was identified as \nthe primary probable pollutant causing the biological impairment.  In 2005, a sediment TMDL \nwas developed for Little Hatchie River. \n \nThe Mississippi Department of Environmental Quality (MDEQ) has conducted statewide \nbiological monitoring using benthic macroinvertebrates as the indicator to develop a regionally \ncalibrated Index of Biological Integrity (IBI) for wadeable streams. This index, known as the \nMississippi Benthic Index of Stream Quality (M-BISQ), was used in the biological assessment of \nthe state’s wadeable streams and rivers.  In 2010, Owl Creek (segment 301412) was assessed as \nbiologically impaired and added to the Section 303(d) List.  Owl Creek remains on the list of \nimpaired waters and a stressor identification study was completed in January 2021 to determine \nthe cause of impairment to the stream.  As a result of this stressor identification study, the \nprimary probable cause of impairment to the biological community was determined to be \nsedimentation. Now that sediment has been identified as the pollutant of concern, a total \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n2 \n \nmaximum daily load (TMDL) will be developed.  Figure 1 shows the location of the impaired \nsegments within the Owl Creek-Little Hatchie River Watershed.   \n \n \nFigure 1: Landuse Distribution and Impaired Segments in Owl Creek-Little Hatchie River Watershed\n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n3 \n \nThere are no facilities in the Owl Creek-Little Hatchie River watershed with NPDES permits that \ninclude limits for Total Suspended Solids (TSS), which is used as an indicator of sediment \ncontributions from permitted activities. The TMDL for Little Hatchie River, Total Maximum \nDaily Load Little Hatchie River Watershed (08010207) North Independent Streams Basin for \nBiological Impairment Due to Sediment, (MDEQ, 2005) was completed for clean sediment. The \nState of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters (11 \nMiss. Admin. Code Pt. 6, Ch. 2) (MDEQ, 2020) regulation does not include a numeric water \nquality standard for aquatic life protection due to sediment. The narrative standard for the \nprotection of aquatic life is sufficient for justification of TMDL development, but does not \nprovide a quantifiable TMDL target. The target for this TMDL is based on reference sediment \nyields developed by the Channel and Watershed Processes Research Unit (CWPRU) at the U.S. \nDepartment of Agriculture, Agricultural Research Service, National Sedimentation Laboratory \n(NSL). \n \nThe CWPRU developed reference sediment yields, or targets, for each level III ecoregion within \nMississippi.  These yields were derived from the empirical analysis of historical flow and \nsuspended sediment concentrations for stable streams in each level III ecoregion.  For the Owl \nCreek – Little Hatchie River watershed, the estimated allowable range of sediment loads for \nstable streams is 0.000757 to 0.00459 tons per acre per day at effective discharge.  Also based on \nthis analysis, a range of unstable values was assigned to the listed waterbodies within HUC \n08010207 based on the level III ecoregion unstable stream values.  The unstable range is \nrepresentative of the existing loads that would be expected for water bodies within HUC \n08010207.  The unstable range for water bodies within HUC 08010207 is 0.000151 to 0.0761 \ntons per acre per day at the effective discharge.  The unstable yields are larger than the target \nyields; therefore, a reduction is recommended for HUC 08010207.  Based on the ranges of stable \nand unstable yield values, a reduction of 50% to 94% is recommended in HUC 08010207. \n \nNonpoint loading of sediment in a water body results from the transport of the material into \nreceiving waters by several processes including mass wasting, head cutting, gullying, and sheet \nand rill erosion.  Sources of sediment come from improper agricultural and silviculture practices \nas well as from a plethora of other improper land-use activities, e.g. construction, mining, \nchannel alterations.  \n \nElement b: Expected Load Reduction \n   \nThe sediment TMDL developed for Little Hatchie River (MS201E) and applicable for waters \nwithin the Owl Creek-Little Hatchie River watershed concluded that yields would need to be \nreduced by 50-94% in order to reflect stable conditions.  The United States Department of \nAgriculture (USDA) Natural Resource Conservation Service (NRCS) has a list of approved \nBMPS to address sedimentation and this list will be used to identify candidate BMPs in Owl \nCreek-Little Hatchie River watershed. \n \nWhile these sedimentation practices are for sedimentation, there is an additional benefit in the \nreduction of nutrients because nutrients attach to sediment particles.  This list will be used to \nidentify candidate BMPs in the Owl Creek-Little Hatchie River watershed. \n \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n4 \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC), the Natural Resource Conservation Service (NRCS), and the local Soil \nand Water Conservation Districts (SWCDs) throughout the state.  These SWCDs are typically \nhoused within USDA Service Centers co-located with NRCS offices.  These USDA Service \nCenters handle federal assistance programs offered through the Farm Bill.  As part of these \nservices, SWCD staff communicate regularly with the local landowners and operators within the \nwatershed as they work to support sign-ups for Farm Bill initiatives.  Staff from MSWCC and \nthe SWCD depend upon assistance from their NRCS partners in determining landowner interest \nin the watershed because they are on the farms and in the fields with the landowners, understand \nthe needs at the local level, and have knowledge of the amount of unfunded applications for \nfederal program assistance which meet Section 319 eligibility requirements.  Based on their \nanalysis, installation of the following potential BMPs would mitigate sediment issues in the Owl \nCreek-Little Hatchie River watershed, helping the stream recover: fencing, watering facilities, \nheavy use areas, stream crossings, streambank and shoreline protection, and grade stabilization \nstructures.  Factors considered for determining specific locations for the placement of BMPs \nincluded the following attributes based upon best professional judgement: \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDL (i.e., “It is recommended that \nwater bodies within [the watershed] be considered a priority for streambank and \nriparian buffer zone restoration and any sediment reduction BMPs, especially for road \ncrossings, agricultural activities, and construction activities); \n4. Ease of showing effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the grant period). \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project who may contribute match include MSWCC, Tippah County Soil and \nWater Conservation District, NRCS, United States Geological Survey (USGS) for additional \nmonitoring, and/or local landowners and operators.  For project implementation, administration, \nmanagement, and watershed plan revision, as well as hosting and facilitating team meetings, \nMDEQ plans to work under a memorandum of agreement (MOA) with the MSWCC to \nimplement this project.  Project partners provided the funding amounts used to estimate costs for \nBMP installation.  Provided below is summary of estimated costs for potential BMPs and overall \nproject implementation: \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n5 \n \n \nCost Estimate: Full Project Implementation \n \nPractice Name Unit \nNo of \nUnits \nUnit Cost \nEstimated \nCost \n     Grade Stabilization Structure ea 40 $10,000.00 $400,000 \n     Streambank and Shoreline Protection ea 40 $7,500.00 $300,000 \n     Fencing ft 90000 $4.00 $360,000 \n     Heavy Use Area sq ft 30000 $4.72 $141,600 \n     Watering Facility ea 55 $2,045.00 $112,475 \n     Stream Crossing ea 6 $10,000.00 $60,000 \n*Monitoring          $70,328 \n*Technical Assistance          $60,000 \n*Education/Outreach          $27,800 \n*Project Management, \nImplementation, Coordination, Plan \nRevision \n         $101,490 \n \nTotal Estimated Project Cost                                        $1,633,693 \n* - Denotes fields that are estimated based upon three incremental funding cycles. \n \nDue to the magnitude of this project, funds will need to be allocated incrementally across multiple \ngrant cycles.  In order to fully address all suggested conservation needs in the watershed, this plan \nrecommends funding be provided in 3 increments.  To maximize education and outreach activities \nand monitoring efforts, MDEQ plans to leverage with existing programs already allocated for \nfunding where possible. \n \n  \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n6 \n \nBelow is the estimated budget for the first incremental funding (Phase 1) of this project: \n \nPhase 1 Cost Estimate: Project Implementation: \n \nPractice Name Unit \nNo of \nUnits \nUnit Cost \nEstimated \nCost \nGrade Stabilization Structure ea 15 $10,000.00 $150,000.00 \nStreambank and Shoreline Protection  ea 15 $7,500.00 $112,500.00 \nFencing ft 6000 $2.50 $15,000.00 \nHeavy Use Area sq ft 4800 $3.50 $16,800.00 \nWatering Facility ea 4 $1,000.00 $4,000.00 \nStream Crossing ea 2 $10,000.00 $20,000.00 \n*Monitoring \n      $70,328.00 \n*Technical Assistance \n      $20,000.00 \n*Education/Outreach \n      \n$13,900.00 \n*Project Management, Implementation, \nCoordination, Plan Revision \n      \n$33,830.00 \n     \nEstimated Project Cost \n   \n$456,358.00 \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor land-use categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Owl Creek-Little Hatchie River watershed project by tailoring them \nto address the sedimentation.  A positive approach is used to reach the full diversity of people in \nthe community with projects that foster a “sense of place”, a “sense of pride in community”, and \na sense of the native plants, animals, and general ecology of their region, as well as, the history \nof the community and a sense of economics.  Stakeholders and coordinators join together to \nparticipate in problem-solving brainstorming, plan development, training workshops, festival \nevent planning, soil and water conservation field days, tree boards, poster, art and writing \nprojects and other activities that promote collaboration and ownership of the watershed, as well \nas, solutions to its problems.  The ultimate goal is to bring about behavior changes and the use of \n“best management practices” that will improve water quality and the overall quality of life in the \nwatershed.  Evaluation forms, pre-test/post-test, surveys, and reporting of the number of people \nwho attend workshops, trainings and events are among the methods used to measure the success \nof education/information programs.  A partial list of MDEQ’s programs that could be used in the \nOwl Creek-Little Hatchie River watershed are listed below: \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n7 \n \n \n  Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Owl Creek-Little Hatchie River Watershed. \n  Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state and \nfederal public education objectives tailored for K through 5\nth\n grade students. \n Storm Drain Marking - projects for scouts, environmental clubs, and citizen groups. \n “Train the trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Owl Creek-Little \nHatchie River Watershed Implementation Team (WIT) will participate in a minimum of 3 face-\nto-face meetings.  The purpose of these meetings is to provide updates on implementation \nactivities, education events and review and modify the watershed plan.  In concert with these \nWIT meetings, and to incentivize stakeholder participation, project funding will be used to \npurchase food and other refreshments for the WIT along with providing support for renting \nfacilities in which to host those events.  In accordance with 41 CFR § 301-74.11, light \nrefreshments, meals, and/or beverages are an allowable expense under Clean Water Act (CWA) \nSection 319, provided a description of the agenda, purpose, location, costs, etc., are outlined in \nan approved 319 grant workplan. The purpose of the meetings will be for updating the watershed \nplan, and hosting field days to showcase the implemented BMPs for the public. At this time, the \nexact number of participants and locations are not known therefore costs have been estimated for \nthe purposes of this plan and will be updated. \n \nElement f: Implementation Schedule \n \nIn the event of a Section 319 NPS funding award from MDEQ to support implementation of this \nwatershed-based plan for this HUC 12 sub-watershed, MDEQ, along with support from the \nWatershed Implementation Team and Project Manager (where applicable), will: \n \n1.    Work to develop, execute, and implement a Subgrant Agreement that specifies the roles, \ntasks, requirements, and milestones for project implementation. (Month 1) \n2.    Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n3.    Work with the Tippah County SWCD, MSWCC, NRCS, and MDEQ to inform \nlandowners and operators within the watershed about the project and work to secure \ncommitments from priority area landowners and operators who are willing to participate \nin the project.  (Months 1-6) \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n8 \n \n4.    Work with the local SWCD, MSWCC, NRCS, and MDEQ to determine through GIS \napplications \n\nand intensive site surveys the priority areas within the sub-watershed that are \ncontributing significant pollutant loads.  All BMPs shall be installed in accordance with \nthe guidelines developed in the latest edition of the NRCS Technical Field Manual, or \nother approved guidelines.  (Months 1-36) \n5.    Facilitate, in cooperation with MDEQ and other monitoring partners, the completion and \nimplementation of an effective and efficient plan to monitor baseline water quality \nconditions in the watershed and track changes in water quality over time resulting from \nthe BMPs implemented through this project.  (Plan Completion:  Months 1-2); \nImplementation:  Months 3-36) \n6.    Submit blank copies of standard maintenance agreements to MDEQ. (Months 13-36) \n7.    Conduct inspections of BMPs during construction (Months 3-36) \n8.    Coordinate with and support the local SWCD, MSWCC and NRCS in the collection of \nrelevant GPS coordinates of all installed BMPs and incorporate this information into a \nGIS format.  All geospatial data shall be collected in a manner consistent with the Federal \nGeographic Data committee-endorsed standards.  (Months 3-36) \n9.    Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. (Months 3-36) \n10.   Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data. (1-36) \n \nElement g:  Milestones and Outcomes \n \nMilestone Outcome Probable Completion Date \nCoordinate with the MDEQ, \nNRCS, MSWCC, USGS, and \nthe Tippah Co. Soil and \nWater District to determine \npriority areas that are \ncontributing significant \npollutant loads to Owl Creek-\nLittle Hatchie River \nWatershed \nTarget priority areas for \nBMPs \nMonths 1-2 \nEstablish Watershed \nImplementation Team to \nbegin refinement of \nWatershed Based Plan \n(WBP) for Owl Creek-Little \nHatchie River Watershed \nEstablish WIT Months 1-2 \nInitiate watershed monitoring  Baseline condition \nmonitoring \nCompleted using historical \ndata \nMeet with landowners and \ncooperators to secure \ncommitments  \nto install BMPs in priority \nareas  \nLandowner Commitment     Months 1-6 \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n9 \n \nEstablish routine meeting \nschedule for WIT to support \nWBP revision  \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 3-36 \nCoordinate with Landowners \nto inspect BMPs that were \ninstalled using Section 319 \nfunds \nBMP Inspection Months 3-36 \nBegin monitoring to collect \ndata on post-BMP water \nquality \nPost-BMP Monitoring Months 42-48 \nFinalize education and \noutreach plan scheduled \nEducation/Outreach events    Months 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal:  Reduce the Nutrient and Sediment loads entering into the Owl Creek-Little Hatchie River \nWatershed. \n \nElement h:  Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters do \nnot include a water quality standard applicable to aquatic life protection due to sediment. \nHowever, a narrative standard for the protection of aquatic life was interpreted to determine an \napplicable target for the Little Hatchie River TMDL. The narrative standard is that waters shall \nbe free from materials attributable to municipal, industrial, agricultural, or other dischargers \nproducing color, odor, taste, total suspended solids, or other conditions in such degree as to \ncreate a nuisance, render the waters injurious to public health, recreation, or to aquatic life and \nwildlife, or adversely affect the palatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses.  In lieu of numeric criteria for sediment, the monitoring will be conducted to \ncollect data on parameters that are considered surrogates for sediment concentrations and may \ninclude measurements for Total Suspended Solids, Total Suspended Sediment, and turbidity \nalong with conventional parameters generally measured to determine aquatic health (e.g. \nDissolved Oxygen, pH, Temperature, Conductivity, Dissolved Solids). The following thresholds \nwill be used to measure compliance with water quality criteria and/or target thresholds:  \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n10 \n \n \nParameter Threshold \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of 4.0 mg/L \nDissolved Oxygen % Sat ≥ 70% - ≤ 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold less \nthan 1500 mg/L \nTotal Suspended Solids 65 mg/L \nTurbidity 75 NTU \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold less \nthan 1500 mg/L \nChemical Oxygen \nDemand 35 mg/L \nM-BISQ East Bioregion \n71.6 Calibration 3 (Applicable to waters outside the Mississippi \nAlluvial Plain) \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse. These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements. For freshwater wadeable streams, not including the Mississippi Alluvial \nPlain (i.e. Delta), Mississippi uses a calibrated and verified index of biotic integrity to make \nwater quality assessment decisions. This index, the Mississippi Benthic Index of Stream Quality \n(M-BISQ) was originally developed in 2000 and has undergone three recalibration efforts to \nrefine the sensitivity of the index. As part of the index development process, the state was \ndivided into unique bioregions. Within each bioregion, the index has a defined attainment \nthreshold that is used to determine if the biological community measures collected at a site are \nrepresentative of good water quality that can support a balanced benthic macroinvertebrate \ncommunity. If the score is above the attainment threshold for the bioregion, the site is assessed as \nattaining the aquatic life use designation. Owl Creek and Little Hatchie River are both located in \nthe East bioregion and both have M-BISQ scores that are below the attainment threshold.  After \nimplementation is completed and the stream is given sufficient time to recover, MDEQ will \ncollect new benthic macroinvertebrate community data on Little Hatchie River and Owl Creek.  \nAlong with overall MBISQ scores, the in-stream habitat surveys will also be used to determine \nchange over time.  \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan. At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Owl Creek and Little Hatchie \nRiver. In the event data indicate little or no positive change, a Stressor Analysis will be \nconducted to determine if any new or additional stressors are preventing improvements to water \nquality. If any new stressors are identified, the Watershed Implementation Team will identify \nfuture actions/activities to address those stressors. \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n11 \n \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation monitoring will be conducted to serve as a \nbaseline for the project.  Historical monitoring data are also used as baseline data where \navailable. Historical monitoring data is available in the Owl Creek-Little Hatchie River \nWatershed and these data were collect at 2 sites: Owl Creek and Little Hatchie River.  This \nvaried water quality monitoring included water chemistry sample data (nutrients, suspended \nsolids, oxygen demand, etc.), in-situ water chemistry (i.e. pH, temperature, specific conductance, \nand turbidity), as well as biological community monitoring for benthic macroinvertebrates and \naquatic habitat assessment.  A list of this historical water quality monitoring is provided in the \ntable below, and their sample locations are shown in Figures 1 and 2.  \n \nStation \nID \nWater  \nBody \nSampling \nYear (s)  \nAgency  Project \nType \nWater \nChem \nIn-Situ   Sonde   Benthics \nand/or \nAlgal \n112B43  Owl \nCreek \n2008, \n2013 \nMDEQ   MBISQ       X         X                  X \nNI005   Little \nHatchie \nRiver \n2001    MDEQ   MBISQ       X         X         X \n \nMonitoring locations for this project will be selected using best professional judgment and will \nbe targeted to reflect water quality downstream of BMP activity.  Physical, chemical and/or \nbiological data will be collected and specific parameters will be selected for monitoring based on \nthe impairment cause being addressed by the BMP(s).  Once BMP installation is complete, and \nthere has been sufficient time for the stream to stabilize, post BMP monitoring will be initiated.  \nPost BMP monitoring will be conducted in a way that allows for comparison with the pre-\nimplementation data.  Because recovery periods of streams can be dependent on type and amount \nof BMPs installed, more than 1 year of post-BMP data may be needed to observe a change in \nwater quality.  In some cases, it may take 5 or more years to see full benefits of BMPs. All data \ncollection efforts will be conducted using trained personnel following established Standard \nOperating Procedures and adhering to agency Quality Assurance protocols.  \n\nOwl Creek – Little Hatchie River Watershed    GY 2020 \n12 \n \n \nFigure 2: Monitoring Stations and Impaired Segments in Owl Creek-Little Hatchie River Watershed ",
  "metadata": {
    "id": "owl-creek-little-hatchie-river-9-key-element-plan-2020",
    "originalName": "owl-creek-little-hatchie-river-9-key-element-plan-2020.pdf",
    "mergedFrom": [
      "owl-creek-little-hatchie-river-9-key-element-plan-2020-1.json",
      "owl-creek-little-hatchie-river-9-key-element-plan-2020-2.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.727Z",
    "length": 27684
  }
}