{
  "id": "pickwick-reservoir-watershed-plan-2009",
  "rawText": "\n\n \n \nPickwick Reservoir Watersheds \n(MS-06030005 and MS-0603006, in part) \n \nWatershed Management Plan \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by the Pickwick Reservoir Watershed Implementation Team \nFacilitated by the Tennessee Valley Authority \nThe plan follows EPA’s Section 319 watershed plan guidelines and MDEQ \nWatershed Management Plan Component Checklist. \n \n \n \nWatershed Plan Facilitation \nTennessee Valley Authority \nP.O. Box 1010, SB 1H \nMuscle Shoals, AL \n(256) 386-2562 \n \n \nProject Contact and Coordination \nTishomingo County Soil and Water Conservation District \n240 Kaki Street \nIuka, MS  \n(662) 423-6272 \n \n\nPage intentionally left blank \n\n \nTable of Contents \n \n \n                                                                                                                                                             Page \n \nExecutive Summary ..................................................................................................................................v \n \nIntroduction ...............................................................................................................................................1 \n \nEco-region Description .............................................................................................................................4 \n \nWatershed Maps ........................................................................................................................................6 \n \nIssues .......................................................................................................................................................11 \n \nGoals .......................................................................................................................................................17 \n \nCauses and Sources of Impairments .......................................................................................................18 \n \nLoad Reductions of Pollutants ................................................................................................................19 \n \nProject Oversight ....................................................................................................................................20 \n \nProject Activities .....................................................................................................................................25 \n \nMonitoring ..............................................................................................................................................29 \n \nProject Budget .........................................................................................................................................32 \n \nImplementation of Plan ...........................................................................................................................33 \n \nReferences ...............................................................................................................................................35 \n \n\nPage intentionally left blank \n \n\n \nExecutive Summary \n \n \nYellow Creek, Indian Creek and Bear Creek are tributaries to the Tennessee River in northeast \nMississippi.  Yellow Creek serves as source water for the Short Coleman Water Association, which \nprovides process and drinking water for the region.   Recent surveys indicate biological impairment in \nportions of Indian and Bear Creeks, as well as tributary streams in both the Yellow and Bear Creek \nwatersheds.  Factors contributing to these conditions have been determined for these streams.  In the \nBear Creek watershed, sedimentation from unstable stream banks and agricultural and silvicultural lands \nhas been identified as the primary cause of the impaired condition.  A Total Maximum Daily Load \n(TMDL) for sediment was completed by MDEQ in October 2005.  Impaired sections include Bear Creek \nfrom near Tishomingo County Road 86 to the Alabama state line, the entire reaches of Cripple Deer and \nLittle Cripple Deer Creeks, and the entire reach of Holly Branch.  In the Yellow Creek watershed, one \ntributary, Caney Creek, is impaired through its entire reach.  Organic enrichment and sedimentation, \nprimarily from unstable stream banks and agricultural and silvicultural lands, are the primary causes for \nimpairment in Caney Creek.  Since Yellow Creek is source water for Short Coleman Water Association, \nefforts will be made to improve and protect water quality throughout this entire watershed, including the \nimpounded portion of Pickwick Reservoir.  Efforts in the Caney Creek watershed will be targeted to \naddress the causes of impairments, delisting being the project goal.  In the Indian Creek watershed, a \npoint source, Iuka POTW, has been indicated as the cause of impairment.  Recent development within \nthe city of Iuka, as well as the channelization of headwaters of Indian Creek, may also contribute to \nproblems in this watershed. \n \nProjects will be conducted through partnerships with various federal, state and local agencies and private \nlandowners to address the causes of impairment in these watersheds.  Efforts to reduce non-point source \npollution will occur throughout the area.  Routine monitoring of water quality will occur to determine \nthe effectiveness of the projects. \n \n\nPage intentionally left blank \n \n\n  \nPickwick Reservoir  \n \nWatershed Management Plan \n \n \nIntroduction \n \nPickwick Reservoir is a man-made impoundment of the Tennessee River.  The dam is located at \nTennessee River mile (TRM) 207 south of Savannah, Tennessee.  Although only 10 miles of the \nreservoir are located in Mississippi, the reservoir is actually 52 miles long and covers 43,100 acres.  \nThree streams drain from Mississippi into Pickwick Reservoir, with segments in each watershed listed \nas impaired by Mississippi Department of Environmental Quality (MDEQ). \n \nYellow Creek enters Pickwick Reservoir at TRM 215 near the Tennessee-Mississippi state line.  The \nlower 6 miles of Yellow Creek are impounded by Pickwick Reservoir, and the remaining portions have \nbeen channelized to form the Tennessee-Tombigbee waterway.  The impounded portion serves as source \nwater for the Short Coleman Water Association.  Although water quality in the embayment meets state \ncriteria, protecting this resource is a project priority.   Most free-flowing tributaries to Yellow Creek \nhave been channelized for flood control.  Caney Creek, a tributary to Little Yellow Creek near the \nDoskie community, is included by MDEQ on their 303(d) list of impaired streams due to biological \nimpairment.  This impairment appears to be caused by sedimentation and organic enrichment within the \nstream. \n \nAn assessment of land use (aerial inventory) within the Yellow Creek watershed was completed in 2007 \nby TVA.  Primary land uses that occur within the Yellow Creek Watershed consist of: \n• Forest –95,162.2 acres (75.2%) \n• Pasture/Grasslands –11,111.7 acres (8.8%) \n• Urban –7,273.5 acres (5.7%) \n• Scrub/Barren –6,460.6 acres (5.1%) \n• Open water –4,372.8 acres (3.5%) \n• Cropland –1,423.1 acres (1.1%) \n• Wetland – 804.9 acres (0.6%) \n \nThe impounded portions of Yellow Creek and the channelized portion of the Tennessee-Tombigbee \nwaterway are utilized for public recreation and commercial development.  Residential access is \npermitted along several sections of the shoreline.  Two commercial marinas operate within the \nembayment, and a third is being planned for construction.  One formal recreational site, Goat Island, is \nlocated on the embayment, providing camping facilities and boat access for recreational purposes.  Two \nadditional boat launch sites are located in the embayment.  Two commercial/industrial sites are also \nlocated in the embayment.  Because of the development along the shoreline, the Yellow Creek \nembayment hosts moderately heavy boat traffic, both recreational and commercial.  The embayment and \nwaterway also provide a transport corridor for many recreational boaters who spend summer months in \nthe Great Lakes region and winter months along the Gulf Coast. \n \nIndian Creek enters Pickwick Reservoir at TRM 220.  Its headwaters drain through the city of Iuka.  \nAlthough Iuka is only a small urban center, Indian Creek is impacted by run-off and channel \nPickwick Reservoir Watershed Management Plan Page 1  \n\n  \nmodifications typical of an urban environment.  The upper portion of Indian Creek was historically \nchannelized to reduce flooding impacts within the city of Iuka.  Currently, heavy flows during rain \nevents increases stream bank instability and erosion.  A three-mile segment of Indian Creek, from the \nIuka POTW to Pickens Branch, is listed due to organic enrichment/ low dissolved oxygen.  The lower \nportion of Indian Creek is rural farm land and forest.  Land use allocations for this watershed have not \nbeen estimated. \n \nBear Creek enters Pickwick Reservoir at TRM 225 near the Mississippi-Alabama state line.  The lower \n14 miles of Bear Creek are impounded by Pickwick Reservoir.  Bear Creek headwaters are located in \nFranklin and Winston Counties in Alabama.  The stream flows west 53 miles through Alabama before \nentering Mississippi.  It then flows north 27 miles through Tishomingo County, Mississippi, before re-\nentering Alabama.  The impounded portion occurs primarily in Alabama; however, small segments and \nembayments are located in Mississippi.  In Mississippi, Bear Creek is considered biologically impaired \ndue to sedimentation from County Road 86 to the Alabama state line.  Cripple Deer and Little Cripple \nDeer Creeks and Holly Branch are also considered impaired due to sedimentation.  A secondary flood \ncontrol channel was constructed adjacent to Bear Creek from stream mile 59 near Red Bay, Alabama, to \nmile 42 near Dennis, Mississippi.  Although normal stream flow remains within the original creek \nchannel throughout most of this length, flood waters pass over weirs and travel through the floodway.  \nThis portion of Bear Creek contains many areas of unstable stream banks, and efforts to reduce erosion \nwill be made through this project. \n \n \nPhoto 1 – Bear Creek Floodway near Belmont, MS \n \nPickwick Reservoir Watershed Management Plan Page 2  \n\n  \nAlthough an aerial inventory assessment was not conducted for the Bear Creek watershed, estimates of \nland use distribution were made during the sediment TMDL development.  Total land area with the Bear \nCreek watershed is approximately 242,844 acres (379 square miles).  The current land use allocations in \nthe Bear Creek watershed are estimated to be: \n• Forest –168,309 acres (69.3%) \n• Pasture/Grasslands –40,011 acres (16.5%) \n• Cropland –22,316 acres (9.2%) \n• Scrub/Barren –5,706 acres (2.3%) \n• Open water –3,603 acres (1.5%) \n• Urban –1,823 acres (0.8%) \n• Wetland – 1,076 acres (0.4%) \n \nWithin the Bear Creek watershed, a large floodplain occurs between the Alabama state line and \nTishomingo CR 86.  Most of the lands used for cropland in this watershed occur within this flood plain. \n \nBear Creek is used regularly by the public for canoeing and fishing.  Tishomingo State Park, located on \nBear Creek at the Natchez Trace, supplies canoeing services (rental, transportation, etc.) for public \naccess.  A canoe launch site is maintained in the park.  The park also maintains several scenic trails \nalong the creek for public recreation. \n \n \nPhoto 2 – Tishomingo State Park, located at Bear Creek near Dennis, MS \n \nAlthough no known populations are currently known from Mississippi, Bear Creek is the home to at \nleast three federally protected species of mussels.  The known populations are found in the Alabama \nportions of the stream downstream of the state line.  Historic records are known from Mississippi waters, \nas well as portions of the watershed upstream of Mississippi.  It is hoped that improvements in water \nquality in the Mississippi portion of the watershed will allow these species to expand their ranges and \nonce again live in the upper portions of this stream. \n \nPickwick Reservoir Watershed Management Plan Page 3  \n\n  \nDesignated Uses \n \nThe state of Mississippi (MDEQ) has determined the designated use for the water bodies throughout the \nstate.  All free-flowing streams in the Yellow, Indian and Bear Creek watersheds have been designated \nfor Fish and Wildlife uses.  The impounded portion of the Tennessee River in Mississippi is designated \nfor Public Water Source. \n \nEcoregion Description \n \nThe watershed lies within what is classified as the Transition Hills (65j) and Fall Line Hills (65i), which \nencompasses characteristics from the Southeastern Plains (65) ecoregion.  Streams in the Transition \nHills region, especially Bear and Cedar Creeks and eastern tributaries to Yellow Creek, have scoured \nthrough Mississippian and Devonian-age limestone, shale and chert formations, and often appear similar \nto streams of the Interior Plateau (71) ecoregion.  The Fall Line Hills region contains Cretaceous-age \ncoastal plain deposits of silt, sand, clay, and gravel which overlie the older Mississippian and Devonian-\nage formations.  Western and southern tributaries to Yellow Creek and some western tributaries to Bear \nCreek (particularly Cripple and Little Cripple Deer Creeks) flow through this material and have \nsomewhat coastal plain characteristics.  Both regions are predominately forested with oak-hickory-pine, \nwith small areas of cropland and pasture in narrow valley bottoms and along slightly sloping ridges.  \nUpland areas are often managed as pine plantation forests, consisting of monoculture loblolly pine \nharvested on a 15-25 year rotation.  Elevations range between 414 and 806 feet, representing some of \nthe highest contained in the Southeastern Plains ecoregion.  Woodall Mountain, located just southwest \nof Iuka, is the highest elevation in the state of Mississippi (806 feet).  The lowest elevations (414 feet) \nare represented by the summer pool elevation of Pickwick Reservoir. \n \nThe moist temperate climate of Tishomingo County has caused strong weathering of the soils within the \nPickwick and Bear Creek watersheds.  Almost all the soils in this area are very strongly acid and low in \navailable nutrients due to weathering and leaching.  Soils on the uplands formed in Coastal Plain \nsediments, and soils on the low terraces and flood plains formed in recent material washed from the \nuplands.  For the most part the geological formations from which the soils formed consist of irregularly \nbedded sand, clay, gravel, and lignite with a high degree of variability from site to site.  The soils found \nin the uplands of Tishomingo County are possibly the oldest soils in the state of Mississippi with many \nof them dating to the Cretaceous period.  Most of them have well defined properties indicative of their \nage such as deep sandy surfaces with bright red, heavier textured subsurfaces.  Erosion is the major soil \nproblem on the upland soils of Tishomingo County.  Because of their high degree of weathering and \ninherent low fertility, it is critical that surface soils, containing the pre-dominance of available nutrients, \nbe protected from erosion.  Wherever slopes exceed 2 percent, erosion becomes a hazard if the soils are \ndisturbed.  The addition of lime to the majority of the soils within the watersheds produces a significant \nresponse in productivity for most uses. \nPickwick Reservoir Watershed Management Plan Page 4  \n\n  \nPickwick Reservoir Watershed-Ecoregion Map \n \n \nPickwick Reservoir Watershed Management Plan Page 5  \n\n  \nPickwick Reservoir Watershed-Locator Map \n \nYellow Creek Watershed \n \nPickwick Reservoir Watershed Management Plan Page 6  \n\n  \nPickwick Reservoir Watershed-Locator Map \n \nBear Creek Watershed \n \n \nPickwick Reservoir Watershed Management Plan Page 7  \n\n  \nYellow Creek Watershed-Land Use Map \n \n         Forest         \n         Pasture/Grassland         \n         Cropland         \n         Scrub/Barren         \n         Open         Water         \n         Urban         \n         Wetland         \nPickwick Reservoir Watershed Management Plan Page 8  \n\n  \nBear Creek Watershed-Land Use Map \n \nPickwick Reservoir Watershed Management Plan Page 9  \n\n  \nIndian Creek Watershed-Land Use Map \n \n \nPickwick Reservoir Watershed Management Plan Page 10  \n\n  \nIssues \n \nRecent water quality assessments of Yellow, Indian and Bear Creek conducted by MDEQ and \nTennessee Valley Authority (TVA) indicate biological impairment in four stream segments.  Within the \nYellow Creek watershed, Caney Creek is considered impaired from its source to its mouth at Little \nYellow Creek (below MS Highway 365).  Indian Creek, from the Iuka POTW to Pickens Creek, is \nimpaired due to discharges from the POTW.  Modifications in the treatment facility and discharge point \nare planned, which should result in an overall improvement in water quality.  In the Bear Creek \nwatershed, Bear Creek from Tishomingo CR 68 to the Alabama state line is considered impaired.  Three \ntributary streams are also considered impaired.  Cripple Deer Creek from its source to the Alabama state \nline; Little Cripple Deer Creek from its source to its mouth at Cripple Deer Creek and Holly Branch \nfrom its source to its mouth at Cedar Creek are all considered impaired due to sedimentation. \n \nAlthough water quality is considered impaired through the Mississippi portion of Bear Creek, \nimprovements in conditions throughout this reach does appear to occur.  Downstream of the Mississippi \nportion, Bear Creek is considered to be in fair condition by the state of Alabama, and conditions in this \nsection are suitable for three federally protected mussel species.  Improvements in conditions in the \nMississippi portion will hopefully allow range expansion for these species. \n \nBiological data have been collected by both Mississippi Department of Environmental Quality and the \nTennessee Valley Authority.  Data collected by MDEQ were used to determine\n\n overall conditions of the \nstreams.  Streams not attaining adequate benthic criteria are considered impaired.  MDEQ then studied \nthese stream reaches to determine the cause of impairment (stressor). \n \nDuring biological sampling events, MDEQ also collected chemical data at each site.  For most streams \nin the project area, only 1-2 sample efforts were made.  This provides little data to adequately \ncharacterize the chemical component of these streams.  One sample location (Bear Creek at Highway \n30) was sampled up to 17 times for various parameters.  Based on data collected, potential pollutants did \nnot exceed acceptable levels, and in situ readings did not exceed standard water quality criteria.  A \nsummary of the chemical analyses is presented in Appendix A. \n \nPickwick Reservoir Watershed Management Plan Page 11  \n\n  \nYellow Creek Watershed \nCaney Creek is considered impaired because biological surveys show reduced diversity.  The primary \ncauses of this impairment have been determined to be sedimentation and organic enrichment/low \ndissolved oxygen concentrations.  Surveys have been conducted by both MDEQ and TVA.  Biological \ndata for both macroinvertebrate and fish communities have been collected. \n \nMDEQ Data\n \n \nLocation:  Caney Creek 150 meters upstream of Tishomingo County Road 311 \nMacroinvertebrate (MBISQ) \nDate:  February 6, 2001    Results:  48.14 (Not Attaining) \nDate:  January 28, 2003    Results:  63.95 (Not Attaining) \n \nLocation:  Caney Creek at MS Highway 365 \nMacroinvertebrate (MBISQ) \nDate:  February 26, 2008  Results:  78.68 (Attaining) \n \nLocation:  Little Yellow Creek at MS Highway 365 \nMacroinvertebrate (MBISQ) \nDate:  February 26, 2008  Results:  72.19 (Attaining) \n \nTVA Data\n \nLocation:  Caney Creek at MS Highway 365 \nFish Index of Biotic Integrity \nDate:  June 17, 2002   Results:  38 (Poor/Fair) \nDate:  June 13, 2007   Results:  44 (Fair) \nMacroinvertebrate (EPT Taxa) \nDate:  June 17, 2002   Results:  5 (Poor/Fair) \nDate:  June 13, 2007   Results:  9 (Fair/Good) \n \nThe primary sources of enrichment in the watershed are nutrient run-off from row crop and pasture lands \nand some residential sources (inadequate septic systems).  The primary source of sedimentation are \nbelieved to be run-off from agricultural lands, as well as run-off from disturbed lands such as timber \nharvest sites and earth/gravel mines.  Habitat loss and instability due to historic stream channelization \nmay also contribute to reduced biological diversity. \n \nPickwick Reservoir Watershed Management Plan Page 12  \n\n  \nIndian Creek Watershed \nIndian Creek is considered impaired because biological surveys show reduced diversity.  The primary \ncause of impairment has been determined to be organic enrichment/low dissolved oxygen \nconcentrations.  Surveys have been conducted by both MDEQ and TVA.  Biological data for both \nmacroinvertebrate and fish communities have been collected. \n \nTVA Data\n \nLocation:  Indian Creek at Tishomingo County Road 256 \nFish Index of Biotic Integrity \nDate:  June 17, 2002   Results:  38 (Poor/Fair) \nDate:  June 12, 2007   Results:  42 (Fair) \nMacroinvertebrate (EPT Taxa) \nDate:  June 17, 2002   Results:  6 (Fair) \nDate:  June 12, 2007   Results:  5 (Poor/Fair) \n \nThe primary sources of enrichment in the watershed are nutrient from the Iuka POTW.  Sediment from \nagricultural and silvicultural run-off and stream bank instability may also contribute to decreased \nbiological diversity. \n \nPickwick Reservoir Watershed Management Plan Page 13  \n\n  \nBear Creek Watershed \nBear Creek is considered impaired because biological surveys show reduced diversity.  The primary \ncauses of this impairment have been determined to be sedimentation and organic enrichment/low \ndissolved oxygen concentrations.  Surveys have been conducted by both MDEQ and TVA.  Biological \ndata for both macroinvertebrate and fish communities have been collected. \n \nMDEQ Data\n \n \nLocation:  Bear Creek at Tishomingo County Road 89 \nMacroinvertebrate (MBISQ) \nDate:  March 6, 2001 Results:  57.65 (Inconclusive) \n \nLocation:  Bear Creek at MS Highway 30 \nMacroinvertebrate (MBISQ) \nDate:  March 6, 2001 Results:  35.18 (Not attaining) \n \nLocation:  Holly Branch at Tishomingo County Road 85 \nMacroinvertebrate (MBISQ) \nDate:  January 25, 2001    Results:  57.70 (Inconclusive) \nDate:  February 25, 2003  Results:  52.11 (Not attaining) \n \nLocation:  Cripple Deer Creek at Tishomingo County Road 157 \nMacroinvertebrate (MBISQ) \nDate:  February 7, 2001    Results:  56.60 (Inconclusive) \nDate:  February 14, 2003  Results:  48.00 (Not attaining) \nDate:  February 27, 2008  Results:  55.83 (Not attaining) \n \nLocation:  Cripple Deer Creek at State Line (quarry) \nMacroinvertebrate (MBISQ) \nDate:  February 26, 2008  Results:  73.88 (Attaining) \n \nTVA Data\n \nLocation:  Bear Creek at Highway 24 (Red Bay, AL – Upstream of MS section) \nFish Index of Biotic Integrity \nDate:  June 4, 2003 Results:  48 (Good) \nDate:  July 16, 2008 Results:  44 (Fair) \nMacroinvertebrate (EPT Taxa) \nDate:  June 4, 2003 Results:  8 (Fair) \nDate:  July 16, 2008 Results:  12 (Good) \n \nLocation:  Bear Creek at Tishomingo County Road 86 \nFish Index of Biotic Integrity \nDate:  June 28, 2006 Results:  38 (Poor/Fair) \nMacroinvertebrate (EPT Taxa) \nDate:  June 28, 2006 Results:  10 (Good) \n \nPickwick Reservoir Watershed Management Plan Page 14  \n\n  \nLocation:  Bear Creek at MS Highway 30 \nFish Index of Biotic Integrity \nDate:  August 26, 2003     Results:  44 (Fair) \nDate:  June 28, 2006 Results:  42 (Fair) \nDate:  June 26, 2008 Results:  48 (Good) \nMacroinvertebrate (EPT Taxa) \nDate:  August 26, 2003     Results:  8 (Fair) \nDate:  June 28, 2006 Results:  8 (Fair) \nDate:  June 26, 2008 Results:  9 (Fair/Good) \n \nLocation:  Cripple Deer Creek at Colbert County Road 1 (immediately below the state line) \nFish Index of Biotic Integrity \nDate:  June 22, 2005 Results:  40 (Fair) \nDate:  July 17, 2008 Results:  46 (Fair/Good) \nMacroinvertebrate (EPT Taxa) \nDate:  June 22, 2005 Results:  14 (Good) \nDate:  July 17, 2008 Results: 9 (Fair/Good) \n \nThe primary sources of sedimentation are believed to be run-off from agricultural and disturbed lands \nsuch as timber harvest sites and earth/gravel mines.  Additionally, a primary source of sediment is \nunstable stream banks throughout the watershed, especially in the region of the Bear Creek floodway \nnear Belmont. \nPickwick Reservoir Watershed Management Plan Page 15  \n\n  \nGraphs of TVA Data – Bear Creek \n \nTVA Fish Surveys\nBear Creek\n0\n10\n20\n30\n40\n50\n60\n200320082006200320062008\nIBI Score\n \nRed Bay, Hwy. 24 \nCounty Road 86 Hwy. 30 \n \nGood \n \n \nFair \nFair/Good \nPoor/Fair \nPoor \nTVA Macroinvertebrate Surveys\nBear Creek\n0\n2\n4\n6\n8\n10\n12\n14\n200320082006200320062008\nIBI Score\n \n \nFair \nPoor/Fair \nGood \nFair/Good \nPoor \nRed Bay, Hwy. 24 County Road 86 Hwy. 30 \n \n \nPickwick Reservoir Watershed Management Plan Page 16  \n\n  \nGoals \n \nHistorical activities, such as alterations in land use and stream channelization, have caused reductions in \nthe natural communities in Holly Branch, Bear, Cripple Deer, Little Cripple Deer and Caney Creeks.  As \nlands have been cleared by silviculture practices, for agriculture, and for rural development, exposure of \nsurface soils to climatic conditions have resulted in increased sediment loading throughout the \nwatersheds.  Channelization of some of the streams for potential flood control has altered natural habitat \nconditions in the streams and left stream banks barren and subject to erosion.  Altered flow regimes \nwhich occur after channelization have increased the erosive effects of flood waters and further degraded \nnatural conditions. \n \nThe long-term goal of those creating the Pickwick Reservoir watershed plan is to develop a mechanism \nfor removing Caney, Bear, Cripple Deer, and Little Cripple Deer Creeks and Holly Branch from \nMDEQ’s list of impaired waters and return these streams to conditions needed to support the natural \nbiological communities typical of this region.  This goal will likely take many years to achieve; \nhowever, initial efforts are critical for long-term success.  The scope of the current watershed plan will \ncover activities for three years.  Additional efforts will likely be needed to restore these stream \nsegments.  As the project continues forward, the watershed plan will be revised, as needed, to adequately \ndirect activities toward this long-term goal. \n \nShort-term goals to be achieved during the first three years of this project will include: \n• Establishment of a locally-led watershed team to address water quality issues. \n• Completion of a Source Water Protection Plan for the Short Coleman Water Association. \n• Documentation of baseline conditions for sediment, nitrogen and phosphorus loading in all listed \nstream segments. \n• Reduction in sediment, nitrogen and phosphorus loads.* \n• Improve water quality in Caney and Bear Creeks so that at least 40% of the stream lengths can \nbe removed from the 303(d) list of impaired water bodies by 2015. \n• Attainment of water quality standards in Indian Creek from the Iuka POTW outfall to Pickens \nBranch. \n• Restoration of at least 20 acres of riparian buffer in the Bear and Yellow Creek Watersheds. \n• Revegetation of at least 10 miles of logging roads in the Bear and Yellow Creek Watersheds. \n• Stabilization of at least 1500 feet of severely eroding stream bank in the Bear and Yellow Creek \nWatersheds. \n*Actual load reduction goals for sediment, nitrogen and phosphorus will be determined by the \nImplementation Team as baseline data becomes available for analysis. \n \nProject activities should help restore natural conditions through as many miles of streams as possible, \nand various activities will reduce the erosive effects currently occurring in the watershed.  Programs \nsuch as stream bank stabilization, riparian buffer restoration and stream bank revegetation will help \nrestore stream banks to more natural conditions as well as reduce sediment loading from eroding stream \nbanks.  Animal exclusion, pasture reclamation and establishment of alternate water sources on livestock \nlands will help reduce both sediment and nutrient run-off from these lands.  Reduction in animal access \nto stream banks will help reduce stream bank erosion.  Immediate revegetation of logging roads and \nstream crossings following timber harvest will minimize the sediment loading during these activities. \n \nPickwick Reservoir Watershed Management Plan Page 17  \n\n  \nCause and Source of Impairments \n \nTwo waste water treatment discharges are located within the listed portions of the Bear Creek \nwatershed.  Neither discharger has been known to have environmental problems, nor have any Notices \nof Violations been issued by MDEQ Regulatory Branch.  The primary cause of impairment is believed \nto be sedimentation.  Therefore, non-point sources are considered the primary cause of impairment.  \nStream reaches in both watersheds are considered impaired due to sediment.  Sediment sources in both \nwatersheds are primarily from silvicultural and agricultural lands, though disturbed lands (chert/gravel \npits), construction sites and road-side clearings have also been identified. \n \n \nPhoto 4 – Agricultural lands near Belmont, MS; Bear Creek watershed \n \n \nPhoto 5 – Silviculture site near Doskie, MS; Caney Creek watershed \n \nPickwick Reservoir Watershed Management Plan Page 18  \n\n  \nLoad Reductions of Pollutants \n \nAccording to estimates used to develop the Bear Creek sediment TMDL, sediment loading in the Bear \nCreek watershed may range from 0.0008-0.004 tons/acre/day at the effective discharge.  The effective \ndischarge is defined as that flow which moves the most sediment or is channel forming.  Currently, no \nempirical data exists for sediment loading in Bear Creek, so estimates of actual sediment loading were \nused to develop the TMDL.  Estimates used indicated probable sediment loading rates from 0.002-\n0.08 tons/acre/year.  To meet the estimated level of loading, a reduction of between 50-99% would be \nneeded.  Since no appreciable amount of sediment loading can be attributed to point source discharges in \nthe watershed, all reductions will need to come from non-point sources.  Reduction of 99% of the \nsediment loading in Bear Creek is neither feasible nor practical, so the goal of this project is to realize a \n50% reduction in sediment loading.  Since a portion of the loading in this section of Bear Creek likely \noriginates in Alabama, efforts in the Mississippi portion of the watershed may have limitations for \nreaching this goal.  As the project is implemented, monitoring of conditions in the stream may indicate \nthat a lower level of reduction or expanding efforts into the Alabama portion of this watershed is needed.  \nThe scope of this project may be modified based on results of this monitoring.  Baseline data for \nsediment loads in Bear Creek were collected by The Geological Survey of Alabama in 2003-2004; \nhowever, replication of sample methodologies would require extensive time and financial obligations.  \nSince, total suspended solids (TSS) data will be collected throughout the project timeline, data collected \ninitially during this project will be used for baseline, and levels of reduction will be targeted from those \nmeasurements. \n \n  \nPhoto 3 – Previously stabilized stream bank, Golden, MS \n \nIn the Yellow Creek watershed, no data currently exists to estimate sediment or organic enrichment \nloading, and TMDLs have not been prepared to estimate load reduction needs.  As with the Bear Creek \nsediment reductions, this project will attempt to reduce sediment loads by 50% in this watershed, using \nfirst-year baseline TSS data as the baseline.  Nutrient concentrations (nitrogen and phosphorus), as well \nas biological oxygen demand (BOD) levels; will also be measured during the baseline monitoring.  \nEstimates of reduction will be determined based on these measurements.  The project goal will be to \nreduce enrichment to whatever levels are needed so that the dissolved oxygen (DO) concentration in \nmonitored streams never fails to meet state ambient water quality criteria. \n \nPickwick Reservoir Watershed Management Plan Page 19  \n\n  \nProject Oversight \n \nWatershed Implementation Team – The Pickwick Reservoir Watershed Implementation Team was \ndeveloped to direct and implement actions within the Yellow and Bear Creek watersheds that are \ndetermined to be necessary to meet project goals.  The team will seek funding for these activities and \nwill work together to ensure overall project success.  Any interested agency, stakeholder group or \nindividual citizen may be a member of this team.  Coordination will also be needed to ensure the project \nfollows needed guidelines to achieve success.  Leadership of the Implementation Team will include a \nProject Facilitator, a Watershed Coordinator and a Watershed Administrator.  The Implementation Team \nwill develop working committees to oversee various aspects of this project.  Working committees will \ninclude an Advisory Committee, a Technical Committee and an Education/ Outreach Committee.  Other \ncommittees may also be developed as deemed necessary by the team.  Various agencies and \norganizations with an interest in water quality in northeast Mississippi have become members of this \nImplementation Team.  Other members may be added during the project efforts.  Current \nImplementation Team members include: \n \nAlcorn County Soil and Water Conservation District (ASWCD) \nUS Environmental Protection Agency (EPA) \nUS Fish and Wildlife Service (FWS) \nGeological Survey of Alabama (GSA) \nMississippi Department of Environmental Quality (MDEQ) \nMississippi Department of Wildlife, Fisheries and Parks (MDWFP) \nMississippi Forestry Commission (MFC) \nMississippi Rural Water Association (MRWA) \nMississippi State University Extension Service (MSU-ES) \nMississippi Soil and Water Conservation Commission (MSWCC) \nNatural Resources Conservation Service (NRCS) \nPrentiss County Soil and Water Conservation District (PSWCD) \nShort Coleman Water Association (SCWA) \nTishomingo County Soil and Water Conservation District (TSWCD) \nTishomingo County Department of Health (TCDH) \nThe Nature Conservancy (TNC) \nTennessee Valley Authority (TVA) \nLocal land owners and users \n \nDecisions made by the partnership will be adopted by voice vote at periodic team meetings.  Each \nmember organization will have a single vote on each decision.  A quorum (greater than fifty percent of \nall members) must be present at a meeting for any decisions to be accepted.  No absentee or proxy \nvoting will be accepted.  Final approval of the Watershed Plan and modifications to the final Watershed \nPlan must be approved by seventy-five (75) percent of all members present.  Other business decisions \nmust be approved by a simple majority of members present. \n \nPickwick Reservoir Watershed Management Plan Page 20  \n\n  \nTeam Leadership \n \n¾ Project Facilitator – The Implementation Team has selected a facilitator who will help direct \nproject activities. The Facilitator’s duties will include, but may not be limited to: \n Work to include needed agencies, stakeholders and potential partners. \n Delegate to the Watershed Coordinator duties necessary to carry out project activities and \nmeetings. \n Monitor subcontractor work to ensure completion is on track and within project scopes. \n Serve on all Implementation Team committees and as chairperson of the Advisory \nCommittee. \n \n¾ Watershed Coordinator – The watershed coordinator has been hired to coordinate project \nactivities and serve as the local point of contact for area residents and stakeholders.  The \nCoordinator’s duties will include, but may not be limited to: \n Assist the facilitator by overseeing day to day activities of the project and ensure that all \naspects of the project are conducted according to work plan, budget and timeline. \n Provide monthly progress reports to the faci\n\nlitator and MDEQ, and, if necessary, will \nassist grantee agencies with semi-annual reports to MDEQ and EPA. \n Serve on all Implementation Team committees. \n Attend MDEQ Basin Team meetings to provide partnership updates to the Basin Team. \n Attend quarterly and special called meetings of the Implementation Team and update \npartners on project status.  Assist Project Facilitator with meeting preparation and \nlogistics \n Maintain an electronic and hard-copy file of all Implementation Team and committee \nmeeting minutes. \n Work with team members to plan and implement public meetings, agency updates and \nother outreach/education activities. \n Work with Tishomingo County Soil and Water Conservation District and local \nlandowners to identify potential BMP sites and develop working relationships with \nlandowners for BMP installation. \n Work with Mississippi Forestry Commission and local landowners to identify potential \nBMP sites and develop working relationships with the landowners for BMP installation. \n Assist landowners and participating agencies with BMP installation projects.  Assistance \nmay include, but may not be limited to, project planning, cost share calculations, permit \napplications, materials and supply requisition and actual installation. \n Assist, as needed, TVA with routine and BMP monitoring activities, including, but not \nlimited to, field collection, data storage and analysis. \n \nPickwick Reservoir Watershed Management Plan Page 21  \n\n  \n¾ Watershed Administrator – The watershed administrator has been hired to assist the \nImplementation Team with administrative activities such as record keeping, budget management \nand clerical needs.  The administrator’s duties will include, but may not be limited to: \n Attend quarterly and special called meetings of the Implementation Team and update \npartners on project status.  Record meeting activities and submit meeting minutes to all \npartners in a timely fashion after the meetings. \n Attend committee meetings and maintain minutes of the meetings. \n Assist Watershed Coordinator with maintaining an electronic and hard-copy file of all \nImplementation Team and committee meeting minutes. \n Assist Watershed Coordinator and partners with meetings, presentations and outreach \nactivities (logistics, announcements, invitations, etc.). \n Assist Watershed Coordinator with all necessary paperwork, including, but not limited to, \napplications for project funds and for Tennessee Valley Authority and Corps of Engineer, \nand Mississippi Department of Environmental Quality permits. \n Assist Watershed Coordinator with monthly reports to MDEQ summarizing activities and \naccomplishments of the 319 funded and partnership funded projects. \n Assist partners, as needed, with bi-annual reports to MDEQ and EPA to highlight project \nactivities and accomplishments. \n Assist Watershed Coordinator with maintenance of financial records for implementation \nprojects. \n \n¾ Agency Lead – Each agency member of the Implementation Team will designate one individual \nas a primary point of contact for all team activities.  The Agency Lead’s duties will include, but \nmay not be limited to: \n Keep their respective agency abreast of Implementation Team activities and project \ndevelopments. \n Relay all announcements, schedules and plans to others within their agency necessary for \nteam projects. \n Provide team with necessary information and assistance, as needed, for team activities. \nFor grantee agencies, the agency lead will: \n Work with the watershed coordinator to identify project sites and secure participation of \nland owners. \n Work with watershed coordinator to ensure project completion, within timelines and \nbudgets. \n Coordinate grant requirements with the grantor and overseeing grant-funded activities. \n Provide semi-annual reports to MDEQ, as required in grant contracts. \n \nPickwick Reservoir Watershed Management Plan Page 22  \n\n  \nTeam Committees \n \nEducation/Outreach Committee – The Education/Outreach Committee will be formed to oversee all \npublic and agency education/outreach activities throughout the project.  This committee will plan and \ncoordinate all education events, public meetings, workshops, etc., deemed necessary for project success.  \nThis committee will make recommendations to the Implementation Team concerning the education and \noutreach needs of the project. \nChair: Tulon McKee, Watershed Coordinator \nJanet Chapman, MDEQ \nConnie Alexander, EPA \nDamien Simbeck, TVA \nDelta Datsis, Tishomingo Co. SWCD \nDonald Garris, MRWA \nSandy Mitchell, Alcorn Co. SWCD \nGail Spears, MSWCC \nDan Owen, MSE-ES \nPhil Purvis, NRCS \nChristy Robinson, NRCS \nGeorge Byrd, MFC \nDaniel Stuart/Nick Hatten, MDEQ \n \nAdvisory Committee – The Advisory Committee will be formed to oversee project direction and \nactivities.  This committee will determine funding needs throughout the project.  If needed, this \ncommittee will make decisions on proposed activities to determine if the actions meet project scope and \ndirection.  This committee will make recommendations to the Implementation Team concerning \npotential project activities. \nChair:  Damien Simbeck, TVA \nTulon McKee, Watershed Coordinator \nJanet Chapman, MDEQ \nStuart McGregor, GSA \nPhil Purvis, NRCS \nMark Gilbert, MSWCC \nJim Lacy, MFC \n \nPickwick Reservoir Watershed Management Plan Page 23  \n\n  \nTechnical Committee – The Technical Committee will be formed to oversee all technical aspects of the \nproject, such as monitoring needs, load reduction estimations and water quality conditions.  This \ncommittee will develop and oversee the implementation of the Monitoring Plan.  This committee will \nwork with MDEQ and EPA to evaluate water quality data throughout the project to determine project \nsuccess and help determine if streams in the watershed meet state criteria for designated uses.  This \ncommittee will make recommendations to the Implementation Team concerning technical needs of this \nproject. \nChair: Robert Wimbish, NRCS \nTulon McKee, Watershed Coordinator \nDamien Simbeck, TVA \nRonn Killebrew, MDEQ \nDelta Datsis, Tishomingo Co. SWCD \nTommy Dean, Tishomingo Co. SWCD \nL.C. Taylor, NRCS \n \nPickwick Reservoir Watershed Management Plan Page 24  \n\n  \nProject Activities \n \nActivities developed under this plan will be used to reduce sediment and nutrient loading throughout the \nYellow Creek watershed and in selected regions of the Bear Creek watershed.  Projects will occur in \nfour major categories:  Agriculture, Silviculture, Source Water Protection and Education/Outreach.  \nProject partners will assist in all categories; however, certain partners will take the lead for each.  The \nTishomingo County Soil and Water Conservation District will oversee all agricultural activities.  The \nMississippi Forestry Commission will oversee silviculture activities.  The Tennessee Valley Authority \nwill oversee the source water protection and education/outreach activities. \n \nSource Water Protection\n \n \nSince the entire Yellow Creek Watershed drains toward the Short Coleman Water Association intake, \nefforts will be made to reduce potential pollution sources throughout the watershed.  Potential pollution \nsources will be identified, and project partners will work to minimize the effect of these sources. \n \n¾ Aerial Inventory – An inventory of land use and condition has been conducted using low-altitude \ninfrared photography and GIS analysis.  A summary of analysis will be presented to the partners \nand will be used to help target program activities to maximize water quality protection. \n¾ Integrated Pollutant Source Identification – The Tennessee Valley Authority, through matching \nfunds and in-kind services, will provide to the partners an Integrated Pollutant Source \nIdentification (IPSI) model of the Yellow Creek watershed.  This model will help the partners \nidentify potential pollutant sources, as well as provide a mechanism to estimate pollution \nreduction after BMP installation. \n¾ Source Water Assessment – Funds will be available to develop a source water assessment for the \nShort Coleman Water Association to identify potential pollution sources.  This assessment may \nalso be used to develop a source water protection plan for both the Short Coleman and proposed \nCorinth water intakes in the Yellow Creek/Tenn-Tom Waterway channel. \n¾ Source Water Protection Plan – Data from the Source Water Assessment will be used to develop \na Source Water Protection Plan.  This plan will outline potential pollution sources and protection \nmechanisms available in the watershed.  The plan will also outline mechanisms for public \nawareness \n¾ Yellow Creek Embayment Outreach – Partners will work with reservoir-front residents and \nrecreational users to reduce pollution from development, boat engines, septic systems, etc.  \nCurrent efforts to work with local marinas to protect water quality in the embayment will \ncontinue.  Through matching funds, some supplies will be made available to area marinas and \nboaters that will help reduce the risk of pollution entering the Yellow Creek embayment. \n \nPickwick Reservoir Watershed Management Plan Page 25  \n\n  \nAgriculture \n \nAgricultural activities will be conducted with cooperating land owners to address sediment and nutrient \nrun-off from livestock and cropland operations.   \n \n¾ Animal Exclusion – Cost-share assistance will be available to land owners who install fencing to \nprevent animal access to stream banks in listed portions of Bear, Cripple Deer and Little Cripple \nDeer Creeks, Holly Branch and all areas in the Yellow Creek watershed.  Assistance will also be \navailable to plant excluded lands in hardwood vegetation to provide a buffer for the adjacent \nstream bank.  If needed, funds will also be available to install alternate water systems (ponds, \ntroughs, etc.) for pastures where no alternate source is available. \n¾ Pasture Restoration – Cost-share assistance will be available to land owners who wish to restore \novergrazed pastures or pastures which have been identified as being in poor condition.  \nAdditional assistance may be available if land owners are willing to convert pastures to native \nwarm-season grasses. \n¾ Rotational Grazing – Cost-share assistance will be available to land owners who install fencing \nto divide pastures so that rotational grazing can be used to prevent overgrazing and pasture \ndegradation. \n¾ Grade Stabilization – Cost share assistance will be available to land owners to construct \nstabilization structures to reduce erosion in gullies, ditches and other drainages. \n¾ Sediment Basin – Cost share assistance will be available to land owners to construct settling \nbasins, retention ponds or similar structures to reduce sediment run-off from agricultural lands. \n \n \nPhoto 6 – Proposed BMP site near Doskie, MS \n \n \nPickwick Reservoir Watershed Management Plan Page 26  \n\n  \nSilviculture \n \nMost lands in both the Bear Creek and Yellow Creek watersheds are currently forested and used for \ntimber harvest activities.  Complete removal of vegetative cover during harvest activities, as well as run-\noff alterations caused by the construction of logging roads and stream crossings, can contribute to heavy \nsediment loading.  If left unrestored, these sites will continue to contribute heavy sediment loading for \nyears following harvest activities.  Programs funded under this plan will be designed to recover harvest \nsites immediately after harvest activities to minimize sedimentation from these sites. \n \n¾ Harvest Planning – Land owners wishing to receive funding assistance through this project will \nwork with the Mississippi Forestry Commission to develop a harvest plan for their land.  This \nplan will outline proper procedures, including proper Best Management Practices (BMPs), to be \nfollowed by all contractors.  The plan will also identify best locations for logging roads, landings \nand stream crossings to reduce potential impacts during harvest activities.  Land owners who \ndevelop and follow such a plan will then be eligible for cost share assistance to implement \ncorrective actions to reduce sediment run-off after harvest. \n¾ Logging Road Revegetation – Cost-share assistance will be available to sow grasses along \nlogging roads immediately after harvest is complete.  Where needed, funds will also be available \nto grade the roads to redirect run-off and reduce the force of run-off as it travels along the roads.  \nAs funds are available, additional cost-share assistance will be given to land owners willing to \nuse native warm-season grasses for revegetation efforts. \n¾ Landing Restoration – Cost-share assistance will be available to sow grasses throughout areas \nused to stage equipment and activities during logging operations. \n¾ Stream Crossing Restoration – Cost-share assistance will be available to grade and reforest any \nareas where stream crossings were required during harvest activities.  If needed, funds will also \nbe available to stabilize stream banks in these areas to reduce erosion and restore natural \nconditions. \n \n \nPhoto 7 – Eroding logging road near Doskie, MS \n \nPickwick Reservoir Watershed Management Plan Page 27  \n\n  \nEducation/Outreach \n \nSince public involvement will be critical to the success of this project, reaching local land owners with \nall aspects of project activities will be critical.  Maintaining up-to-date communication with local \nresidents, officials and project partners will be vital for project success.  A communication and \nmarketing plan will be developed to highlight outreach activities. \n \n¾ Public Meetings – Meetings will be conducted during the initial phases of this project to increase \nawareness of local citizens concerning current issues in the watersheds and to introduce project \nplans to potential partners.  Periodically during the project, additional meetings may be \nconducted to help keep interested citizens up-to-date on project activities. \n¾ Stakeholder Presentations – Periodically, partners will meet with local stakeholder groups \n(Cattlemen’s Association, Forestry Association, Economic Development agencies, etc.) to \nintroduce this project to members and keep them up-to-date with project activities. \n¾ Government Briefings – As needed, presentations will be made to local, state and federal \nagencies to provide project summaries and present results.  If requested, written reports will be \nsubmitted to government officials to provide detailed summaries of project activities. \n¾ Activity Workshops – As needed, workshops will be held to distribute information and ideas to \nwatershed residents concerning various aspects of this project.  Workshops will include, but may \nnot be limited to: \no Septic system maintenance workshops \no Clean boating events \no Riparian buffer seminars \no Forestry planning workshops \no Watershed Harmony presentations \no Secchi Day \no Envirothon \no Water quality educational video \n¾ Project Tours – As BMP projects are implemented, tours will be given to interested land owners, \npotential partners and various agencies to increase awareness of project activities and to \nhighlight project successes.  These tours will provide direct recognition of participating land \nowners and will hopefully initiate additional interest in watershed activities. \n¾ Watershed Education Events – Partners will work with area schools and organizations to provide \nhands-on educational events to increase awareness of water quality issues and highlight the need \nfor projects to protect and improve water quality in the area. \n \nPickwick Reservoir Watershed Management Plan Page 28  \n\n  \nMonitoring \n \nThroughout the project, monitoring of water quality conditions will be vital to track project success and \nidentify additional needs.  Both chemical and biological monitoring will be utilized to track results.  \nPrior to initiation of this project, little chemical data has been collected in these watersheds.  Initial data \ncollected during the first year will serve as baseline data for conditions in the streams.  When possible, \ndata will be collected in the immediate vicinity of BMP installation sites to measure success of the \nproject activities.  Pre- and post-BMP monitoring at these sites will help determine pollutant load \nreductions directly associated with these project activities.  Biological monitoring will be used to \nmeasure long-term benefits of this project.  A monitoring plan will be developed to outline monitoring \nneeds and schedules. \n \nBiological Monitoring\n \n \nBiological monitoring during this project will consist of benthic macroinvertebrates, fish and \nbacteriological collections.  Biological data will be used to determine overall stream health.  Bear Creek \nis known to be inhabited by three federally listed and one candidate species of mussels.  None are \nknown to occur in the Mississippi portion of the stream; however, populations are known to occur \nimmediately downstream of the Mississippi-Alabama state line.  Biological community data will be very \nimportant to tract conditions in the watershed to help manage/protect these populations.  Mississippi \nDepartment of Environmental Quality (MDEQ) uses benthic macroinvertebrate data to determine over-\nall stream health (listing criteria).  TVA routinely monitors both macroinvertebrates and fish, so \ninformation concerning fish communities will also be obtained during this project.  Macroinvertebrate \ndata will be utilizing MDEQ standard protocols or equivalent.  Joint sampling efforts with MDEQ and \nTVA will be conducted at the beginning of the project to determine if TVA protocols will adequately \nmeet MDEQ listing criteria.  If data is adequately comparable, TVA will use its Level II sampling \nprotocol throughout the project.  If results of joint sampling indicate that TVA protocols do not provide \ncomparable results to MDEQ protocol, MDEQ protocol will be used throughout the project. \n \nBiological Sample Schedule\n \n \n\n\n Macroinvertebrate data will be collected twice during each five year interval.  Initial data will be \ncollected at the beginning of the project (2008).  Additional data will be collected after three \nyears (2011) and again after two more years (2013).  If additional funding is available to extend \nthe project beyond the original three years, monitoring will continue on the three/two year \ninterval throughout the project life. \n \n Fish data will be collected every five years.  Initial data will be collected at the beginning of the \nproject (2008) and additional data will be collected in five years (2013). \n \n Under TVA’s current valley monitoring plan, all hydrologic units in the Tennessee Valley are \nmonitored every five years for biological health.  Both macroinvertebrate and fish data are \ncollected.  Typically only one site is sampled in each hydrologic unit; however, TVA currently \nmonitors two sites in the Yellow Creek watershed.  In the Bear Creek watershed, TVA has only \none routine monitoring location, but also collects data at two sites immediately downstream of \nthe project area in Alabama (see Sample Locations). \nPickwick Reservoir Watershed Management Plan Page 29  \n\n  \nBiological Sample Locations \n \n In the Yellow Creek watershed, biological data will be collected at two locations.  These two \nsites are located in the lower reaches of each stream’s watershed and are both part of TVA’s \nroutine monitoring efforts. \n¾ Caney Creek at Mississippi Highway 365 \n¾ Little Yellow Creek at Mississippi Highway 365 \n \n In the Bear Creek watershed, biological data will be collected at five locations.  One of these \nlocations is part of TVA’s routine monitoring efforts. \n¾ Bear Creek at Mississippi Highway 30 (TVA routine location) \n¾ Bear Creek at County Road 86 \n¾ Cripple Deer Creek at County Road 157 \n¾ Cripple Deer Creek at the Alabama/Mississippi state line (Vulcan Quarry) \n¾ Holly Branch at County Road 85 \n \nChemical Monitoring\n \n \nChemical monitoring during this project will consist of multiple parameters sampled on a monthly basis \nthroughout the project period.  Minimal historical data is available for these watersheds.  Baseline data \nwill be obtained during the first year of the project period.  Comparison with the following two years \nwill be made to determine if improvements can be documented or if additional data must be collected \nafter the first phase of the project.  Portions of both Bear and Caney Creek watersheds are considered \nbiologically impaired possible due to sediment contamination.  Measurements of total suspended solids \n(TSS) and turbidity will be used to tract reductions in sediment loading in these streams.  Biological \nimpairment of Caney Creek may also be caused by organic enrichment and subsequent low dissolved \noxygen levels.  Measurements of dissolved oxygen (DO) and biological oxygen demand (BOD) will be \nused to tract conditions.  Since nutrient loading in a stream greatly affects conditions leading to low DO \nimpairment (i.e. algal blooms), nitrogen (TKN, NO\n2\n-NO\n3\n and NH\n3\n-N) and Phosphorus (TP) levels will \nalso be monitored.  Since most devices used to measure DO also contain temperature, pH and \nconductivity capabilities, these parameters will also be measured.  Alkalinity and hardness will be \nmeasured when possible to provide general information about the conditions in these watersheds \n \nStandard operating procedures (SOP) and quality assurance/quality control (QA/QC) manuals of any \norganization (field crews or laboratory) must meet minimum MDEQ and TVA requirements.  In-situ \nparameters will be made using calibrated devices or other similar method.  Laboratory parameters will \nbe processed by an approved laboratory.  Sample collection, handling and analysis will be conducted \nusing approved SOP and follow QA/QC guidelines. \n \nPickwick Reservoir Watershed Management Plan Page 30  \n\n  \nChemical Sample Schedule \n \n All parameters will be sampled monthly at all sites.  Since dissolved oxygen and pH levels are \ngreatly influenced by aquatic plant photosynthesis activities, measurements of these parameters \nin the Yellow Creek watershed must be made before 10:00 a.m. during summer months (May-\nSeptember).  If low DO or high pH conditions are determined at other locations during the first \nyear (2009), samples will be made before 10:00 a.m. during future years.  If significant \nfluctuations in DO and/or pH are suspected or measured, additional samples may be taken \nbetween 1:00 p.m. and 4:00 p.m. on the same days of morning measurements. \n \nChemical Sample Locations\n \n \n In the Yellow Creek watershed, chemical data will be collected at six locations. \n¾ Choate Creek at County Road 260 (Alcorn County) \n¾ Coke Creek at County Road944  \n¾ Caney Creek at Mississippi Highway 365 \n¾ Caney Creek at County Road 300 \n¾ Little Yellow Creek at Mississippi Highway 365 \n¾ Little Yellow Creek at mouth \n \n In the Bear Creek watershed, chemcial data will be collected at nine locations. \n¾ Bear Creek at Mississippi Highway 30 \n¾ Bear Creek at Natchez Trace Parkway (or at Tishomingo State Park canoe access) \n¾ Bear Creek at County Road 86 \n¾ Bear Creek at County Road 68 \n¾ Cripple Deer Creek at Mississippi Highway 25 \n¾ Cripple Deer Creek at County Road 157 \n¾ Cripple Deer Creek at the Alabama/Mississippi state line (Vulcan Quarry) \n¾ Little Cripple Deer Creek at County Road 957 \n¾ Holly Branch at County Road 85 \n \nChemical Monitoring – BMP site locations\n \n \nAdditional chemical monitoring, using same methods and parameters as monthly monitoring efforts, \nwill be conducted at selected BMP locations, as feasible.  Locations will be selected based on access and \nlikely direct impact of BMP installation.  Samples will be collected during or immediately after storm \nevents with at least two inches of rainfall in a twenty-four hour period.  At least three samples will be \ncollected before the BMP’s are installed.  After installation, samples will be collected during similar \nstorm events (same magnitude and season) to determine BMP effectiveness.  Since some BMP’s require \nmultiple years to become effective (vegetative buffers, biological stabilization, etc.), monitoring may be \nneeded for several years after installation before effectiveness can be determined. \nPickwick Reservoir Watershed Management Plan Page 31  \n\n  \nProject Budget \n \nPrimary funding of project activities will be made through a Clean Water Act, Section 319 grant from \nEPA through MDEQ and matching funds from various partners.  Estimated project costs for initial BMP \ninstallation are approximately $1.5 million, including in-kind services and cost-shares.  Matching funds \nwill be provided by various Implementation Team members, stakeholder groups and participating land \nowners.  See Table 1 for a summary of anticipated expenses. \n \nTable 1 – Budget Summary for Project Implementation \n \nTotal Expenditure \nGrant (Federal) \nFunds \nMatching Funds \nPersonnel \n$524,150.00                $134,400.00                $389,750.00                \nAdministration                  $47,400.00                  $35,400.00                  $12,000.00                  \nProject                  Coordination                  $123,000.00                  $84,000.00                  $39,000.00                  \nMonitoring                                           $60,000.00                                           $0.00                                           $60,000.00                                           \nSource Water Assessment $51,000.00 $15,000.00 $36,000.00 \nBMP Activities $242,750.00 $0.00 $242,750.00 \nTravel \n$11,500.00                           $0.00                           $11,500.00                           \nSeptic System Seminars $1,500.00 $0.00 $1,500.00 \nSource Water Assessment $1,000.00 $0.00 $1,000.00 \nAdministration                                       $3,000.00                                       $0.00                                       $3,000.00                                       \nProject Coordination $6,000.00 $0.00 $6,000.00 \nEquipment \n$0.00                           $0.00                           $0.00                           \nSupplies \n$841,950.00                $690,675.00                $151,275.00                \nEducation                    Supplies                    $10,200.00                    $6,675.00                    $3,525.00                    \nBMP                Activities                $831,750.00                $684,000.00                $147,750.00                \nContractual \n$0.00$0.00$0.00\nConstruction \n$0.00$0.00$0.00\nEducation/Outreach \n$78,000.00                           $0.00                           $78,000.00                           \nPublic Education/Outreach $60,000.00 $0.00 $60,000.00 \nField Day Tours $8,100.00 $0.00 $8,100.00 \nForestry BMP Education $3,600.00 $0.00 $3,600.00 \nBoater Education $4,500.00 $0.00 $4,500.00 \nSeptic System $1,800.00 $0.00 $1,800.00 \nOther \n$12,250.00                  $12,250.00                  $0.00                  \nLand Owner Incentives $12,250.00 $12,250.00 $0.00 \nIndirect Charges \n$0.00$0.00$0.00\nTotal                $1,467,850.00                $837,325.00                $630,525.00                \n \nPickwick Reservoir Watershed Management Plan Page 32  \n\n  \nImplementation of the Plan \n \nThe Pickwick Reservoir Watershed Implementation Team was developed in 2005 to address water \nquality problems in the Yellow and Bear Creek watersheds.  In 2007-2008, the Implementation Team \nrequested, and has received grant money to help address these issues.  During the spring of 2008, a \nwatershed coordinator was hired to oversee project activities and coordinate efforts of local and agency \npartners. \n \nPublic forums will begin during the summer and fall of 2008 to increase awareness of water quality \nissues with local land owners.  These forums will be structured to provide background watershed \ninformation to local residents, government officials and agencies, and industrial and private land owners.  \nThese forums will hopefully generate enough interest in the Pickwick Reservoir watershed to fully \nimplement this watershed plan.  Cooperating partners will conduct numerous activities to address water \nquality issues in the watershed.  Project activities will be conducted during a three-year period to \nimplement all major actions (i.e., BMP installation) in the plan.  Continued monitoring and project \ncoordination will be conducted for at least 10 years to determine overall success of the efforts.  \nOversight of each aspect of project activities will be assigned to one or more of the participating \npartners; however, other partners will participate and assist with each activity.  These activities are \noutlined in the following timeline. \n \nActivity                                                    Initiation                                                    Completion                                                    Partner                                                    Oversight                                                    \nSeek grant funds to assist land \nowners with BMP installation \nMay 2006 May 2008 MSWCC, MFC, TVA \nProvide a Watershed Coordinator \nfor project oversight \nMarch 2008 End of project SWCD \nSolicit land owner participation in \ncost share programs \nJune 2008 August 2011 SWCD, MFC \nDevelop demonstration sites to \nincrease public awareness/ \ninvolvement \nJune 2008 June 2009 TVA, SWCD, MFC \nHost site tour to highlight BMPs \nand watershed activities \nJune 2009 End of project TVA, SWCD, MFC \nDevelop Source Water Assessment \nfor Short Coleman Water \nAssociation \nJune 2008 June 2009 TVA \nDevelop Source Water Protection \nPlan for Short Coleman Water \nAssociation \nJuly 2009 March 2010 MDEQ, EPA, TVA \nConduct educational events for \npublic awareness and participation \nSeptember 2008 End of project TVA, EPA \nProvide regular project updates to \npartners, local residents, \ngovernment officials and \ninterested parties \nJune 2008 End of project All partners \n \nPickwick Reservoir Watershed Management Plan Page 33  \n\n  \nProject Timeline (continued) \nActivity                                                    Initiation                                                    Completion                                                    Partner                                                    Oversight                                                    \nEstablish BMPs on lands \nthroughout the watershed to \nreduce pollution loading \nJune 2008 End of project SWCD, MFC \nConduct septic system education \nevents and assist home-owners \nwith failing septic systems \nJune 2008 End of project TVA, EPA \nConduct water quality protection \nevents with reservoir user groups \nto increase awareness for source \nwater protection \nOctober 2008 End of project TVA \nConduct regular public meetings \nto provide updates/information \nJune 2008 End of project All partners \nMonitor chemical status September 2008 December 2011 TVA, MDEQ \nMonitor biological status January 2008 December 2013 TVA, MDEQ \n \nPickwick Reservoir Watershed Management Plan Page 34  \n\n  \nPickwick Reservoir Watershed Management Plan Page 35  \n \nReferences \n \nMississippi Department of Environmental Quality, “Mississippi 2006 Section 303(d) List of Impaired \nWater Bodies, Draft”, April 2007 \n \nMississippi Department of Environmental Quality, “Mississippi 2008 Section 303(d) List of Impaired \nWater Bodies”, Draft, April 2008 \n \nMississippi Department of Environmental Quality, “TMDL, Bear Creek Watershed for Biological \nImpairment Due to Sediment”, October 2005 \n \nMississippi Department of Environmental Quality, Surface Water Division website, \nhttp://www.deq.state.ms.us/MDEQ.nsf/page/SurfaceWater_home\n \n \n\n \nAppendix A \n  ",
  "metadata": {
    "id": "pickwick-reservoir-watershed-plan-2009",
    "originalName": "pickwick-reservoir-watershed-plan-2009.pdf",
    "mergedFrom": [
      "pickwick-reservoir-watershed-plan-2009-1.json",
      "pickwick-reservoir-watershed-plan-2009-2.json",
      "pickwick-reservoir-watershed-plan-2009-3.json",
      "pickwick-reservoir-watershed-plan-2009-4.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.729Z",
    "length": 67802
  }
}