{
  "id": "sherman-creek-panola-quitman-floodway-9-key-element-plan",
  "rawText": "\n\nSherman Creek-Panola Quitman Floodway GY 2018 \n1 \n \nSherman Creek-Panola Quitman Floodway Watershed Plan \n9 Key Element Plan \nHUC 080302020306 \nMWS 9336 \nGY18 Proposed Project Area \nDecember 6, 2018 \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Sherman Creek –Panola Quitman Floodway Watershed is located in the northern portion of \nTallahatchie County in North Mississippi covering approximately 33,139 acres.  According to \nthe 2011 National Land Cover Database (NLCD), the landuse within this watershed is comprised \nof approximately 55% cropland, 16% wetlands, 19% forestland, and 9% other (water, \nscrub/barren, pastureland and urban) (Figure 1).  This watershed is unique in the fact that part of \nit lies within the bluff hills and the other part is in the Mississippi delta.  Only 23.5% of the \nwatershed falls within the Bluff Hills Region of the Yazoo Basin while the majority, 76.5%, is \nlocated within the Delta Region.  The location of the watershed places the Sherman Creek-\nPanola Quitman Floodway watershed into two different ecoregions.  The Hills portion falls \nwithin the Mississippi Valley Loess Plains ecoregion and the Delta portion falls within the \nMississippi Alluvial Plain ecoregion (commonly referred to as the Delta).  The change in \necoregions can also be seen in Figure 1 as it corresponds with drastic changes in landuse as the \nhilly upland area falls off into the flatter land used for agricultural purposes.   \n \nThe Sherman Creek –Panola Quitman Floodway Watershed has a long history with Mississippi’s \nSection 303(d) List of Impaired Water Bodies beginning with the original listing of the Sherman \nCreek Drainage Area (DA) in 1996 (MS270E). The Buntyn Creek DA (MS271E) and the Panola \nQuitman Floodway (MSPQWAYE) were also included as impaired segments on the Section \n303(d) list and are located within the Sherman Creek – Panola Quitman Floodway Watershed.  \nThe entire drainage areas for all of these were considered as “evaluated” §303(d) listings versus \n“monitored” listings as there were no water quality data to verify impairment status of the water \nbodies in the watershed. The State of Mississippi Section 303(d) List of Impaired Water Bodies \nidentified the impairments were caused by pesticides, siltation, nutrients, and organic enrichment \n(OE) / low dissolved oxygen (Low DO). In 2002, the Sherman Creek drainage area was replaced \nwith East Levee Creek on the list as it captures the majority of the drainage in the watershed. \nEast Levee Creek retained the segment identifier of MS270E along with the previously identified \ncauses of pesticides, nutrients, siltation, and organic enrichment (OE)/low dissolved oxygen \n(Low DO).  \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n2 \n \n \nFigure 1: Sherman Creek-Panola Quitman Floodway Watershed Landuse Map, 2011 \nNLCD \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n3 \n \nThere are several Total Maximum Daily Load (TMDL) reports for water bodies within the \nSherman Creek-Panola Quitman Floodway Watershed (HUC 080302020205). One of the \nTMDLs is Total Maximum Daily Load Yazoo River Basin Delta Region for the Delta Region. \nBoth East Levee Creek (MS270E) and Panola Quitman Floodway (MSPQWAYE) are included. \nThis TMDL was completed for sediment. The State of Mississippi Water Quality Criteria for \nIntrastate, Interstate, and Coastal Waters (MDEQ, 2016) regulation does not include a \nnumerical water quality standard for aquatic life protection due to sediment. The narrative \nstandard for the protection of aquatic life is sufficient for justification of TMDL development, \nbut does not provide a quantifiable TMDL target. The target for this TMDL is based on reference \nsediment yields developed by the Channel and Watershed Processes Research Unit (CWPRU) at \nthe National Sedimentation Laboratory (NSL) and calls for an 80 to 85% reduction in sediment. \n \nA separate sediment TMDL was developed for waters that fall outside the boundaries of the \nMississippi Alluvial Plain ecoregion.  Buntyn Creek (MS271E) is included in the Total \nMaximum Daily Loads For Yazoo River Basin, Mississippi Hills Region For Sediment.  This \nTMDL was also completed for sediment and has the same water quality standards as the \naforementioned TMDL.  The Hills region TMDL calls for a sediment reduction of 98 to 99%.   \n \nThere are no facilities in the Sherman Creek-Panola Quitman Floodway Watershed with NPDES \npermits that include limits for Total Suspended Solids (TSS) which is used as an indicator of \nsediment contributions from permitted activities.  Certain contaminants may be associated with \nsediment such as pesticides and nutrients. These contaminants were not addressed directly within \nthese TMDLs. However, these contaminants would also be controlled by the same best \nmanagement practices (BMPs) that control the sediment from nonpoint sources of pollution.   \n \nNonpoint loading of sediment in a water body results from the transport of the material into \nreceiving waters by several processes including mass wasting, head cutting, gullying, and sheet \nand rill erosion. Sources of sediment come from improper agricultural and silvicultural practices \nas well as from a plethora of other improper land-use activities, e.g. construction, mining, \nchannel alterations. \n \nEast Levee Creek also has a TMDL entitled Total Maximum Daily Load Total Nitrogen and \nTotal Phosphorus For East Levee Creek. Mississippi does not have water quality standards for \nallowable nutrient concentrations; however, MDEQ is currently working in conjunction with a \nNutrient Task Force (NTF) on the development numeric nutrient criteria.  To meet the target \nnutrient concentrations, the TMDL calls for a Total Phosphorus (TP) reduction of 96.42 % and \nTotal Nitrogen (TN) reduction of 88.36%.  \n \nThe Panola Quitman Floodway has a separate TMDL entitled Total Maximum Daily Load Total \nNitrogen, Total Phosphorus, and Organic Enrichment/Low Dissolved Oxygen For Panola \nQuitman Floodway.  To meet the target nutrient concentrations, the TMDL calls for a TP \nreduction of 97.16 % and TN reduction of 90.73% in this waterbody.  \n \nFigure 2 shows all of the impaired segments in the Sherman Creek – Panola Quitman Floodway \nWatershed along with locations of established monitoring stations in the watershed. \n \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n4 \n \n \nFigure 2: Sherman Creek-Panola Quitman Floodway Watershed Impaired Segments, \nMonitoring Sties, and Hills/Delta Border  \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n5 \n \nElement b: Expected Load Reduction \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2016) regulation does not include a numerical water quality standard for aquatic life \nprotection due to sediment; however, a narrative standard for the protection of aquatic life was \ninterpreted to determine an applicable target for the sediments TMDLs in the Sherman Creek – \nPanola Quitman Floodway Watershed.  The narrative standard states waters shall be free from \nmaterials attributable to municipal, industrial, agricultural, or other dischargers producing color, \nodor, taste, total suspended solids, or other conditions in such degree as to create a nuisance, \nrender the waters injurious to public health, recreation, or to aquatic life and wildlife, or \nadversely affect the palatability of fish, aesthetic quality, or impair the waters for any designated \nuses. The sediment TMDL which includes both East Levee Creek (MS270E) and Panola \nQuitman Floodway (MSPQWAYE) concluded that sediment yields would need to be reduced by \n80-85% in the watershed.  The Buntyn Creek (MS271E) sediment TMDL called for a reduction \nin yields by 98 to 99%.  All sediment yield reductions were developed from suspended sediment \nconcentration data measured at stable streams in the same ecoregion(s).  The targets were \ndeveloped to reflect stable stream conditions using reference sediment yields.  These reference \nconditions were established by the USDA’s Channel and Watershed Processes Research Unit \n(CWPRU) at the National Sedimentation Laboratory (NSL). \n \nNonpoint loading of sediment in a water body results from the transport of material into \nreceiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion.  Sources of sediment include: agriculture, silviculture, rangeland, construction sites, \nroads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream sources, \nand historical landuse activities and channel alterations.   \n \nAt the time of nutrient TMDL development for both East Levee Creek and the Panola Quitman \nFloodway, and is presently the case, MDEQ does not have numeric nutrient criteria.  To develop \nthe TN and TP targets a percentile approach was used following EPA recommendations.  The \ntarget values are subject to revision upon the adoption of numeric nutrient criteria or \nrecommendations from the Nutrient Technical Advisory Group.  The Total Nitrogen and Total \nPhosphorus TMDL for East Levee Creek (MS270E) recommended Total Phosphorus (TP) needs \nto be reduced by 96.42 % with a target annual concentration of 0.09 mg/L and a reduction of \nTotal Nitrogen (TN) to be 88.36% with an annual target concentration of 0.58 mg/L.  The Total \nNitrogen, Total Phosphorus, and Organic Enrichment/Low DO TMDL for Panola Quitman \nFloodway (MSPQWAYE) calls for a 97.16% reduction of Total Phosphorus with a target \nconcentration of 0.09 mg/L and a reduction of Total Nitrogen by 90.73% and a target \nconcentration of 0.58 mg/L.  \n \nNon-point loading of nutrients and organic material in a water body results from the transport of \nthe pollutants into receiving waters by overland surface runoff, groundwater infiltration, and \natmospheric deposition. Unlike nitrogen, phosphorus is primarily transported in surface runoff \nwhen it has been sorbed by eroding sediment. \n \nThe NRCS has a list of approved BMPs to address nutrients and sedimentation.  This list will be \nused to identify candidate BMPs in Sherman Creek-Panola Quitman Floodway.   \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n6 \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC), the Natural Resource Conservation Service (NRCS), and the local Soil \nand Water Conservation Districts (SWCDs) throughout the state.  These SWCDs are typically \nhoused within USDA Service Centers co-located with NRCS offices.  These USDA Service \nCenters handle federal assistance programs offered through the Farm Bill.  As part of these \nservices, SWCD staff communicate regularly with the local landowners and operators within the \nwatershed as they work to support sign-ups for Farm Bill initiatives.   Staff from MSWCC and \nthe SWCD depend upon assistance from their NRCS partners in determining landowner interest \nin the watershed because they are on the farms and in the fields with the landowners, understand \nthe needs at the local level, and have knowledge of the amount of unfunded applications for \nfederal program assistance which meet Section 319 eligibility requirements.  Based on their \nanalysis, installation of the following BMPs would mitigate sediment and nutrient issues in the \nSherman Creek-Panola Quitman Floodway watershed helping the stream recover: fencing, \nwatering facilities, ponds, streambank and shoreline protection, dikes, critical area planting, \ngrade stabilization structures, forage and biomass planting, structures for water control, or any \nother practices to help reduce sedimentation and nutrient loading.  Factors considered for \ndetermining specific locations for the placement of BMPs included the following attributes based \nupon best professional judgement of trained NRCS, SWCD, and MDEQ staff: \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDLs (i.e., “It is recommended that \nwater bodies within [the watershed] be considered a priority for streambank and \nriparian buffer zone restoration and any sediment reduction BMPs, especially for road \ncrossings, agricultural activities, and construction activities); \n4. Ease of showing effectiveness of the BMP(s) through monitoring; and \n5. Shorter length of time for anticipated results (i.e., within the grant period). \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n7 \n \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project that may contribute match include MSWCC, Tallahatchie County Soil \nand Water Conservation District, NRCS, USGS (monitoring), and/or local landowners and \noperators.  For project implementation, administration, management, and watershed plan \nrevision, as well as hosting and facilitating team meetings, MDEQ plans to work under a \nmemorandum of agreement (MOA) with the MSWCC to implement this project.  Project \npartners provided the funding amounts used to estimate costs for BMP installation.  Provided \nbelow is summary of estimated costs for potential BMPs and overall project implementation: \nCost Estimate: Full Project Implementation \nPractice Name No of Units Unit Unit Cost \nEstimated \nCost \nEstimated \nMatch \nCover Crops 750 ac $70.00  $52,500.00  $35,000.00 \nCritical Area Planting 20 ac $196.00  $3,920.00  $2,613.33 \nDike 8,000 ft $3.87  $30,960.00  $20,640.00 \nPond 8 ea $5,381.00  $43,048.00  $28,698.67 \nFence 25,000 ft $2.25  $56,250.00  $37,500.00 \nGrade Stabilization Structure 90 ea $7,700.00  $693,000.00  $462,000.02 \nForage and Biomass Planting 200 ac $151.00  $30,200.00  $20,133.33 \nHeavy Use Area Protection 6,000 ft $4.00  $24,000.00  $16,000.00 \nStreambank and Shoreline Protection 8,000 ft $128.82  $1,030,560.00  $687,040.03 \nStructure for Water Control 35 ea $3,500.00  $122,500.00  $81,666.67 \nWatering Facility 15 ea $8,900.00  $133,500.00  $89,000.00 \n*Monitoring \n      \n$164,656.00    \n*Education/Outreach       $161,700.00 $70,000.00 \n*Technical Assistance       $75,000.00 $50,000.00 \n*Project Management, \nImplementation, Coordination, Plan \nRevision       $245,713.80   \n      \nTotal Estimated Project Cost \n   \n$2,867,507.80  \n \nTotal Estimated Project Match \n    \n$1,600,292.07 \n \n* -Denotes fields that are estimated upon five incremental funding cycles of the project  \n \nDue  to  the  magnitude  of  this  project,  it  will need to  be  incrementally  funded.   In  order  to  fully \naddress  all  suggested  conservation  needs  in  the  watershed,  this  plan  recommends  funding  be \nprovided in 5 increments.  To maximize education and outreach activities and monitoring efforts, \nMDEQ plans to leverage with existing programs already allocated for funding where possible. \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n8 \n \nBelow is the estimated budget for the first incremental funding (Phase 1) of this project: \n \nCost Estimate: Phase 1 Implementation \n \nPractice Name \nNo of \nUnits Unit \nUnit \nCost \nEstimated \nCost \nEstimated \nMatch \nCritical Area Planting 5 ac $196.00  \n$980.00  $653.33 \nDike 1,000 ft $3.87  \n$3,870.00  $2,580.00 \nPond 1 ea $5,381.00  \n$5,381.00  $3,587.34 \nFence 1,258 ft $2.25  \n$2,830.50  $1,887.00 \nGrade Stabilization Structure 12 ea $7,700.00  \n$92,400.00  $61,600.03 \nForage and Biomass Planting 40 ac $151.00  \n$6,040.00  $4,026.67 \nStreambank and Shoreline Protection 500 ft $128.80  \n$64,400.00  $42,933.35 \nStructure for Water Control 4 ea $3,500.00  \n$14,000.00  $9,333.34 \nWatering Facility 2 ea $8,900.00  \n$17,800.00  $11,866.67 \nMonitoring \n      \n$74,656.00   \nEducation/Outreach       $63,900.00 $30,000.00 \nTechnical Assistance       $15,000.00 $10,000.00 \nProject Management, \nImplementation, Coordination, \nPlan Revision       $25,300.00   \n      \nPhase 1 Estimated Project Cost \n   \n$386,557.50  \n \nPhase 1 Estimated Project \nMatch \n    \n$178,467.74 \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \nliterature can be used in the Sherman Creek-Panola Quitman Floodway watershed project by \ntailoring them to address the sedimentation and nutrient loading.  A positive approach is used to \nreach the full diversity of people in the community with projects that foster a “sense of place”, a \n“sense of pride in community”, and a sense of the native plants, animals, and general ecology of \ntheir region, as well as, the history of the community and a sense of economics.  Stakeholders \nand coordinators join together to participate in problem-solving, brainstorming, plan \ndevelopment, training workshops, festival event planning, soil and water conservation field days, \ntree boards, poster, art and writing projects and other activities that promote collaboration and \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n9 \n \nownership of the watershed, as well as, solutions to its problems.  The ultimate goal is to bring \nabout behavior changes and the use of “best management practices” that will improve water \nquality and the overall quality of life in the watershed.  Evaluation forms, pre-test/ post-test, \nsurveys, and reporting of the number of people who attend workshops, trainings and events are \namong the methods used to measure the success of education/information programs.  A partial \nlist of MDEQ’s programs that could be used in the Sherman Creek-Panola Quitman Floodway \nwatershed are listed below: \n \n Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Dry Creek Watershed. \n  Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n  “Train the Trainer” - workshops and materials for Soil and Water districts, Extension \nService, etc. \n “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Sherman Creek-\nPanola Quitman Floodway Watershed Implementation Team (WIT) will participate in a \nminimum of 3 face-to-face meetings.  The purpose of these meetings is to provide updates on \nimplementation activities, education events and review and modify the watershed plan.  In \nconcert with these WIT meetings, and to incentivize stakeholder participation, project funding \nwill be used to purchase food and other refreshments for the WIT along with providing support \nfor renting facilities in which to host those events.  In accordance with 41 CFR § 301-74.11, light \nrefreshments, meals, and/or beverages are an allowable expense under CWA Section 319, \nprovided a description of the agenda, purpose, location, costs, etc., are outlined in an approved \n319 grant workplan. The purpose of the meetings will be for updating the watershed plan, and \nhosting field days to showcase the implemented BMPs for the public. At this time the exact \nnumber of participants and locations are not known therefore costs have been estimated for the \npurposes of this plan and will be updated. \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n10 \n \nElement f: Implementation Schedule \n \nIn the event of a Section 319 NPS funding award from MDEQ to support implementation of this \nwatershed-based plan for this HUC 12 sub-watershed, MDEQ, along with support from the \nWatershed Implementation Team and Project Manager (where applicable), will: \n \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the roles, \ntasks, requirements, and milestones for project implementation. (Month 1) \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n3. Work with the Tallahatchie County SWCD, MSWCC, NRCS, and MDEQ to inform \nlandowners and operators within the watershed about the project and work to secure \ncommitments from priority area landowners and operators who are willing to participate \nin the project.  (Months 1-6) \n4. Work with the local SWCD, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that are \ncontributing significant pollutant loads.  All BMPs shall be installed in accordance with \nthe guidelines developed in the latest edition of the NRCS Technical Field Manual, or \nother approved guidelines.  (Months 1-36) \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion and \nimplementation of an effective and efficient plan to monitor baseline water quality \nconditions in the watershed and track changes in water quality over time resulting from \nthe BMPs implemented through this project.  (Plan Completion:  Months 1-2); \nImplementation:  Months 3-36) \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 13-36) \n7. Conduct inspections of BMPs during construction (Months 3-36) \n8. Coordinate with and support the local SWCD, MSWCC and NRCS in the collection of \nrelevant GPS coordinates of all installed BMPs and incorporate this information into a \nGIS format.  All geospatial data shall be collected in a manner consistent with the Federal \nGeographic Data committee-endorsed standards.  (Months 3-36) \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs (Months 3-36) \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data (1-36) \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n11 \n \nElement g: Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nMSWCC, USGS, and the Tallahatchie \nCo. Soil and Water District to determine \npriority areas that are contributing \nsignificant pollutant loads to Sherman \nCreek-Panola Quitman Floodway \nWatershed \nTarget priority \nareas for BMPs \nMonths 1-2 \nEstablish Watershed Implementation \nTeam to begin refinement of Watershed \nBased Plan for Sherman Creek-Panola \nQuitman Floodway Watershed \nEstablish WIT Months 1-2 \nInitiate watershed monitoring  Baseline condition \nmonitoring \nCompleted using historical \ndata \nMeet with landowners and cooperators to \nsecure commitments to install BMPs in \npriority areas \nLandowner \nCommitment \nMonths 1-6 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 3-36 \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection Months 3-36 \nBegin monitoring to collect data on post-\nBMP water quality \nPost-BMP \nMonitoring \nMonths 42-48 \nFinalize education and outreach plan Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nElement h: Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters do \nnot include a water quality standard applicable to aquatic life protection due to sediment or \nnutrients. However, a narrative standard for the protection of aquatic life was interpreted to \ndetermine an applicable target for the Yazoo River Basin Delta Region TMDL and the Yazoo \nRiver Basin Hills Region TMDL. The narrative standard states that waters shall be free from \nmaterials attributable to municipal, industrial, agricultural, or other dischargers producing color, \nodor, taste, total suspended solids, or other conditions in such degree as to create a nuisance, \nrender the waters injurious to public health, recreation, or to aquatic life and wildlife, or \nadversely affect the palatability of fish, aesthetic quality, or impair the waters for any designated \nuses.  In lieu of numeric criteria for sediment and nutrients, the monitoring will be conducted to \ncollect data on parameters that are considered surrogates for sediment (Total Suspended Solids, \nTotal Suspended Sediment, turbidity) and nutrients along with conventional in-situ parameters \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n12 \n \ngenerally measured to determine aquatic health (e.g. Dissolved Oxygen, pH, Temperature, \nConductivity, Dissolved Solids) will also be obtained.  The following thresholds will be used to \nmeasure compliance applicable with water quality criteria and/or target thresholds:  \n \nParameter Threshold \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of 4.0 mg/L \nDissolved Oxygen % Sat ≥ 70% - ≤ 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold less than \n1500 mg/L \nChemical Oxygen \nDemand 35 mg/L \nTotal Suspended Solids 65 mg/L \nTurbidity 75 NTU \nTotal Nitrogen \n0.58 mg/L annual concentration (numeric threshold established by \nTMDLs for Panola Quitman Floodway and East Levee Creek) \nTotal Phosphorus \n0.09 mg/L annual concentration (numeric threshold established by \nTMDLs for Panola Quitman Floodway and East Levee Creek) \nM-BISQ West Bioregion \n43.7 Calibration 3 (Applicable to waters outside the Mississippi Alluvial \nPlain) \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying trends in water quality and should provide \ninformation to help determine if the implementation activities are resulting in water quality \nimprovements.  For freshwater wadeable streams, not including the Mississippi Alluvial Plain \n(i.e. Delta), Mississippi uses a calibrated and verified index of biotic integrity to make water \nquality assessment decisions.  This index, the Mississippi Benthic Index of Stream Quality (M-\nBISQ) was originally developed in 2000 and has undergone three recalibration efforts to refine \nthe sensitivity of the index.  As part of the index development process, the state was divided into \nunique bioregions.  Within each bioregion, the index has a defined attainment threshold that is \nused to determine if the biological community measures collected at a site are representative of \ngood water quality that can support a balanced benthic macroinvertebrate community.  If the \nscore is above the attainment threshold for the bioregion, the site is assessed as attaining the \naquatic life use designation.  In the Hills region, Buntyn Creek is located in the West bioregion \nand was determined to be impaired in 2002 compared to the bioregional reference conditions.  \nAlong with overall MBISQ scores, the in-stream habitat surveys will also be used to determine \nchange over time.  As noted above, for the Delta region, a calibrated multi-metric index of \nbiological integrity is not available at this time.     \n     \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n13 \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in the Sherman Creek-Panola \nQuitman Floodway watershed.  In the event data indicate little or no positive change, a Stressor \nAnalysis will be conducted to determine if any new or additional stressors are preventing \nimprovements to water quality.  If any new stressors are identified, the Watershed \nImplementation Team will identify future actions/activities to address those stressors. \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation water quality chemical and biological monitoring \nhave been compiled from 2002-2015 to serve as baseline data for the project along with any \nhistorical data available on Sherman Creek, Buntyn Creek, East Levee Creek, and Panola \nQuitman Floodway. This varied water quality monitoring included water chemistry data \n(nutrients, suspended solids, oxygen demand, chlorides, etc.), in-situ field measurements for such \nparameters as dissolved oxygen, pH, temperature, specific conductance, and turbidity, datalogger \n(sonde) deployment for continuous in-situ field measurement data as well as biological \ncommunity monitoring for benthic macroinvertebrates in wadeable Hill region streams and \nalgal/periphyton chlorophyll-a in support of Delta nutrient criteria development. A list of this \nhistorical water quality monitoring in the Sherman Creek-Panola Quitman Floodway watershed \nis provided in the table below and their sample locations are shown in Figures 1 and 2. \n \nStation \nID \nWater \nBody \nSample \nYear(s) \nCollecting \nAgency \nProject Water \nChem \nIn-\nSitu \nSonde Benthics \nand/or \nAlgal \n111B15 East \nLevee \nCreek \n2007, \n2008, \n2015 \nUSGS, \nMDEQ \nDelta \nNutrient, \nDelta \nBluff \nHills \nNutrient \nX X X X \n113A54 Sherman \nCreek \n2015 USGS, \nMDEQ \nDelta \nBluff \nHills \nNutrient \nX X X X \nYZ240 Buntyn \nCreek \n2002 MDEQ MBISQ X X \n \nX \nYZ365 Panola \nQuitman \nFloodway \n2002, \n2007 \nMDEQ, \nUSGS, \nUSCOE \nDelta \nPilot \nIBI, \nDelta \nNutrient \nX X \n \nX \n \nPost-BMP monitoring locations will be selected using best professional judgement and will be \ntargeted to reflect water quality downstream of BMP activity.  Once BMP installation is \n\nSherman Creek-Panola Quitman Floodway GY 2018 \n14 \n \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring \nwill be initiated.  Post BMP monitoring will be conducted in a way that allows for comparison \nwith the pre-implementation data.  Because recovery periods of streams can be dependent on \ntype and amount of BMPs installed, more than 1 year of post BMP data may be needed to \nobserve a change in water quality.  In some cases, it may take 5 or more years to see full benefits \nof BMPs. All data collection efforts will be conducted using trained personnel following \nestablished Standard Operating Procedures and adhering to agency Quality Assurance protocols.   \n \n \n ",
  "metadata": {
    "id": "sherman-creek-panola-quitman-floodway-9-key-element-plan",
    "originalName": "Sherman_Creek_Panola_Quitman_Floodway_9_Key_Element_Plan_2018.pdf",
    "mergedFrom": [
      "sherman-creek-panola-quitman-floodway-9-key-element-plan-2018.json"
    ],
    "pageCount": 14,
    "mergedAt": "2025-10-02T06:41:26.776Z",
    "length": 31306
  }
}