{
  "id": "tarebreeches-creek-tuscumbia-river-canal-watersehd-plan",
  "rawText": "\n\n \n \n TAREBREECHES CREEK-TUSCUMBIA \nRIVER CANAL WATERSHED \nIMPLEMENTATION PLAN \n \n \n \n \n \n \n \n \n \n\n \n \n2 \nTarebreeches Creek-Tuscumbia  \nRiver Canal Watershed \n Implementation Plan \n \n \n \nPrepared for: \n \nTennessee-Tombigbee River/North Independent Streams Basin Team \nMississippi Department of Environmental Quality \n \n \n \n \n \n \n \n \n \nDeveloped by:  \n \nTarebreeches Creek-Tuscumbia River Canal Watershed Implementation Team \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by: \n \nMississippi Soil and Water Conservation Commission \nP.O. Box 23005 \nJackson, MS 39225 \n \n \n \n \n\n \n \n3 \nTable of Contents \n \nI. Executive Summary          6 \n \nII. Vision Statement          8 \n \nIII. Mission Statement          8 \n \nIV. Watershed Implementation Team        9 \n \n V. Watershed Description         10 \n  \nVI. Stakeholder Interests         14 \n \nVII. Water Resources          15 \n     A.  History of Activity in the Watershed        15 \n     B. Wildlife and Fisheries         16 \n     C. Designated Use Classifications and Water Quality Standards    16 \n     D.  Current Status of Waterbodies in the Watershed     18 \n     E. TMDLs           18 \n \nVIII. Watershed Management Actions       19 \n       Agricultural Best Management Practices       \nA. Sediment and Nutrient BMPs       19 \n    1. Stakeholders Interests        19 \n    2. Goals/Objectives         19 \n    3. Management Actions        19 \n   4.  Project Tracking/Assessment of Progress      20 \n    5. Desired Results/Benefits        21 \n    6. Roles/Responsibilities        22 \n    7. Budget          22 \n \nIX. Education/Outreach Activities        23 \n       A. Educational Activities to be implemented      23 \n 1. Signage          23 \n     a. Indicators          24 \n     b. Schedule          24 \n     c. Budget          24 \n 2. Landowner Meeting and Field Days      24 \n     a. Indicators          24 \n     b. Schedule          25 \n     c. Budget          25 \n 3. Fact Sheets          25 \n     a. Indicators          25 \n     b. Schedule          25 \n     c. Budget          26 \n\n \n \n4 \n 4. Watershed Harmony Puppet Show       26 \n     a. Indicators          26 \n     b. Schedule          26 \n     c. Budget          26 \n 5. Alcorn County Fair         27 \n     a. Indicators          27 \n     b. Schedule          27 \n     c. Budget          27 \n 6. Water Bill Mailers         28 \n     a. Indicators          28 \n     b. Schedule          28 \n     c. Budget          28 \n 7. Presentations         29 \n     a. Indicators          29 \n     b. Schedule          29 \n     c. Budget          29 \n 8. Radio Advertisements        29 \n      a. Indicators          29 \n     b. Schedule          29 \n     c. Budget          30 \n 9. Adopt-A-Stream         30 \n      a. Indicators          30 \n     b. Schedule          30 \n     c. Budget          30 \n10. Total Projected Cost of Education/Outreach Activities    31 \n 11. Total Budget for Tarebreeches Creek-Tuscumbia River Canal  \n     Watershed Implementation Plan       31 \n \nX. Evaluation           32 \n     A. Plan Evaluation Procedure        32 \n     B. Implementation Evaluation Strategy       32 \n 1. MSWCC          32 \n 2. MDEQ          32 \n \nXI. Plan Revision          33 \n    A. Plan Revision Procedure        33 \n \nXII. Resources          34 \n \nList of Figures \n \nFigure 5.1 Land use in Tuscumbia River Canal Watershed     11 \n \nFigure 5.2 Land Use in Tarebreeches Creek-Tuscumbia River Canal Watershed  12 \n \nFigure 5.3 Tarebreeches Creek-Tuscumbia River Canal Watershed    13 \n\n \n \n5 \nList of Tables \n \nTable 1.1 Tarebreeches Creek-Tuscumbia River Canal Management Action Plan    7 \n \nTable 7.1 Water Quality Standards        17 \n \nTable 8.1 Funded 319 Project Budget for BMPs      22 \n \nTable 8.2 Technical Assistance        22 \n \nTable 9.1 Projected Costs for Signage       24 \n \nTable 9.2 Projected Costs for Landowner Meeting and Field Days    25 \n \nTable 9.3 Projected Costs for Fact Sheets       26 \n \nTable 9.4 Projected Costs for Watershed Harmony Puppet Show    26 \n \nTable 9.5 Projected Costs for Alcorn County Fair      27 \n \nTable 9.6 Projected Costs for Water Bill Mailers      28 \n \nTable 9.7 Projected Costs for Presentations       29 \n \nTable 9.8 Projected Costs for Radio Advertisements      30 \n \nTable 9.9 Projected Costs for Adopt-A-Stream      30 \n \nTable 9.10 Total Projected Education Budget      31 \n \nTable 9.11 Tarebreeches Creek-Tuscumbia River Canal Watershed \n     Implementation Plan Total Budget       31 \n \n \nList of Appendices \n \nAppendix A- Plant and Animal Species of Special Concern \n \nAppendix B- Funded 319 Project Proposal \n \nAppendix C- Stressors \n \nAppendix D- Checklist of Watershed Implementation Elements \n \n\n \n \n6 \nI. EXECUTIVE SUMMARY \n \n Tarebreeches Creek-Tuscumbia River Canal Watershed has been identified as a priority \nwatershed by the Mississippi Department of Environmental Quality.  Tuscumbia River Canal has \nthree TMDLs; one for Nutrients and Organic Enrichment/Low DO for Bridge and Elam Creeks \nand Tuscumbia River Canal (2004), the second for Biological Impairment Due to Sediment in \nthe Tuscumbia River Canal (2005), and the third for Fecal Coliform For Tuscumbia River Canal \n(2000).  Tarebreeches Creek is on the 2012 Section 303(d) List f Impaired Water Bodies for \nbiological impairment.  The Mississippi Soil and Water Conservation Commission, Alcorn \nCounty Soil and Water Conservation District and USDA Natural Resources Conservation \nService thought a great impact on water quality could be made in this watershed. MSWCC \nsubmitted a proposal to apply best management practices to address the nutrient loading and \nsedimentation issue on agricultural lands. That proposal was selected for funding by MDEQ and \na contract was awarded to MSWCC.  Under that contract, MSWCC is required to assemble a \nWatershed Implementation Team to address other issues and concerns within the watershed and \nwrite a Watershed Implementation Plan.   \n The key natural resource problems in this watershed are nutrient loading and \nsedimentation.  The Watershed Implementation Plan has the goals of reducing the nutrients and \nsediment entering the streams and creeks in the watershed, and helping to implement the above \nmentioned TMDLs and removing Tarebreeches Creek from the 303(d) List of Impaired Waters.  \nTo help solve this problem, one of the management actions is to implement a 319 water quality \nproject on the agricultural lands within the watershed.  The targeted area for this project is the \ncropland and pastureland in Alcorn County that lies within the watershed boundaries.  This is a \nthree year project that began in 2011 and will end in September 2014.  The groups that will be \nimplementing the management action of reducing the sediment loading are the Alcorn County \nSoil and Water Conservation District, Natural Resources Conservation Service, and the \nMississippi Soil and Water Conservation Commission.  The Alcorn County Soil and Water \nConservation District and the Natural Resources Conservation Service can be contacted at 662-\n287-7223 ext. 3 for information and assistance about this management action.  \n \n\n \n \nTable 1.1 Tarebreeches Creek-Tuscumbia River Canal Management Action Plan \n \n \n \n \n7 \nGoal Who What  Where When Contacts \nReduce sediment and nutrient \nloading, achieve narrative \nstandards for sediment loading, and \nFish and Wildlife Support \ndesignated use  \nMSWCC,  \nUSDA NRCS, Alcorn \nCounty Soil and Water \nConservation District \nContinue existing programs and projects \nrelated to farmer education, BMP \nimplementation, and habitat conservation \nEntire \nwatershed \n2012-2014 Mark Gilbert, MSWCC  \n601-354-7645 \nPaul Lowry, NRCS \n662-287-7223 ext. 3 \nSandy Mitchell, SWCD \n662-287-7223 ext. 3 \nLocal Landowners and \noperators \n Field Borders \n Grade Stabilization Structures \n Pasture and Hay Land Planting \n Water and Sediment Control Basins \n  Heavy Use Area Protection \nNutrient Management \nStream Crossings \nTank/Trough \n  Fencing \n \n \nEntire \nWatershed \n2012-2014 Local landowners \n\n \n \n8 \nII. VISION STATEMENT \n \n The vision of the Tarebreeches Creek-Tuscumbia River Canal Watershed Implementation Team \nis to improve and/or protect the quality of water in streams and creeks. \n \n  \n \n \n \n \n \n \n \n \n \nIII. MISSION STATEMENT \n \n The mission of the Tarebreeches Creek-Tuscumbia River Canal Watershed Implementation \nTeam is to educate landowners on new and innovative best management practices, land use planning \nmethods and implement the appropriate Best Management Practices that will result in the enhancement \nand conservation of all the natural resources in the watershed. \n \n \n \n \n \n \n \n \n\n \n \n9 \nIV. WATERSHED IMPLEMENTATION TEAM \nMembers of the Watershed Implementation Team for the Tarebreeches Creek-Tuscumbia River Canal Watershed \ninclude as follows: \n \nGladys Scott-Landowner \n \nSteve Wilbanks- Landowner \n \nDavid Rainey- Landowner/Business Operator \n \nBenjamin Scott- Landowner \n \nDanny Turner- Alcorn County Soil and Water Conservation District Commissioner \n \nLowell Hinton- Alcorn County Soil and Water Conservation District Deputy Commissioner \n \nPatrick Poindexter- Mississippi State Extension Service \n \n Mark Gilbert- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nPatrick Vowell- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nGail Spears- Mississippi Soil & Water Conservation Commission (MSWCC) \n \nAndy Whittington- Mississippi Farm Bureau Federation (MFBF) \n \nDaniel Stuart- Mississippi Department of Environmental Quality (MDEQ) \n \nPaul Lowry- Natural Resources Conservation Service (NRCS) \n \nSandy Mitchell- Alcorn County Soil & Water Conservation District (SWCD) \n \nShane Stocks- United States Geological Survey (USGS) \n \nDr. John Ramirez-Avila- Mississippi State University (MSU) \n \nJanet Chapman- Mississippi Department of Environmental Quality (MDEQ) \n \nJustin Presson- Natural Resources Conservation Service(NRCS) \n \n \n \n \n \n \n \n \n \n \n\n \n \n10 \nV. WATERSHED DESCRIPTION \n The Tuscumbia River Canal watershed is approximately 204,311 acres.  The land uses for the \nTuscumbia River Canal Watershed include 33,293 acres of pastureland (16.3%), 72,214 acres of \nforestlands (35.3%), 31,795 acres of cropland (15.6%), and 67,009 acres of urban and other (all together \n32.8%).   Figure 5.1 shows the land uses in the Tuscumbia River Canal watershed. The targeted area of \nthis watershed is the Tarebreeches Creek Subwatershed (Figure 5.2).  \n Tarebreeches Creek-Tuscumbia River Canal is located in the north to northwestern portion of \nAlcorn County, Mississippi (Figure 5.3).  There are 16,721 acres located within the watershed \nboundaries.  This watershed is located in a rural area with a population of about 300 people within its \nboundaries.  The community of Gift is located in this watershed.  Economic conditions that influence \nthis watershed include farming which is affected by commodity prices and costs in planting and \nharvesting.  There have been no significant changes in land use in this watershed in the last 20 years.   \n The soils in the watershed include Arkabutla, Mantachie and Rosebloom series soils. The \ngeology of the watershed is Ripley Formation of the Late Cretaceous Epoch.  Tarebreeches Creek-\nTuscumbia River Canal watershed is located in the Northern Hilly Gulf Coastal Plain ecoregion.  Some \nof the areas alongside the Tuscumbia River Canal in the watershed are wetlands.  \n Other named water bodies in the watershed include Little Cane Creek and Hughes Break.  The \nTuscumbia Wildlife Management Area is located within this watershed.   \n  \n \n\n \n \n11 \n \n \n \n \n \nFigure 5.1 Land Use in Tuscumbia River Canal. \n \n \n \n\n \n \n12 \n \n \n \n \nFigure 5.2 Land Use in Tarebreeches Creek-Tuscumbia River Canal. \n\n \n \n13 \n \n \nFigure 5.3 Tarebreeches Creek-Tuscumbia River Canal Creek Watershed. \n\n \n \n14 \nVI. STAKEHOLDER INTERESTS \n \n The stakeholders in this watershed want to conserve and preserve the soil, water, and wildlife \nhabitat.  Stakeholders in the watershed want to restore the watershed creeks and streams to a state of \ngood water quality.  This can be done by reducing runoff (stopping erosion and loss of topsoil) and \nimproving habitat for fish and wildlife. Stakeholders desire to use the natural resources wisely, eliminate \nsnags and debris (through dredging or other alternatives), stop people from littering and provide beaver \ncontrol.  Also, there are issues where people target practice from bridges endangering cattle and other \nlivestock nearby.  The stakeholders believe all the interests are tied together.  The snags and debris are \ncoming from two different sources.  Storm damage to woody areas cause log and brush debris to get into \nthe streams.   Also, people toss household trash and old appliances from bridges into the streams and \ncreeks.  This debris causes large snags that retard the flow causing flooding.  Once the flood waters \nrecede the topsoil is washed away taking nutrients and chemicals with it.  This increases the potential of \nstarting head cuts and gullies while leaving debris in pastures and on cropland.  Therefore, the \nstakeholders think stopping the littering would help resolve many of the snag and debris issues in the \nstreams and creeks.  This would, in turn, help reduce the sediment and nutrients entering the streams.  \nLandowners are concerned that sediment and other contaminants will affect the water quality in the \nwatershed.  Beaver control has always been an issue, but recently the beaver dams have caused flooding \nof croplands.  Due to this flooding, some of the farmers will lose parts of some fields that they farm.  \nAlso, wild hogs have become a problem in areas around this watershed and the stakeholders think it is \nonly a matter of time before they are a nuisance here, too.  The hogs uproot the fields and forest land and \ncause devastation to crops.     \n   \n \n \n \n \n \n \n \n \n\n \n \n15 \nVII. Water Resources \n \nA. History of Activity in the Watershed \n \n The primary players in restoration and /or conservation efforts in the Tarebreeches Creek-\nTuscumbia River Canal Watershed are the Natural Resources Conservation Service, Alcorn County Soil \nand Water Conservation District and the Mississippi Soil and Water Conservation Commission.  Local \nlandowners and operators will play a major role in the restoration and conservation of the natural \nresources in this watershed by installing best management practices on their land.  There have been \nseveral programs that have been utilized by landowners in the watershed in past years.  These programs \ninclude the Environmental Quality Incentive Program (EQIP), Wildlife Habitat Incentives Program \n(WHIP), Conservation Reserve Program (CRP), Forestry Incentives Program (FIP), Emergency \nWatershed Program (EWP), Water Quality Incentive Program (WQIP), Hold Our Topsoil (HOT) and \nthe Agricultural Conservation Program (ACP).  These programs have helped many landowners apply \nconservation on the ground while reducing soil loss, enhancing wildlife habitat, enhancing water quality, \nincreasing water quantity, increasing tree production and promoting conservation education.    \n The Tarebreeches Creek-Tuscumbia River Canal Watershed was selected as a priority watershed \nby the Mississippi Department of Environmental Quality.  As the management agency for Agricultural \nNonpoint Source Pollution in Mississippi, the Mississippi Soil and Water Conservation Commission \n(MSWCC) determined that the Tarebreeches Creek-Tuscumbia River Canal Watershed would be a good \ncandidate for restoration.  After meetings with local landowners, Alcorn County Soil and Water \nConservation District (SWCD) commissioners and staff and Natural Resources Conservation Service \n(NRCS) employees that work in this area, MSWCC felt there was enough interest in the watershed that a \nmeasurable difference could be shown, and submitted a proposal to the Mississippi Department of \nEnvironmental Quality (MDEQ).  Through a collaborative effort between Alcorn County SWCD, \nNRCS, MDEQ and MSWCC, the team members for the Watershed Implementation Team were \nassembled.  At this point in time, there has been no process discussed to modify this team. \n  \n \n \n \n\n \n \n16 \nB. Wildlife and Fisheries \n \n There are important recreational species located throughout the watershed.  These species \ninclude deer, turkey, bass, catfish, bream, rabbits, squirrel, and raccoon.   The list of plants and animals \nof special concern are included as Appendix A.  There are no animals and plants that are threatened or \nendangered in this watershed. \n \n \nC. Designated Use Classifications and Water Quality                 \n     Standards \n \n The designated beneficial uses for the Tarebreeches Creek and Tuscumbia River Canal and the \nwaterbodies included in the watershed are aquatic life support and secondary contact.  The water use \nclassification for the listed segments of Tarebreeches Creek and Tuscumbia River Canal is fish and \nwildlife support according to the 2002 Water Quality Criteria for Intrastate, Interstate and Coastal \nWaters.  There are no numeric water quality standards for sediment applicable at this time.  The \nacceptable reference yields range for stable streams within HUC 08010207 established by EPA Region \nIV is .000757 to .00459 tons per acre per day at the effective discharge. It is expected that all values \nwithin this range will result in attainment of water quality standards.  It is estimated the typical range for \nunstable streams in HUC 08010207 is .00151 to .0761 tons per acre per day at the effective discharge.  \nThis range is representative of the load that would be expected from the Tarebreeches Creek-Tuscumbia \nRiver Canal Watershed.  The aquatic life use attainment threshold scores associated with the \nTarebreeches Creek-Tuscumbia River Canal Watershed is as follows: Tuscumbia River Canal- 63.86.  \nThe reference MBISQ score for the Bioregion is 82.27. \n \n \n \n \n \n \n \n \n\n \n \n17 \nTable 7.1 Water Quality Standards. \nParameter Beneficial Use Narrative Water Quality Standards \nSediment/ \nSiltation \nAquatic Life Support Waters shall be free from materials attributable to municipal, industrial, \nagricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions, in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to \naquatic life and wildlife, or adversely affect the palatability of fish, \naesthetic quality, or impair the waters for any designated uses. \n \n \nParameter Beneficial Use Narrative Water Quality Standards \nNutrients Aquatic Life Support Waters shall be free from materials attributable to municipal, industrial, \nagricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions, in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to \naquatic life and wildlife, or adversely affect the palatability of fish, \naesthetic quality, or impair the waters for any designated uses. \n \n \nParameter Beneficial Use Water Quality Standards \nDissolve Oxygen Aquatic Life Support DO concentrations shall be maintained at a daily average of not less than \n5.0mg/l with an instantaneous minimum of not less than 4.0mg/l.  \nNatural conditions are defined as background water quality conditions \ndue only to non-anthropogenic sources.  The criteria herein apply \nspecifically with regard to substances attributed to sources (discharges, \nnonpoint sources, or instream activities) as opposed to natural \nphenomena.  Waters may naturally have characteristics outside the limits \nestablished by these criteria.  Therefore, naturally occurring conditions \nthat fail to meet criteria should not be interpreted as violations of these \ncriteria. \n \nParameter Beneficial Use Water Quality Standards \nFecal Coliform Secondary Contact May - October: Fecal coliform colony counts are not to exceed a \ngeometric mean of 200 per 100ml based on a minimum of 5 samples \ntaken over a 30-day period with a minimum of 12 hours between \nindividual samples, nor shall the samples examined during a 30-day \nperiod exceed 400 per 100ml more than 10% of the time. \nNovember – April: Fecal coliform colony counts shall not exceed a \ngeometric mean of 2000 per 100 ml based on a minimum of 5 samples \ntaken over a 30-day period with no less than 12 hours between individual \nsamples, nor shall the samples examined during a 30-day period exceed \n4000 per 100 ml more than 10% of the time. \n \n \n \n \n \n\n \n \n18 \nD. Current Status of Water Bodies in the Watershed \n \n  Waterbodies in the Tarebreeches Creek-Tuscumbia River Canal watershed are included on \nMississippi’s 303(d) list of impaired waters and they are as follows: \nTuscumbia River Canal- listed for Sediment, Low DO/Organic Enrichment, and Nutrients. \n  \nE. TMDLs \n \nThe Tarebreeches Creek-Tuscumbia River Canal Watershed is located in Alcorn County, \nMississippi.   The watershed ID number is 0503, and the Hydrologic Unit Code (HUC) code for the \nwatershed is 08010207. This particular watershed is located in the Tuscumbia River Canal Watershed. \nThe streams in Tuscumbia River Canal Watershed are biologically impaired due to sediment/siltation, \nlow dissolved oxygen (DO)/ organic enrichment, and nutrients.   \nThere have been two TMDLs developed for Tuscumbia River Canal.  The first TMDL is for \nbiological impairment due to Sediment.  The second TMDL is for biological impairment due to \nNutrients and Low DO/Organic Enrichment.  \nThe recommended load reduction for sediment is a narrative criteria because at this time \nMississippi does not have numeric criteria for sediment.  Also, due to sediment data being unavailable \nand insufficient, the sediment range used for the TMDL were obtained from those values of unstable \nstreams in the level III ecoregion. This range is from .00151 to .0761 tons per acre per day at the \neffective discharge, therefore, a reduction in the sediment loading is recommended to bring those \nunstable streams back to yields that are acceptable for stable streams in the ecoregion.  The \nrecommended management actions to reduce the loading to the streams are stream bank and riparian \nbuffer zones restoration and any other sediment reduction BMPs, especially for the road crossings, \nagricultural activities, and construction activities. \nThe recommended load reduction from the nutrients, low DO and organic enrichment TMDL \nincludes a 77% reduction of phosphorous and an 8.7 % reduction Total Nitrogen (TN) from nonpoint \nsources.  The management actions for this load reduction include riparian buffer zone restoration and \nother nutrient reduction BMPs.  Implementation of these BMP activities should reduce nutrient loading \nto the streams that will result in attainment of applicable water quality standards. \n  \n\n \n \n19 \nVIII. WATERSHED MANAGEMENT  \nACTIONS \n \nAgricultural Best Management Practices \n \nA.  Sediment and Nutrient BMPs  \n \n1. Stakeholder Interests \n \n The major interests of the stakeholders are the sediment and nutrient loadings to Tarebreeches \nCreek and the Tuscumbia River Canal in the watershed.  These are the reasons these creeks are impaired \nand have TMDLs or are listed on Mississippi’s 303(d) List of Impaired Waters.  \n \n2. Goals/Objectives \n \n The goal and objective is to reduce the sediment and nutrient loading coming from agricultural \nlands and bring the creeks back from unstable stream levels to stable stream levels.  Doing this will help \nimplement the TMDLs for these creeks and may remove Tarebreeches from the 303 (d) list. \n \n3. Management Actions \n \n The management action that will be taken to address sediment and nutrient loading is the \ninstallation of agricultural BMPs that pertain to sediment and nutrients.  These BMPs include but are not \nlimited to:  \n Field Borders,  \n Grade Stabilization Structures,  \n Pasture and Hay Land Planting,  \n Nutrient Management, \n Water and Sediment Control Basins,  \n Fencing,  \n Stream Crossings, \n Heavy Use Area Protection, and  \n Tank/Troughs. \n \n\n \n \n20 \n  These BMPs will be installed by cooperating landowners in the watershed.  The program that \nthese BMPS will be installed under is the MSWCC cost-share program.  The Natural Resources \nConservation Service (NRCS) will provide the technical/planning assistance for this project.  Most of \nthe BMPs that will be installed are permanent structures and must be maintained by the landowner for a \nperiod of 10 years.  NRCS and Alcorn County Soil and Water District employees identified landowners \nin the watershed that had agricultural land using maps provided by the Mississippi Department of \nEnvironmental Quality.   \n \n \n \n4. Project Tracking/Assessment of Progress \n \n The Tarebreeches Creek-Tuscumbia River Canal 319 project began in 2011 and is scheduled to \nend September 2014.  The milestones for the Tarebreeches Creek-Tuscumbia River Canal Watershed \n319 project are listed below:  \n \n1. Assist Natural Resources Conservation Service (NRCS), United States Geological Survey \n(USGS), and the Alcorn County Soil and Water Conservation District (SWCD), with \nassistance from Mississippi Department of Environmental Quality (MDEQ), in the \ndevelopment of a Watershed Implementation Team (WIT).  \n \n2. Develop a Watershed Implementation Plan (WIP) consistent with MDEQ guidance and         \nassistance from the WIT. \n \n3. Assist in the development and implementation of a watershed monitoring plan for the project.    \n \n4. Present a draft WIP to MDEQ and the Tarebreeches Watershed Implementation Team for review and \ncomments. \n \n5. Determine through intensive surveys, priority areas that are contributing significant pollutant \nloads in the watershed. \n \n6. Inform the public, landowners, and other stakeholders within the project area about the project \nand secure commitments from priority landowners and others willing to participate in the \nproject.  \n \n7. Notify MDEQ project officer, in a timely manner, of all project visits/ inspections/ field days/ \nand any other public meetings so that the project officer may have an opportunity to attend. \n \n8. Develop plans for Best Management Practices (BMPs) in accordance with approved WIP.  \n \n\n \n \n21 \n9. Assist landowners and operators in the installation of appropriate BMPs and collect       \nbefore and after soil loss and GPS coordinates each installed  BMP and incorporate into a GIS \nformat.   \n \n10. Establish at least two (2) demonstration farms to inform the public about BMPs. \n \n11. Provide a least two (2) informational field days/tours to inform the public about the     \nbenefits of the project. \n \n12. Develop and distribute no fewer than 1,000 informational fact sheets highlighting the      \nbenefits derived from the project.  \n \n13. Publish no fewer than 4 articles about the project in newsletters and local newspapers. \n \n14.  Erect no fewer than 20 project roadside signs where water quality practices are installed     \nin the project.  \n \n15.  Document pre-existing site conditions and improvements by conducting before and after     \nphoto documentation. \n \n16. Assist the MDEQ project officer in conducting inspections during construction. \n \n17. Make project presentations as requested by MDEQ. \n \n18. Secure maintenance agreements from cooperators/landowners in accordance with      \nMSWCC state cost-share guidelines.  \n \n19. Submit bi-annual reports by every September 25\nth\n and March 25\nth\n of each year showing    \nstatus of tasks and start/completion dates of each task. \n \n20. Submit a final report to MDEQ.                                                        \n \n \n5. Desired Results/Benefits \n \n The desired benefit of this project will be the reduction of sediment and nutrient loading to levels \nthat are considered to be acceptable and remove the impaired segments of Tarebreeches Creek from the \n303 (d) list and will help implement the TMDLs for the subwatershed in the Tuscumbia River Canal \nwatershed. \n \n \n\n \n \n22 \n6. Roles/Responsibilities \n \n There are several different groups with responsibilities in this watershed.  MSWCC has the \nresponsibility and role of administering the 319 project.  The Alcorn County Soil and Water \nConservation District and the local NRCS staff have the role of technical assistance.  The landowners \nhave the responsibility of implementation of BMPs in the project area.  The Tarebreeches Creek \nWatershed Implementation Team has the role of helping gather all the information needed to write the \nWatershed Implementation Plan.  MSWCC also has the responsibility of compiling all the information \nand writing the initial plan for the watershed.  Other programs that are available to landowners in the \nwatershed include EQIP, CRP, and WHIP.  Under these three programs, there has been $194,897 spent \nover the last three years with another $190,000 projected to be spent over the next three years. \n \n7. Budget \n \nThe table below shows a list of potential Best Management Practices to be installed with the 319 \ngrant.   \n \nTable 8.1 Funded 319 Project Budget for BMPs. \nPractice Area Affected BMP Cost BMP Total \nField Borders 9 acres $250/ac $2,250 \nGrade Stabilization Structure 7 structures $6,500 ea $45,000 \nPasture and Hay Land Planting 175 acres $200/ac $35,000 \nWater and Sediment Control Basin 4 structures $10,000 ea $40,000 \nNutrient Management 2,000 acres $103.8/ac $206,167 \nTank/Trough 10 each $2,500 ea $25,000 \nStream Crossing 4 each $15,000 ea $60,000 \nHeavy Use Area Protection 6,250 sq feet $12/sq ft $75,000 \nFencing 2,500 feet $1.30/ft $3,250 \nTotal \n  \n$491,667 \n \n \nTable 8.2 Technical Assistance \nItem Cost \nTechnical Assistance $41,667 \nTotal $41,667 \n \n \n\n \n \n23 \nIX. EDUCATION/OUTREACH ACTIVITIES \n \nA. Educational Activities to be Implemented \n \n The overall objective of community education in the Tarebreeches Creek-Tuscumbia River \nCanal watershed is to develop an atmosphere that promotes sustained, long-term protection and \nimprovement of aquatic resources in the watershed. Specific objectives of education efforts in the \nwatershed include the following: \n \n Increase public awareness of the value of clean water. \n Increase public awareness of agricultural runoff and encourage behaviors that will reduce \nlevels of sediments and nutrients in the watershed by education, watershed \ncharacterization and stewardship opportunities. \n Increase public awareness of how BMPs can be used to reduce negative water quality and \nhabitat effects. \n Increase public awareness of the long term environmental and economic advantages of \nprotecting and improving water quality and habitat in the Tarebreeches Creek-Tuscumbia \nRiver Canal watershed. \n \n \n 1. Signage \nSigns identifying the BMPs that have been installed will be erected throughout the \nwatershed upon permission of landowners. \n   \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, Alcorn County Soil and Water Conservation District, Natural Resources \nConservation  Service, and Environmental Protection Agency. \n \n \n \n \n \n\n \n \n24 \n a. Indicators   \n  There will be field days held to show other landowners and the interested public the \nBMPs installed.  Participants will be counted at these field days.  Traffic through the watershed \ncannot be documented, but some areas are along a heavily traveled  state highway.  \n \n b. Schedule \n  The BMP signs will be erected as practices are completed and/or requested by the \nlandowners throughout the life of the project. \n \n c. Budget  \n Table 9.1 Projected Costs for Signage. \nItem Unit Cost Total Cost \nSigns 20 $100.00 $2,000.00 \nTotal   $2,000.00 \n \n2. Landowner Meeting and Field Days \n There will be a landowner meeting held to inform landowners in the watershed about the project \nand what BMPs will be available for implementation on their land.  Also, there will be at least two \nfield days held to highlight the BMPs that have been installed during the project period.  This will \nallow other landowners and the interested public to view some of the practices that are being \ninstalled to benefit water quality in the watershed. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, Alcorn County Soil and Water Conservation District, Natural \nResources Conservation Service, and Environmental Protection Agency \n \n a. Indicators \n  Attendance at the landowner meeting and the field days will be documented and reported \nto MDEQ.  The number of individuals who install BMPs as a result of the field days will also be \ndocumented. \n\n \n \n25 \n b. Schedule \n  Field days in the watershed will take place in 2012-2014. \n  \nc. Budget \n Table 9.2 Projected Costs for Landowner Meeting and Field Days. \nItem Units Cost Total Cost \nEvent Flyers 300 .60/each $180.00 \nMailing/Delivery 300 .45/each $135.00 \nMiscellaneous (Landowner \nmeeting, field days, supplies) \n3 $1,920.67/each $5,762.01 \nTotal   $6,077.01 \n  \n \n3. Fact Sheets \n  A fact sheet will be developed at the end of the project.  This fact sheet will contain \ninformation about the watershed, the number and type of BMPs that were installed, the number of \ntons of soil being saved, and the number of acres impacted by the BMPs. \n \n Primary Partners- Mississippi Soil and Water Conservation Commission, Alcorn County Soil \nand Water Conservation District, and Natural Resources Conservation Service. \n \n a. Indicators \n  1,000 fact sheets will be designed and distributed.  These fact sheets will be handed out at \nthe final field day and will also be available in the district offices.   \n \n b. Schedule \n  The fact sheet will be developed once all BMPs are in place to get a total tons of soil \nsaved and the correct number of BMPs installed. \n \n \n\n \n \n26 \n c. Budget \n Table 9.3 Projected Costs for Fact Sheets. \nItem Unit Cost Total Cost \nPrinting 1,000 1.00/each $1,000.00 \nTotal   $1,000.00 \n \n \n \n4. Watershed Harmony Puppet Show \n Watershed Harmony is a musical puppet performance aligning with the fourth and fifth grade \nMississippi Framework and National Science Standards.  Audiences of all ages will delight in \nenvironmental stewardship through this toe tapping musical.  Performances are not only enjoyed by \nschool groups, but also by adults attending teacher workshops, civic clubs, and conferences.  This \nprogram serves to inform, excite, and enlist the help of citizens in an ongoing effort to promote \nwater quality in their communities. \n \n Primary Partners- Mississippi Department of Environmental Quality and Bayou Town \nProductions. \n \n a. Indicators \n The number of participants will be documented and submitted to MDEQ.   \n \n b. Schedule \n  Watershed Harmony will be presented before August 2014. \n \n c. Budget \n Table 9.4 Projected Costs for Watershed Harmony Puppet Show \nItem Unit Cost Total Cost \nWatershed Harmony Puppet Show 1 show $1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n \n\n \n \n27 \n5. Alcorn County Fair \n A booth will be set up at the fair with information about the project with pictures of BMPs within \nthe watershed and other educational materials about nonpoint source pollution and the Tarebreeches \n319 project.  A coloring contest will be held during the fair for 2 age groups, 0-5 years old and 6-8 \nyears old.  During the 2 days the booth is set up, there will be awards given every hour to the \ncoloring contest winners.  Also, Sam E Soil will be making special appearances throughout the time \nthe booth is set up. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality,  and Alcorn County Soil and Water Conservation District. \n \n a. Indicators \n  The number of brochures that are handed out to adults while the children are participating \nin the coloring contest will be documented.  The number of children who participate in the coloring \ncontest will be documented and the number of coloring books about Sam E Soil given out will be \ndocumented. \n \nb. Schedule \n  The exhibit will be at the fair for 3 consecutive years. \n  \nc. Budget \n Table 9.5 Projected Costs for Fair Exhibit. \nItem Units Cost Total Cost \nBrochures 3,000 .65/each $1,950.00 \nColoring Books 6,000 .38/each $2,280.00 \nLitter Bags 2,500 .42/each $1,050.00 \nGift Cards 48 $20.00/each $960.00 \nTotal   $6,240.00 \n \n \n \n \n\n \n \n28 \n6. Water Bill Mailers \n A flyer will be designed and mailed out to the homes in the Tarebreeches watershed.  This flyer \nwill inform them of ways they can help improve water quality in the watershed.  This will be mailed \nout with their monthly water bill. \n \n Primary partners- Mississippi Soil and Water Conservation Commission, Mississippi \nDepartment of Environmental Quality, and Alcorn County Soil and Water Conservation District. \n \na. Indicators \nThe number of flyers sent out will be documented. \n \nb. Schedule \nThis flyers will be mailed before August 2014. \n \nc. Budget \nTable 9.6 Projected Costs for Water Bill Mailers. \nItem Units Cost Total Cost \nMailing 500 .44/each $225.00 \nEnvelopes 500 .10/each $50.00 \nFlyer 500 .65/each $325.00 \nTotal   $600.00 \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n29 \n7. Presentations \n Presentations relating to water quality will be made to civic organizations.  These presentations \nwill inform individuals about how they can improve water quality and reduce nonpoint source \npollution. \n \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, and Alcorn County Soil and Water Conservation District. \na. Indicators \nThe number of people in attendance will be documented. \n \nb. Schedule \nThese presentations will be made before August 2014. \nc. Budget \nTable 9.7 Projected Budget for Presentations. \nItem Units Cost Total Cost \nMiscellaneous 3 $50.00/each $150.00 \nTotal   $150.00 \n \n8. Radio Advertisements \n \n Radio advertisements will be run on the local radio station to inform people about water quality \nand nonpoint source pollution.  Each spot will run 5 times a days for 2 weeks. \n \nPrimary partners- Mississippi Soil and Water Conservation Commission, Mississippi Department of \nEnvironmental Quality, and Alcorn County Soil and Water Conservation District. \n \na. Indicators \nThe number of radio ads run and produced will be recorded. \n \nb. Schedule \nThe ads will run before August 2014. \n\n \n \n30 \nc. Budget \nTable 9.8 Projected Costs for Radio Advertisements. \nItem \nUnits \nCost Total Cost \nAds 3 $200.00/each $600.00 \nTotal   $600.00 \n \n 9. Adopt-A-Stream \n Adopt-A-Stream is a program that promotes environmental stewardship through training \nworkshops, outdoor field activities, and by introducing participants to watershed action projects.  \nOne and two-day workshops inform participants about watershed topics such as stream health, \nstream ecology, aquatic life and water chemistry.  \n \n Primary Partners- Mississippi Department of Environmental Quality and Mississippi Wildlife \nFederation. \n a. Indicators \n  The number of participants and the number of participants that carry on the adoption \nactivities will be documented. \n \n b. Schedule \n  At least one event will take place before September 30, 2014.     \n \n c. Budget \n Table 9.9 Projected Costs for Adopt-A-Stream Workshop. \nItem Unit Cost Total \nCost \nAdopt A Stream \nWorkshop \n1 day workshop $1,000.00 $1,000.00 \nTotal   $1,000.00 \n \n  \n \n \n\n \n \n31 \n10. Total Projected Cost of Education/Outreach Activities \n Table 9.10 Total Projected Education Budget  \nItem Unit Cost Total Cost \nSignage 20 $100.00 $2,000.00 \nLandowner Meeting and Field Days 3 $2,025.67 $6,077.01 \nFact Sheets 1,000 $1.00 $1,000.00 \nWatershed Harmony Puppet Show 1 $1000.00 $1,000.00 \nAlcorn County Fair 3 $2,080.00 $6,240.00 \nWater Bill Mailers 1 $600.00 $600.00 \nPresentations 3 $50.00 $150.00 \nRadio Ads 3 $200.00 $600.00 \nAdopt-A-Stream 1 $1,000.00 $1,000.00 \nTotal \n  \n$18,667.01 \n \n \n11. Total Budget for Tarebreeches Creek-Tuscumbia River Canal Watershed  \n Implementation Plan \n \n Table 9.11 Tarebreeches Creek-Tuscumbia River Canal Watershed Implementation Plan Total Budget \nItem Cost \nBMPs $491,667 \nTechnical Assistance $41,667 \nEducation/Outreach $18,667.01 \nTotal $552,001.01 \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n32 \nX. EVALUATION \n \nA. Plan Evaluation Procedure \n \n This watershed implementation plan will be evaluated and revised every three to five years or on \nan as needed basis.  The evaluation of this plan will be organized by the Tarebreeches Creek-\nTuscumbia River Canal Watershed Implementation Team.  At that time, the WIT will develop a \ndetailed schedule for review and revision of this watershed implementation plan. The WIT members \nwill be responsible for notifying their stakeholders of the opportunity to propose changes to the \nwatershed implementation plan. One month will be allowed for notification of stakeholders. \n The plan will be evaluated by the team, or their designee, and any interested stakeholders. One \nmonth will be allowed for evaluation and submittal of comments. Therefore, comments will be due \ntwo months after the evaluation procedure is initiated. The plan will be evaluated in two ways. First, \nto determine if the plan goals have been achieved, and second, to determine if it reflects the current \ncondition of the watershed, state of science, and issues in the watershed. \n \nB. Implementation Evaluation Strategy \n \n1. The following measures and indicators of progress will be utilized to track the              \nsuccess of this plan by MSWCC:  \n Before and after photo documentation on a representative sample of the BMPs                    \n      installed, \n    Before and after soil loss collection on each BMP installed, and \n  An R5 Load estimation Model Field Data Entry Sheet completed on each BMP  \n       installed, \n Establishment of two demonstration farms that will be used to inform the public  \n      about best management practice systems, and \n Informational fact sheets will be distributed that highlight the benefits derived  \n      through the installation of Best Management Practices. \n \n 2.  MDEQ will be responsible for any monitoring at the conclusion of the project to \ndetermine the pollutant reductions achieved by the application of Best Management Practices in the \nwatershed.   \n\n \n \n33 \nXI. PLAN REVISION \n \nA. Plan Revision Procedure \n \n  After evaluation, MDEQ will prepare a revised watershed implementation plan incorporating \nthe changes requested by the reviewers. At this point it may be necessary to call a meeting to \nreconcile any conflicting comments or requests for change.  \n If the evaluation criteria are all being met in Tarebreeches Creek-Tuscumbia River Canal surface \nwaters, the watershed implementation plan will be revised to address a different restoration issue or \nissues, or to protect the water quality of the watershed. If the evaluation criteria for the watershed are \nnot being met, the approach for restoring Tarebreeches Creek-Tuscumbia River Canal watershed \nwill be revised based on the knowledge that has been gained since 2011.  \n The draft watershed implementation plan will be submitted to the Implementation Team, and all \nothers who submitted comments. Within two weeks of receiving the draft watershed implementation \nplan, the Implementation Team will notify their stakeholders of the availability of the revised \nwatershed implementation plan for stakeholder review. One month will be allowed for review of the \ndraft. Comments will be due at the end of this review period. \n Within a month after the comments on the draft watershed implementation plan are received, the \nDRAFT watershed implementation plan will be submitted to the Implementation Team for review \nand approval. After the DRAFT watershed implementation plan has been approved, the \nImplementation Team will notify their stakeholders of the completion and availability of the plan for \nuse as a guide to watershed restoration and protection activities. \n \n \n \n \n \n \n \n\n \n \n34 \nXII. RESOURCES \n \nMDEQ. 2005. Total Maximum Daily Load Tuscumbia River Canal Watershed for Biological \nImpairment Due to Sediment. Mississippi Department of Environmental Quality. Jackson, \nMississippi. \n \nMDEQ 2009.  Total Maximum Daily Load Nutrients and Organic Enrichment/Low DO for Bridge \nand Elam Creek and Tuscumbia river Canal, Mississippi Department of Environmental Quality. \nJackson, Mississippi. \n \nMDEQ 2000.  Fecal Coliform TMDL For Tuscumbia River Canal North Independent Basin, Alcorn \nand Prentiss Counties, Mississippi, Mississippi Department of Environmental Quality. Jackson, \nMississippi \n \n\"Natural Heritage Inventory: Search Animal Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_animals.asp> \n \n\"Natural Heritage Inventory: Search Plant Database.\" Mississippi Museum of Natural Science.  \n<http://www.mdwfp.com/museum/html/Research/query_plants.asp> \n  \nUSDA. SCS. 1971. Soil Survey of Alcorn County, Mississippi. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n35 \n \n \n \n \nAppendix A \n \n \n \nPlant and Animal Species of Special \nConcern \n \n \n \n \n \n\n \n \n36 \n \nAnimals of Special Concern in Alcorn County \nScientific Name Common Name \nAINOPHILA AESTIVALIS BACHMAN’S SPARROW \nCYPRINELLA WHIPPLEI STEELCOLOR SHINER \nETHEOSTOMA ZONISTIUM BANDFIN DARTER \nPLEUROBEMA BEADLEIANUM MISSISSIPPI PIGTOE \nPROCAMBARUS ABLUSUS A CRAYFISH \nPSEUDOTRITON RUBER RED SALAMANDER \nZAPUS HUDSONIUS MEADOW JUMPING MOUSE \n \n \n \n \n \n \nPlant Species of Special Concern in Alcorn County \nScientific Name Common Name \nCHELONE GLABRA WHITE TURTLEHEAD \nPLATANTHERA INTEGRILABIA WHITE FRINGELESS ORCHID \nPLATANTHERA PERAMOENA PURPLE FRINGELESS ORCHID \nSALVIA URTICIFOLIA NETTLE-LEAF SAGE \nSILENE OVATA OVATE CATCHFLY \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n \n \n37 \n \n \n \n \n \n \n \n \n \n \n \nAppendix B \n \n \n \nFunded 319 Project Proposal \n \n \n \n \n \n \n \n\n \n \n38 \n \n \nPROJECT TITLE: \nTarebreeches Creek-Tuscumbia River Canal Watershed Nonpoint Source Pollution Project \n \nPROJECT ABSTRACT: \nThis project will be located in the north central portion of Alcorn County in Mississippi. \nThe objectives of this project will be: \n \nTo improve water quality and protect high quality waters through the implementation of selected \nBMPs in targeted areas. \n \nTo apply Best Management Practices (BMPs) to agricultural lands in the project area so as to \nreach the desired outcome of reduced nutrient loads entering streams in the watershed. \n \nTo inform and educate the public about Best Management Practices that benefit water quality. \n \nThe project cost is $550,001.  Of this amount, $330,000 in 319 funds are requested with the balance of \n$220,001 to be supplied as match. \n \nLEAD ORGANIZATION: \n \nMississippi Soil and Water Conservation Commission \nMark Gilbert, Project Manager \nP.O. Box 23005 \nJackson, MS  39225-3005 \n \nPhone: (601) 354-7645 \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us  \n \nCOOPERATING AGENCIES AND ORGANIZATIONS: \n \nAlcorn County Soil and Water Conservation District; USDA Natural Resources Conservation Service; \nMississippi Department of Environmental Quality \n \n\n \n \n39 \nGRANT ADMINISTRATOR: \n \nMark E. Gilbert, Environmental Administrator \nMS Soil & Water Conservation Commission \nP.O. Box 23005 \nJackson, MS   39225-3005 \n \nPhone: (601) 354-7645 \n (601) 540-4210  (cell) \nFax: (601) 354-6628 \ne-mail: mgilbert@mswcc.state.ms.us \n \nPROJECT LOCATION: \n \nTarebreeches Creek-Tuscumbia River Canal Watershed (08010207-0503) \n(see attachment 1 for maps depicting the location and land use for the watershed) \n \nPROJECT OBJECTIVE: \n \nThe water quality impairment to be addressed by this project is nutrient loading.  Subsequent biological \nmonitoring has concluded the streams are impaired due to biological impairment.  The stressor \nidentification process pointed to organic enrichment and nutrient enrichment as probable primary \nstressors.  The Mississippi Department of Environmental Quality (MDEQ) has placed segment \nMS203TE, MS203BE, and MS204E of Tuscumbia River Canal, Bridge Creek, and Elam Creek, \nrespectively, on the 2008 Section 303(d) List of Waterbodies as monitored water body segments, due to \nnutrients and organic enrichment/low DO. The State’s 2008 303(d) list of monitored water bodies lists \nthe designated use of Tuscumbia River Canal as fish and wildlife support.   MDEQ has developed a \nTMDL for the listed segment of Tuscumbia River Canal. The TMDL model indicates violation of the \npreliminary target numbers allowable to meet standards for its designated use.  The existing condition \nload was based on a special study conducted in 2006 in and around Corinth and resulted in findings of \nan overall 77% reduction in nonpoint phosphorous loads and an 8.7% reduction in TN from nonpoint \nsources.  (a copy of the TMDL is attached)   \nAnother objective of this project will be to reduce soil loss on pasture land in the watershed.  BMPs \nlisted on the following page will not only reduce nutrients and pathogens but will also reduce the \namount of sediment entering Tuscumbia River Canal from pasture land in the watershed. \n \nPROJECT DESCRIPTION: \n \nThis project will implement selected Best Management Practices (BMPs) on targeted areas in the \nTuscumbia River Canal Watershed that will result in reduced pollutant loadings from agricultural \nnonpoint sources. The targeted area within this watershed will be the Tarebreeches Creek Watershed.  \nThe main water quality problem to be addressed by this project is nutrients from agricultural nonpoint \nsources.  Of primary concern are animal waste runoff and the animal access to streams from cattle \noperations in the watershed. Also, soils in the watershed are very erosive, with sheet and gully erosion \noccurring on sloping hay land and pastureland. Erosion is occurring from pasture and hay land in the \nproject area at the rate of 8-10 tons per acre per year.  Nutrients and pathogens from animal waste as \n\n \n \n40 \nwell as sediment contained in runoff are entering the Tuscumbia River Canal and its tributaries causing \ndegradation of the resource base.    \nThe erosion of the soil resource base removes nutrients, reduces water holding capacity, undermines \nplant rooting systems, reduces the soil’s organic matter content, reduces soil tilth and degrades water \nquality within the project area.   \nThe Tuscumbia River Canal Watershed is approximately 204,311 acres.  The watershed is \npredominately rural. The current land uses in the Tuscumbia River Canal Watershed include 31,795 \nacres of cropland, 33,293 acres of pasture land, 72,214 acres of timber land, 18,380 acres of urban land, \n22,143 aces of barren land, 23,156 acres of wetlands and 3,330 acres of water.  This project will target \nthe Tarebreeches Creek-Tuscumbia River Canal Watershed which is approximately 16,721 acres.  \nWithin this watershed, the project will be implemented on an area of about 9,240 acres that contains \nabout 2,000 acres of pasture land. \n  \nThis project will be implemented in three phases.  Phase 1 will consist of analyzing existing \nassessment data, determining target areas within the watershed where the stressors are causing the \ngreatest damage and if the application of needed Best Management Practices will yield a beneficial \nreduction in pollutant loadings.  Education and outreach activities will also be conducted during this \nphase to inform landowners in the watershed about the objectives of the project. The Mississippi Soil \nand Water Conservation Commission (MSWCC) will cooperate with the Alcorn County Soil and Water \nConservation Districts in identifying the appropriate Best Management Practices for targeted areas in the \nwatershed and educating landowners as to the need for their participation. \n \nPhase 2 will consist of (based upon the finding of phase 1) the application of best management practices \non targeted areas in the watershed that will result in desired pollutant load reductions.  The Mississippi \nSoil and Water Conservation Commission will accomplish this through its water quality cost share \nprogram. In this project, records will be kept at both the state level and local level so as to determine the \nprogress being made in carrying the project out and the benefits that are being received as related to the \nimprovement of water quality within the project.  During the planning process with participants, the \namount of soil loss from the area to be treated with a particular BMP will be determined and recorded.  \nThe amount of soil saved as a result of applying the BMP will also be determined and recorded.  \nAdditional information will be collected on each BMP installed in the project that will be provided to \nMDEQ and used to calculate the pollutant load reduction for each BMP installed.  This information will \nindicate the project effectiveness in reducing pollutant loadings.  Participants in the project will be \nrequired to maintain BMPs for a period of up to ten years after installation. \n \nAdditional education and outreach efforts will be conducting during this phase to inform and educate the \npublic about Best Management Practices that benefit water quality.  This will be accomplished by the \nfollowing: \nEstablish at least 2 demonstration farms to inform the public about best management systems. \nConduct at least 2 field day/tours during the life of the project. \nPrepare and distribute at least 1,000 fact sheets highlighting the benefits derived from the project. \nPublish at least 4 articles about the project in newsletters and local newspapers. \nErect at least 20 project roadside signs that designate where water quality practices are in progress or \nhave been completed. \n \n\n \n \n41 \nTo address the above stated water quality problems, Best Management Practices (BMPs) will be \ninstalled on agricultural lands in the project area.  Potential BMPs to be installed include but are not \nlimited to: \n9 acres of field borders \n7 grade stabilization structures \n175 acres of pasture & hay land planting \n4 water and sediment control basins \n2,000 acres of nutrient management \n10 watering troughs or tanks \n4 stream crossings \n6,250 square feet of heavy use area protection \n2,500 feet of fencing \n \n \nPhase 3 will consist of post BMP monitoring to determine the pollutant load reductions achieved by the \napplication of Best Management Practices.  The MSWCC will coordinate with the MDEQ in conducting \nthese activities. \n \n  \n\n \n \n42 \nMILESTONES: \n \n1. Sign grant contract with MS Department of Environmental Quality. (Month 0) \n2. Determine priority areas that are contributing significant loads in the watershed.  (Month 1) \n3. Issue policies and procedures for implementing the project to the SWCD office. (Month 1) \n4. Meet with the board of SWCD commissioners to get their understanding of their responsibilities \nand participation. (Month 2) \n5. Provide training to district staff. (Month 2-3) \n6. Assist in establishing an evaluation system in conjunction with the MS Department of \nEnvironmental Quality to indicate the benefits of the project. (Month 2-3) \n7. Conduct a landowner meeting to inform potential participants about the project.     (Month 3) \n8. Secure commitments from several landowners and operators who are willing to participate in the \nproject. (Month 3-4) \n9. Assist participants in developing a conservation plan and applying best management practices \n(Month 4-12) \n10. Establish at least demonstration farm (Month 4-12) \n11. Document pre-existing site conditions. (Month 2-12) (Before and after photo documentation will \nbe conducted). \n12. Accelerate conservation planning and application assistance.  Special effort will be made to \ncomplete conservation plans during this time frame. (Month 13-24) \n13. Conduct at least 1 informational field day/tour to inform the public about the project . (Month \n13-24) \n14. Establish at least 1 demonstration farm. (Month 13-24) \n15. As requested, assist DEQ with evaluations. (Month 0-36) \n16. Collect GPS coordinates and other data required by MDEQ on all BMPs installed in the project. \n(Month 0-36) \n17. Assemble data on the amount of soil saved. (Month 0-36) \n18. Erect project roadside signs which designate where water quality practices are in progress or \nhave been completed. (Month 4-36) \n19. Provide continued conservation planning and application assistance to participants. (Month 25-\n36) \n20. Review the status of applying best management practices to reach the objectives of the project.  \n(Month 25) \n21. Based upon the needs and finding of milestone 18, assistance in planning and/or application will \nbe redirected and/or accelerated. (Month 25-36) \n22. Publish at least 4 articles about the project. (Month 0-36) \n23. Publicity of the project will be increased; at least 1 field day/tour will be conducted and at least \n1,000 fact sheets will be developed and distributed. (Month 25-36) \n24. Bi-annual reports will be made to MSDEQ. (Month 0-36) \n25. Make Final report to MSDEQ. (Month 36) \n  \n\n \n \n43 \nCRITERIA FOR EVALUATION \n(also see Phase 1 and 3 information under Project Description) \nThe following measures and indicators of progress will be utilized to track the success of this project: \n \nNPS Pollutant Load Reduction – the amount of soil saved as a result of the installation of best \nmanagement practices (BMPs) in this project will be a direct indicator of sediment load reduction to \nTuscumbia River Canal along with its tributaries.  Since nutrients and animal waste are transported to \nthe waters by over land flow along with sediment, any reduction in sediment loadings will result in a \nreduction of nutrient loadings thereby enhancing the effectiveness and success of the project.  Other data \ncollected for MDEQ will be used to calculate pollutant load reductions for each BMP installed in the \nproject. \n \nImplementation of NPS Controls – this project will involve the installation of Best Management \nSystems.  Best Management Systems are defined as a combination of BMPs, both structural and \nvegetative, which are the most practical, effective and economical means of preventing or reducing \npollution from nonpoint sources to a level compatible with water quality goals.  The estimated types \nand numbers of BMPs to be installed as part of  Best Management Systems are listed in the \nproject description of this proposal.  The application of best management systems in the project will \nbe the responsibility of the landowners and operators participating in the project as cooperators of the \nlocal soil and water conservation district. \n \nPublic Education, Awareness, and Action - this project will include the establishment of at least 2 \ndemonstration farms that will be used to inform the public about best management systems.  These will \nbe utilized during the 2 field day/tours that will be conducted in the project.  Also, at least 1,000 \ninformational fact sheets highlighting the benefits derived from the project will be developed and \ndistributed as well as the publishing of at least 4 articles about the project in newsletters and local \nnewspapers.  At least 20 project roadside sign will be erected where water quality practices are installed \nin the project.    Other educational actions will be conducted to measure the success of the project.  \nThese include such things as increased public awareness; before and after photo documentation; \nincreased cooperation among agencies, associations, public bodies and educational institutions; and the \neconomic benefits of applying best management practices.  The Mississippi Soil and Water \nConservation Commission will request information through the local soil and water conservation district \nthat will assist in measuring the success of the project in the demonstration area. \n \nMONITORING \n \nAt a selected site or sites on the main tributaries of the watershed, water samples will be taken and \nanalyzed for organic enrichment/low dissolved oxygen and nutrient content.  After BMPs are installed at \nthe site or sites, additional samples will be taken and analyzed to determine the actual load reduction \nresulting from the implementation of the BMPs.  A plan for the monitoring will be developed by the \nUSGS to determine the exact procedures and details of the monitoring regime.  Funding for this portion \nof the project is included in the project budget. \n \n \nPROJECT PERIOD \n \nThe length of this project will be 3 years. \n\n \n \n44 \nPROJECT BUDGET \n \nBUDGET   FEDERAL  NON-FEDERAL  TOTAL \nCATEGORY   FUNDS  FUNDS \n \nTechnical Assistance/  $ 25,000  $  16,667 *   $  41,667 \nTravel \n \nInstallation of BMPs  $ 195,000  $ 130,000 **   $ 325,000 \n \nContractual   $100,000  $  66,667  **   $ 166,667 \n \nInformation/Education $  10,000  $   6,667 *     $   16,667___ \n \nTOTAL   $ 330,000  $ 220,001   $ 550,001  \n \n*   Non-federal match for technical assistance/travel and information/education will be provided the \nlocal soil and water conservation district commissioners, soil and water conservation district staff and \nMississippi Soil and Water Conservation Commission staff time spent on the project. \n \n** Non-federal match for installation of BMPs and contractual will be provided by out of pocket \nexpenses of the landowners and operators participating in the project. \n\n \n \n45 \nAttachment 1 \n \n \n\n \n \n46 \n \n \n\n \n \n47 \n \n\n \n \n48 \n \n\n \n \n49 \n \n \n \n \n \n \n \nAppendix C \n \n \n \nStressors \n \n\n \n \n50 \nTable 2 \nStressor Summary Table \n \nConcern Link/Immediate \nCause \nStressor Description of \nStressor \nLocation/Extent \nSediment Loading \nFrom Agricultural \nLands \nLanduse runoff and \n in-channel sediment processes \nSediment A TMDL was completed for Tuscumbia \nRiver Canal Watershed.  This analysis \nidentified sediment as one of the \nprobable stressor of the waterbody.  \nCertain contaminants may be associated \nwith sediment such as pesticides and \nnutrients.  However, these contaminants \nwould also be controlled using the same \nbest management practices (BMPs) that \ncontrol sediment coming from fields.  \nTarebreeches Creek subwatershed is \nlocated in the Tuscumbia River Canal \nWatershed.  \nSee figure 5.2 for the locations of \nagricultural lands along streams. \nThere are approximately 16,271 \nacres in the watershed.  There is \n2,000 acres of pastureland located \nwithin.  All the lands referred to \nabove are in HUC 08010207-\n0503. \n  \n \n \n \n \n \n \n \n\n \n \n51 \nConcern Link/Immediate \nCause \nStressor Description of \nStressor \nLocation/Extent \nNutrient Loading \nFrom Agricultural \nLands \nDegradation of in-stream \nbiological conditions \nNutrients A TMDL was completed for Tuscumbia \nRiver Canal Watershed.  This analysis \nidentified nutrients and organic \nenrichment as a probable stressor of the \nwaterbody.  Certain contaminants may \nbe associated with nutrients such as \npesticides and sediment.  However, \nthese contaminants would also be \ncontrolled by some of the same best \nmanagement practices (BMPs) that \ncontrol nutrients coming from fields. \nSee figure 5.2 for the locations of \nagricultural lands along streams. \nThere are approximately 16,271 \nacres in the watershed.  There is \n2,000 acres of pastureland located \nwithin.  All the lands referred to \nabove are in HUC 08010207-\n0503. \n \n \nConcern Link/Immediate \nCause \nStressor Description of \nStressor \nLocation/Extent \nLittering Increasing the number of snags \nand the amount of debris in the \ncreeks and streams \nLitter People dumping old appliances, \nhousehold trash, old mattresses and \nother garbage into the creeks and \nstreams from bridges and letting it wash \ndown the creeks and streams when the \nflow is increased. \nThis occurs throughout the \nwatershed at most bridge sites in \nrural areas. \n\n \n \n52 \n \n \n \n \nAppendix D \n \n \n \n \n \n \n \n \n \nChecklist of Watershed \nImplementation Elements \n\n \n53 \n \nTable D. 9 Key Elements of a Watershed Plan for 319 Grant  \n \nRequired WIP Elements for 319 Grant \n \nLocation in Watershed Implementation Plan \n \n1. Watershed Description and Background \n \nChapter V, Chapter VII Section A \n \n2.  Implementation \n \nChapter VIII Section A Subsection 3 \n \n3. Project Goals \n \nChapter VIII Section A Subsections 2 and 5 \n \n4. Project Costs \nChapter VIII Section A Subsection 7 \nChapter IX Section A Subsection 7, 8 \n \n5. Education and Outreach \n \nChapter IX \n \n6. Implementation Schedule \n \nChapter VIII Section A Subsection 4 \n \n7. Milestones \n \nChapter VIII Section A Subsection 4 \n \n8. Adaptations and Revisions \n \nChapter X Section A, Chapter XI Section A \n \n9. Monitoring \n \nChapter X Section B Subsections 1 and 2 \n ",
  "metadata": {
    "id": "tarebreeches-creek-tuscumbia-river-canal-watersehd-plan",
    "originalName": "Tarebreeches_Creek_Tuscumbia_River_Canal_Watersehd_Plan_2012.pdf",
    "mergedFrom": [
      "tarebreeches-creek-tuscumbia-river-canal-watersehd-plan-2012.json"
    ],
    "pageCount": 53,
    "mergedAt": "2025-10-02T06:41:26.794Z",
    "length": 64503
  }
}