{
  "id": "tchoutacabouffa-river-watershed-action-plan-2007",
  "rawText": "\n\n \n \nBuilding a Partnership for the  \nTchoutacabouffa River Watershed \n \n \n \n \n \n \n \n \n \n \n \n2007 Action Plan \n \n \nHarrison County and West Jackson County, Mississippi \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 2\n of 22 \n \nAction plan sponsored by the Land Trust for the Mississippi Coastal Plain  \n \n \n \n \n \n \n \n \n \n \n \n \n \nFunding assistance from EPA, Region IV  Technical Assistance from MDEQ \nPascagoula River Basin Team\n \n \n \n  \n \n \n \n \n \n \n \n \n \nPrepared by Eco-Logic Restoration Services, LLC \n \nwww.ecologic-restoration.com\n \n \n \n \n \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 3\n of 22 \nSubmitted to Land Trust for Mississippi Coastal Plain \nSpring 2007 \n \n \nBuilding a Partnership for the  \nTchoutacabouffa River Watershed \n2007 Action Plan \n \nTable of Contents \n \n \nI. Background................................................................................................................Page 4 \n \nII. Purpose.......................................................................................................................Page 5 \n \nIII. Introduction................................................................................................................Page 6 \n \nIV. Tchoutacabouffa River Watershed Teams ..............................................................Page 7 \na. Steering committee \nb. Technical advisory team \nc. Education and recreation team  \n \nV. Description:  Tchoutacabouffa River Watershed and Project Area......................Page 8 \na. Map:  Tchoutacabouffa River Watershed  \nb. Map:  Tchoutacabouffa River – Targeted Area for Action Plan \n \nVI. Stakeholder interests:  results from roundtable discussions .............................Page 10 \n \nVII. Proposed Watershed Action Plan ..........................................................................Page 13 \n \nVIII. Evaluation of progress and plan revision..............................................................Page 16 \n \nIX. Resources................................................................................................................Page 16 \n \nX. Appendix:  Natural Heritage Data, Harrison County.............................................Page 18 \na. Plants, Harrison County \nb. Animals, Harrison County \n \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 4\n of 22 \n \nBACKGROUND \n \nBefore Hurricane Katrina, the Land Trust for the Mississippi Coastal Plain (Land Trust) was \nawarded a grant from EPA Region IV to build watershed partnerships in six watersheds in \nsouth Mississippi.  Criteria for selecting watershed partnership areas included: (1) \nwatersheds that represented south Mississippi both geographically and ecologically; (2) \nwatersheds where the Land Trust owned and managed lands; and (3) watersheds where \nthere was a demonstrated need for restoration and protection.  The six watersheds that \nwere chosen included Turkey Creek in Harrison County, Red Creek (stream sections flowing \nthrough Stone County), Old Fort Bayou in Jackson County, West Hobolochitto Creek in Pearl \nRiver County, Tchoutacabouffa River (stream sections flowing through Harrison County) and \nUpper Bay of St. Louis (identified streams in Hancock County). \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nOne of the goals of the watershed partnership was to develop and implement a solution-\noriented, action plan.  We have two primary objectives:  (1) Research, identify and \nimplement watershed protection and associated education strategies for the lower \nTchoutacabouffa River; (2) Research, design and implement watershed restoration and \nassociated education strategies for lower Tchoutacabouffa River.   \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 5\n of 22 \nProtection is defined as defending the existing natural and cultural resources of the \nWatershed from further degradation caused by encroachment, abuse or neglect.  \nRestoration is defined as actively initiating or accelerating the recovery of the ecological and \ncultural health, integrity and sustainability of the watershed that has been degraded, \ndamaged or destroyed.   \n \nINTRODUCTION \n \nThe Land Trust’s efforts to build a partnership for the lower Tchoutacabouffa River began \nwith two roundtable discussions in March and June of 2007 held at the homes of Judy and \nSandy Steckler and David and Candace Wheeler.  We learned much from the participants \nand are very appreciative of their time to meet and discuss the best ways to shape the \ndirection of our watershed partnership. \n \nThis document is written to provide a strategic approach to watershed planning with \nparticular focus on private sector participation in the process.  We want to provide context \nand a brief overview of the ecological, cultural and scenic significance of the \nTchoutacabouffa River Watershed. This is a record of our planning efforts and an accounting \nof actions identified to address watershed concerns.  The hope of participants is to foster \nbetter stewardship of the natural resources of the watershed.  \n \nForum participants were asked, “What characteristics of the Tchoutacabouffa do you want \nto protect?”  They responded with consensus:   \n1. Aesthetic values of running bodies of water \n2. Safe and clean for canoeing and swimming  \n3. White sandbars \n4. Clean, clear water tinted with tannins \n5. Beauty – lush tree canopy and native vegetation along the river banks \n6. Industry-free river banks \n \nForum participants are extremely concerned about increased flooding along the river and \nabout increased boat traffic (both faster and larger boats).  They are also concerned about \nthe impacts of increased development:  impervious surface, bulk heading and wetland loss. \nFrom the impacts of storm debris and tree loss to the increased threats of flooding and \nshallowing streams, participants clearly want to see their watershed restored and protected.  \nThey want to be better educated about watershed issues:  they are particularly interested to \nlearn more about the impacts that their actions have on the watershed.  They want \nneighbors and policy-makers to be better informed about the consequences and financial \ncosts of wetland loss, hardened shorelines and impervious surface.  They would like to see \nmore monitoring of the watershed, particularly tracking flood levels, wetland loss and linear \nfeet bulk headed along the river.  They would like to see land use planning at the watershed \nscale and increased enforcement of wetland laws and water safety/boating laws.  \n \nThere is a great need to educate the local citizenry about streamside management and the \nimpacts that neighbors’ choices have on the river and neighboring properties.  There is a \nneed for better public policy as the population grows. \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 6\n of 22 \nPURPOSE \n \nOur goal is to build a watershed partnership that will develop and implement a solution-\noriented, action plan.  This is the legacy that we want to leave:  a healthier, safer and more \nbeautiful Tchoutacabouffa River. \n \nAfter reviewing literature about the Tchoutacabouffa River Watershed and developing maps \nfor use in community discussions, the Land Trust for the Mississippi Coastal Plain (LTMCP) \nhosted two roundtable discussions with private landowners along the lower Tchoutacabouffa \nRiver.  These meetings were the first formal discussions with landowners and the foundation \nof building a long-term partnership to address the health of the Tchoutacabouffa River \nWatershed.   \nThe mission of the LTMCP is to conserve, promote and protect the open spaces and green \nplaces that have ecological, cultural or scenic significance in the counties of the Mississippi \nCoastal Plain.   Riparian corridors, or streamside management zones, have great ecological, \ncultural and scenic significance and are a primary focus of the LTMCP.  Healthy riparian \ncorridors are also essential elements for maintaining clean water.  The mission of EPA is to \nprotect human health and to safeguard the natural environment - air, water, and land - upon \nwhich life depends.  The foundation of building a watershed partnership for the \nTchoutacabouffa River is funded through a grant from EPA Region IV to the LTMCP.   \nLTMCP is committed to achieving its mission in the Tchoutacabouffa River and is grateful for \nthe EPA watershed grant that funded the exploration and initiation of this watershed \npartnership.  LTMCP is committed to working with stakeholders –private landowners, local \ngovernment and natural resource agencies, to implement the following education, \nprotection and restoration strategies for the Tchoutacabouffa River Watershed \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 7\n of 22 \n \n \nTchoutacabouffa River Watershed Teams \n \nLocal Landowner Advisors  \nJudy Steckler, Land Trust for Mississippi Coastal Plain \nAnita Arguelles \nDanielle Brewer \nDr. Larry Drawdy \nPatti and Jay Golden \nVirginia and Joe Lococo \nJudy and Sandy Steckler \nCandace and David Wheeler \nElmer Williams \n \nTechnical Advisors \nMDEQ, Coastal Basin Team Coordinator, Larry Estes \nSouth Mississippi RC&D Council, Patty Rogers \nMS Department of Wildlife Fisheries and Parks, Scenic Streams Program \nMS DMR – Comprehensive Resource Management Program \nMississippi Gulf Coast Heritage Program \nDeSoto National Forest \nMS Soil and Water Conservation, Harrison County SWCD \nNatural Resource Conservation Service \nHarrison County Utility Authority \nEPA, Gulf of Mexico Program (Habitat restoration team) \nEPA, Region 4, Watershed program \n \nEducation and Recreation Resource Advisors  \nLand Trust for Mississippi Coastal Plain \nCity of Biloxi – Planning and recreation \nCity of D’Iberville – Planning and recreation \nRivers and Trails, National Park Service, Liz Incer-Smith \nHarrison County Planning Commission, Smokey Johnson \nMS Department of Marine Resources – Boating Safety coordinator \nMSU Extension Service  \nSouth MS Environment and Agricultural Coordination Organization (SMEACO) \nMS Canoe and Kayak Club \nMS Gulf Coast Community College, Outdoor recreation program, Wayne Taylor \nWatershed Harmony Puppet Show \nHarrison County, Biloxi and D’Iberville School Districts \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 8\n of 22 \n Description of the Tchoutacabouffa River Watershed and Project Area \n \n \nThe Tchoutacabouffa River Watershed is located in Harrison County, west Jackson County \nand southeast Stone County in south Mississippi.  The watershed includes a fast-growing \nbusiness corridor along Interstate 10.  It also includes a rural landscape that is quickly \nconverting into a more suburban landscape with residential homes and weekend getaways \nalong the river.  The watershed also includes significant acreage within the DeSoto National \nForest.   \n \nThe entire watershed includes several sub-basins that have been targeted for partnership \nbuilding and action:  Bayou Castopia, Railroad Creek-Hurricane Creek, Tchoutacabouffa \nRiver and Bayou Billie, Tchoutacabouffa River and Cypress Creek, Tuxachanie Creek and \nBigfoot Creek, Tuxachanie Creek and Hester Creek, Tuxachanie Creek and Hog Creek. \n \n \nFigure 1:  Map of Tchoutacabouffa River Watershed  \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 9\n of 22 \n \nWithin the Tchoutacabouffa River Watershed, we have identified the lower watershed as the \nprimary area for citizen action. The Targeted Area for Action Plan includes the following \nhydrologic units:  \nI. Tchoutacabouffa River/Bayou Billie watershed covers @39 sq. miles and is 10.56 \nmiles long.  Hydrologic Unit Code:  031700090602 \nII. Tuxachanie Creek/Hester Creek watershed covers @39 sq. miles and is 8.87 miles \nlong.  Hydrologic Unit Code:  031700090605 \nIII. Tuxachanie Creek/Hog Branch watershed covers @17 sq. miles and is 7.22 miles \nlong.  Hydrologic Unit Code:  031700090606 \nIV. Tchoutacabouffa River/Cypress Creek watershed covers @ 38 sq. miles and is 11.98 \nmiles long.  Hydrologic Unit Code:  031700090607 \n \nFigure 2.  Map of lower Tchoutacabouffa River Watershed, \n Targeted Area for Action Plan \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 10\n of 22 \nStakeholder interests:  results from roundtable discussions \n \nI. What are the concerns and challenges in the Tchoutacabouffa River Watershed? \nc. Increased risk and frequency of flooding.   \nd. Increased velocity which causes erosion and loss of sandbars which causes \nincreased sedimentation and shallower water.  Observation from regular \nboater:  where the river used to be 40’ deep, it is now @25’ deep.  Where it \nused to be 24’ deep, it is now @14’ deep.   \ne. Channelization of headwater streams \nf. Loss of wetlands, clear-cutting, great increase in impervious surface \ng. water quality:  some sections of river are impaired by fecal coliform (failing \nseptic tanks and loss of wetlands) \nh. Historical clearcutting (entire watershed was clearcut in the 1930s), as well as \ncurrent clearcutting. \ni. Upper river has high banks.  Lower river has more spillways.  How do you \nconnect flooding concerns in the lower watershed to people who live in the \nupper watershed? \nj. Littering and illegal dumping \nk. Lack of silt fences – lack of BMPs, erosion control.  Need education and \nenforcement from DEQ. \nl. Water safety and public access concerns: \nm. Public access is minimal.  Need public access points that are safe and clean \nn. There has been a great increase in boat traffic, concern over size of boats (25-\n30’) and speed of boats. Need no-wake zones. \no. There is great concern about incompetent boat operators and use of alcohol.  \nNeed laws to protect people and property.  Also need better education for \nboaters.  \n \nII. What do you want to protect? \na. Aesthetic values of running bodies of water \nb. Canoeing and swimming \nc. Sandbars and white sand beaches \nd. Beauty – healthy, clear water tinted with tannins \ne. Beauty – trees and vegetation, there used to be lots of cypress along the river \nbanks \nf. Safety for children and grandchildren to swim \ng. Non-commercial uses of the river.  Want to keep industry off the river \nh. Protect the wildlife \ni. Protect wildflowers – particularly wild azaleas, mountain laurel \n \nIII. What do we need to know about our watershed? \na. When lakes and wetlands are filled in, where does the water go? \nb. Need to know: dumping of logs and debris – confusion about what to do \nc. Need to know: what are the impacts of bulkheading, rip rap, debris dumped.  \nBulkheading and rip-rapping cause erosion of adjacent lands \nd. Concerns about point source/non-point source at corner of scrap yard, \nHickman and Hwy 15.  Is business operating within existing environmental \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 11\n of 22 \npermits? Are operations outside of environmental permits?   How do we find \nout?  \ne. There is a ditch just upstream where a ditch joins the river – there is a white-\ncolored plume coming from the south side:  possibly Pine Crest subdivision – \nis there some kind of violation going on? \nf. There is a development on Lamey Bridge Road – Randy MasonTrendsetters is \ngiving property to City of D’Iberville – we see trucks, little cars, 4 wheel drives \n– now there is more car traffic – leaving trash on the sandbar.  What can \ncitizens do?  Who do we contact? \ng. What are the effects of rip-rap and bulk-heading \nh. Why is river shallower? \ni. In general, we need to address the lack of information about causes and \neffects within our watershed \nj. Need geomorphic and hydrologic data – need to model what’s happening to \nthe river \nk. Need to know and understand wetland loss – can it be mapped? \nl. Need more measuring stations, more monitoring stations, - both for water \nquality and flood stages \nm. Need to understand the effects of land use changes on the river \nn. Need more satellite imagery with before and after Wal-mart/Lowes (Sangani) \ndevelopment \no. New landowners need access to sustainable development practices.  They \nneed to know what to do to protect the property when putting in septic tanks \nor evaluating bank erosion. There is too much conflicting information.  Where \ndo you go to get sound advice?   \n \nIV. Prioritized list of needs (from the second watershed forum) \n1. Address safety concerns.  Safety is a real issue – especially with the advent of the \nwave-runner. \n \n2. Provide education about:  \na. wetland function for storage and how to maximize to decrease flooding risk \nb. where to get watershed information \nc. reaching out and connecting to others in the watershed:  “We are all \nwaterfront” \nd. planting trees \ne. streamside management – more information about the benefits of vegetation, \nparticularly native vegetation in the riparian buffer.   \n \n3. Develop building and zoning codes that require setbacks from the rivers banks.  \nCreate a protected riparian corridor that enhances scenic beauty, water quality and \npublic safety \n \n4. Need funding for research and monitoring:  \na. Is there still a proposed reservoir in the wings? \nb. Need to know the % of impervious surface in the watershed \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 12\n of 22 \nc. Need land use planning at the watershed scale – identify areas for increased \ndevelopment as well as areas for protection.  We need to manage and plan for \ngrowth. Do it right! \nd. Need to understand the impacts of bulkheading and docks. \ne. Need to know the % of river bank that has been bulk-headed \n \n5. Need consistency in construction of bulkheads and docks.   \n \n6. Need to plant native plants and trees, e.g. cypress trees \n \n7. Education need:  how do we get people to care?    \na. politicians and agencies \nb. individuals - find ways to help people to care about \n\ntheir impact on others and \nthe environment \n \n8. Need a safe harbor upriver during storms \n \n9. Address excessive boat traffic on weekends and throughout the summer – these \nproblems with boating are unique to Tchoutacabouffa       \n \n10. Need to understand the politics of watershed protection – need to learn how to \nbecome an impetus for change  \n \n11. Develop and implement watershed signage program, possibly billboards too – \neducate and build pride in place  \n \n12. Start small – successful action is the key to success – start with educating and \nimplementing streamside management and other BMPs.  \n \n13. Interested in adopt-a-stream program:  citizen monitoring of water quality \n \n14. Interested in recording river levels:  citizen monitoring and reporting of river levels \nduring storm events \n \n15. Interested in a program where people come out to advise new landowners about best \nbuilding practices, possibly through the MSU coastal extension center or CRMP? \n \n16. Need comprehensive land-use planning with a watershed approach \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 13\n of 22 \n \nBUILDING A PARTNERSHIP FOR THE TCHOUTACABOUFFA RIVER  \nACTION PLAN  \n \n \nAfter reviewing literature about the watershed and developing maps for use in community \ndiscussions, the Land Trust for the Mississippi Coastal Plain (LTMCP) hosted two roundtable \ndiscussions with private landowners along the lower Tchoutacabouffa River.  These \nmeetings, held in spring 2007, were the first formal discussions with landowners and the \nfoundation of building a long-term partnership to address the health of the Tchoutacabouffa \nRiver Watershed.   \n \nFirst, we recommend an assessment at the watershed scale to (1) determine the full extent \nof geomorphic changes causing accelerated erosion and reduced water quality in the river, \n(2) understand increased risks of flooding and solutions/restoration strategies to abate \nflooding.  The assessment needs to identify priority areas for stream restoration, \npreservation and sensitive areas for special land use planning.  Further study and \npartnership efforts may ultimately result in the development of a watershed implementation \nplan that will include prioritized action, timelines, budget estimates and measures of \nsuccess.  We recommend continued strategic planning efforts to improve the scope of the \nTchoutacabouffa River Watershed Action Plan. \n \nThe initial action plan, based on concerns and needs identified by landowners during spring \n2007, is noted below: \n \n \nEDUCATION STRATEGIES \n \n1. Create a webpage for the Tchoutacabouffa Watershed Partnership that can provide \nanswers to questions asked by local stakeholders: \na. General information about the watershed, what are the creeks and streams  \nand lands that makeup the watershed? \nb. Boating safety – Q&A with DMR and Coast Guard, boating safety class \nschedules, contact information for enforcement issues \nc. Wetland Function \nd. Recommendations about green infrastructure alternatives to bulkheading for \nerosion control \ne. Streamside Management and Best Management Practices (BMPs) \nf. Links to county and city zoning maps \n \n2. Educate the public about watersheds and streamside management:   \na. Develop a roadside/streamside education campaign to include signage on \nprivate lands (willing landowners)  Design and install watershed signage that \nwill (1) educate and build pride in place along the bayou and (2) encourage \nwatershed protection. \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 14\n of 22 \nb. Host a neighborhood meeting, or series of meetings, about streamside \nmanagement and best management practices.  Include city and county public \nworks employees in these discussions.  Print and distribute Tchoutacabouffa \nStreamside Management for Landowner’s Handbook \n \n3. Discuss with MSU Coastal Extension Service the possibilities of designing and hosting \na landowner education program for homeowners that addresses the primary \ninformation needs for homeowners and small land owners along the river, especially \nriverbank stabilization, native plants and reforestation.   \n \n4. Identify elementary schools in the watershed and contact them to schedule the \nWatershed Harmony Puppet Show during 2007-2008 school calendar.  Develop a \nchildren’s activity page to be used in conjunction with the Watershed Harmony \nPuppet Show.  \n \n \nPROTECTION AND RESTORATION STRATEGIES \n \n1. Host a facilitated Q&A session with private landowners along the river and DMR \nboating and safety officials and possibly coast guard officials.  Look for actions that \ncan be taken to alleviate concerns over increased number of boats, size of boats and \nspeed of boats.  Create an action plan to address boating concerns. \n \n2. Identify river bank areas that need re-planting and establish a streamside re-planting \nprogram to include native trees and vegetation, especially cypress trees. \n \n3. Work with County and City planning commissions to establish “set-backs” along the \nriver bank.  Also an excellent opportunity to involve the new Harrison County Utility \nAuthority in floodplain management focused on green infrastructure – vegetated \nriparian buffers \n \n4. Work with Harrison County Board of Supervisors to identify currently available \nresources to address the land-use questions, including number of wetland acres lost \nand number of linear feet with hardened surfaces (bulkheading and rip-rap).  Look for \nfunding sources to monitor wetland loss and natural bank loss. \n \n5. Identify landowners along the lower Tuxachanie Creek interested in protecting/ \nimproving water quality.  Host and support an Adopt-a-Stream workshop for \nlandowners on the lower Tuxachanie.  (Note:  the Tchoutacabouffa River is too deep \nto implement adopt-a-stream protocols in-stream.) \n \n6. Host and support the development of a citizen’s monitoring program for river levels. \nContact Pat Harrison Waterway, Harrison County Utility Authority or USGS to see if \nmodel programs exist. \n \n7. Work with state and federal partners, particularly EPA and MDEQ, to identify grant \nprograms and primary partners to complete a watershed assessment and watershed \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 15\n of 22 \nimplementation plan that will inform private action and public policy and action in the \nwatershed.   \n \n \n \nORGANIZATIONAL STRATEGIES  \nTO ENSURE IMPLEMENTATION AND SUPPORT OF ACTION PLAN \n \n1. Identify a local champion(s) for the watershed \n \n2. Ask the Land Trust for Mississippi Coastal Plain Board of Directors to establish a \nTchoutacabouffa River Watershed Partnership Committee (steering committee) that \nwill function as a special action committee under the Land Trust’s auspices until \nwhich time the partnership desires to create an independent organization.  The \nprimary purpose of the committee will be to implement the action plan.  This \ncommittee will be tasked with: \na. Categorizing and prioritizing the Action Plan;  \nb. Creating a timeline for the Action Plan;  \nc. Developing an estimated budget and volunteer staffing program to implement \nthe timeline;  \nd. Conducting an annual review of the watershed Action Plan. \n \n3. Formalize the technical advisory committee and send each person a copy of the \naction plan so that they are better prepared to participate and provide information \nand assistance as needed. \n \n4. Formalize the education, recreation resources team and send each person a copy of \nthe action plan so that they are better prepared to participate and provide \ninformation and assistance as needed. \n \n \n \n \n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 16\n of 22 \n \n \nEVALUATION OF PROGRESS AND PLAN REVISION \n \nRegular evaluation of the watershed action plan will ensure that the plan remains a vital tool \nfor developing a strong watershed partnership and to guide future management efforts in \nthe watershed.  LTMCP advisory team shall appoint a small working group to review the \naction plan annually.  Watershed plans are living documents that must be adapted to \nchanging conditions within the watershed.   The annual review shall include consideration of \ntasks completed as well as reviewing changes in the watershed, in stakeholder interests and \nin understanding of the Tchoutacabouffa River Watershed.  \n \n \n \nRESOURCES \n \nWatershed Description:  \nMARIS on-line mapping for Mississippi at www.maris.state.ms.us/HTM/maps.htm \n \nWildlife Resources:  \nMississippi Natural Heritage Inventory on-line at \nwww.mdwfp.com/museum/html/research/general_info.asp, NatureServe Explorer database \nof species information on-line at www.natureserve.org/explorer/ \n \nWater Quality Standards:  \nThrough MDEQ Basin Management water quality standards website at \nwww.deq.state.ms.us/MDEQ.nsf/page/WMB_Water_Quality_Standards?OpenDocument \n \nDesignated Beneficial Uses:  through the MDEQ Basin Management website at \nwww.deq.state.ms.us/MDEQ.nsf/page/WMB_Basin_Management_Approach?OpenDocume\nnt \n \nBiological Ratings:  Contact MDEQ. \n \n303(d) List and 305(b) report:   MDEQ on-line at \nwww.deq.state.ms.us/MDEQ.nsf/page/TWB_Total_Maximum_Daily_Load_Section?OpenDoc\nument \n \nApproved TMDLS:   MDEQ TMDL website at \nwww.deq.state.ms.us/MDEQ.nsf/page/TWB_Total_Maximum_Daily_Load_Section?OpenDoc\nument  \nor through Basin Management website at \nwww.deq.state.ms.us/MDEQ.nsf/page/WMB_Basin_Management_Approach?OpenDocume\nnt \n \nPotential management actions:  \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 17\n of 22 \nMississippi NRCS program website at www.ms.nrcs.usda.gov/programs/, particularly the \nEQIP program conservation practice, sign up, and ranking documents \n \nMississippi Streamside Landowner’s Handbook.  By Andrew Whitehurst, Scenic Streams \nStewardship Program, Mississippi Museum of Natural Science, Mississippi Dept of Wildlife, \nFisheries and Parks \n \nHandbook for Developing Watershed Plans to Restore and Protect Our Waters, U.S. \nEnvironmental Protection Agency, Office of Water, Nonpoint Source Control Branch, Oct. \n2005 \n \nEconomic values (Natural Capital): \nFrom Open Spaces to Wild Places, The Economic Value of Habitat protection to Your \nCommunity, a publication of the Southeast Watershed Forum.  \nwww.southeastwaterforum.org\n \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 18\n of 22 \nAppendix \n MISSISSIPPI NATURAL HERITAGE DATA \nPLANTS AND ANIMALS FOUND IN HARRISON COUNTY  \nSource:  Mississippi Naturage Heritage Program, located in the Mississippi Museum of Natural \nScience, Mississippi Department of Wildlife Fisheries and Parks:     \nwww.mdwfp.com/museum/html/research/\n \nThe Mississippi Natural Heritage Program identifies the state's most significant natural areas \nthrough a comprehensive inventory of rare plant and animal species, exemplary natural \ncommunities, special geological features, and significant natural areas. From the inventory, the \nNatural Heritage Database compiles information on the distribution, biology, status, and preservation \nneeds of these species and communities.  The database is updated continuously and is used to set \nstate, national and global priorities for the preservation of natural diversity. \nThe Natural Heritage Database \nThe Natural Heritage Database is a continuously updated inventory of rare plant and animal species \nand representative natural communities in Mississippi. Today current information on the statewide \nstatus and locations of special animals, plants, and natural communities is available in a central \nlocation. By utilizing the Heritage Program, resource planners are able to save time and money. The \ninformation contained within the Program's database was compiled from a broad range of sources, \nincluding museum and herbarium collection records, publications, unpublished reports, and experts \nthroughout the southeast. \nSpecific Information Available: \n• Tracks the status of more than 700 species of plants and animals that are rare or imperiled \nat the state or global level.  \n• Contains more than 9,400 records of locations for rare plants, animals, and natural \ncommunities.  \n• State and Federal protection status of select species.  \n• State and global ranking of species and communities.  \n• Protection and management priorities and urgency.  \n \nPLANTS – Harrison County \nScientific Name Common Name Global Rank State Rank \nAGALINIS APHYLLA COASTAL PLAIN FALSE-FOXGLOVE G3G4 S2S3 \nAGALINIS FILICAULIS THIN STEMMED FALSE-FOXGLOVE G3G4 S2? \nAGRIMONIA INCISA INCISED GROOVEBUR G3 S3S4 \nANDROPOGON PERANGUSTATUS ELLIOTT'S BLUESTEM (VAR.2) G5T3T4 S1? \nARISTIDA CONDENSATA SANDHILLS THREE AWN G4? S3S4 \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 19\n of 22 \nAVICENNIA NITIDA BLACK MANGROVE G5 SH \nBURMANNIA BIFLORA NORTHERN BURMANNIA G4G5 S3S4 \nCALOPOGON BARBATUS BEARDED GRASS-PINK G4? S2S3 \nCAREX EXILIS COAST SEDGE G5 S2 \nCHAMAECRISTA DEERINGIANA FLORIDA SENNA G1G2 S1 \nCLEISTES DIVARICATA SPREADING POGONIA G4 S3 \nCOREOPSIS BASALIS GOLDEN-MANE TICKSEED G5 S1? \nDICHANTHELIUM ERECTIFOLIUM ERECT-LEAF WITCHGRASS G4 S3S4 \nELYONURUS TRIPSACOIDES PAN AMERICAN BALSAMSCALE G5? SH \nEPIDENDRUM CONOPSEUM GREEN-FLY ORCHID G4 S2 \nERIOCAULON TEXENSE TEXAS PIPEWORT G4 S2S3 \nGAYLUSSACIA FRONDOSA DANGLEBERRY G5 S2S3 \nHELIANTHEMUM ARENICOLA GULF ROCKROSE G3 S1S2 \nILEX AMELANCHIER JUNEBERRY HOLLY G4 S3 \nILEX CASSINE DAHOON HOLLY G5 S2 \nILEX MYRTIFOLIA MYRTLE HOLLY G5? S3S4 \nIPOMOEA PES-CAPRAE RAILROAD VINE G5 S2S3 \nISOETES LOUISIANENSIS LOUISIANA QUILLWORT G3 S2 \nJUNIPERUS SILICICOLA SOUTHERN RED CEDAR G5T4T5 S2 \nLACHNOCAULON DIGYNUM PINELAND BOGBUTTON G3 S2 \nLILAEOPSIS CAROLINENSIS CAROLINA LILAEOPSIS G3G5 S2S3 \nLINDERA SUBCORIACEA BOG SPICE BUSH G2 S2 \nLINUM MACROCARPUM LARGE FRUITED FLAX G2? S2 \nLYCOPODIUM CERNUUM NODDING CLUBMOSS G5 S2 \nMACRANTHERA FLAMMEA FLAME FLOWER G3 S3? \nMELANTHIUM VIRGINICUM VIRGINIA BUNCHFLOWER G5 S2S3 \nMIKANIA CORDIFOLIA FLORIDA KEYS HEMPVINE G5 S3S4 \nPANICUM NUDICAULE NAKED-STEMMED PANIC GRASS G3Q S2 \nPARONYCHIA ERECTA BEACH SAND-SQUARES G3G4 S1S2 \nPASPALUM MONOSTACHYUM GULFDUNE PASPALUM G4? SU \nPELTANDRA SAGITTIFOLIA WHITE ARUM G3G4 S2S3 \nPETALOSTEMON GRACILIS PINE BARRENS PRAIRIE CLOVER G5T3T4 S2S3 \nPHYSALIS ANGUSTIFOLIA COAST GROUND-CHERRY G3G4 S3S4 \nPINGUICULA PLANIFOLIA CHAPMAN'S BUTTERWORT G3? S2 \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 20\n of 22 \nPINGUICULA PRIMULIFLORA SOUTHERN BUTTERWORT G3G4 S3 \nPLATANTHERA BLEPHARIGLOTTIS    LARGE WHITE FRINGED ORCHID G4G5 S2 \nPLATANTHERA CRISTATA CRESTED FRINGED ORCHID G5 S3 \nPLATANTHERA INTEGRA YELLOW FRINGELESS ORCHID G3G4 S3S4 \nPOLANISIA TENUIFOLIA SLENDER-LEAF CLAMMY-WEED G5 S1S2 \nPOLYGALA HOOKERI HOOKER'S MILKWORT G3 S1S2 \nQUERCUS MYRTIFOLIA MYRTLE-LEAF OAK G5 S1? \nRHYNCHOSPORA MACRA LARGE BEAKRUSH G3 S3 \nRHYNCHOSPORA STENOPHYLLA CHAPMAN BEAKRUSH G4 S1? \nRUELLIA NOCTIFLORA NIGHT-FLOWERING RUELLIA G2 S2 \nRUELLIA PEDUNCULATA SSP \nPINETORUM \nPINE BARREN RUELLIA G5T3? S3 \nSARRACENIA LEUCOPHYLLA CRIMSON PITCHER-PLANT G3 S2S3 \nSORGHASTRUM \nAPALACHICOLENSE \nOPEN INDIAN GRASS G3Q S3 \nSPIRANTHES LONGILABRIS GIANT SPIRAL LADIES'-TRESSES G3 S2S3 \nSTEWARTIA MALACODENDRON SILKY CAMELLIA G4 S3S4 \nSTYLISMA AQUATICA WATER SOUTHERN MORNING-GLORY G4 S1 \nSYNGONANTHUS FLAVIDULUS YELLOW PIPEWORT G5 S2? \nUTRICULARIA PURPUREA PURPLE BLADDERWORT G5 S2S3 \nXYRIS CHAPMANII CHAPMAN'S YELLOW-EYED GRASS G3 S2? \nXYRIS DRUMMONDII DRUMMOND'S YELLOW-EYED GRASS G3 S2 \nXYRIS FLABELLIFORMIS FAN-SHAPED YELLOW-EYED GRASS G4 SU \nXYRIS SCABRIFOLIA HARPER'S YELLOW-EYED GRASS G3 S1S2 \n \n \nANIMALS – Harrison County \n \nScientific Name Common Name Global Rank State Rank \nACCIPITER STRIATUS SHARP-SHINNED HAWK G5 S1?B,SZN \nACIPENSER OXYRINCHUS \nDESOTOI \nGULF STURGEON G3T2 S1 \nAIMOPHILA AESTIVALIS BACHMAN'S SPARROW G3 S3?B,SZN \nANAS FULVIGULA MOTTLED DUCK G4 S3B,S4N \nCARETTA CARETTA LOGGERHEAD; CABEZON G3 S1B,SZN \nCHARADRIUS MELODUS PIPING PLOVER G3 SZN \nCOTURNICOPS NOVEBORACENSIS   YELLOW   RAIL   G4   S2N   \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 21\n of 22 \nDRYMARCHON CORAIS COUPERI EASTERN INDIGO SNAKE G4T3 S1 \nEGRETTA RUFESCENS REDDISH EGRET G4 SZN \nENNEACANTHUS GLORIOSUS BLUESPOTTED SUNFISH G5 S3 \nFALCO COLUMBARIUS MERLIN G5 SZN \nFALLICAMBARUS BYERSI LAVENDER BURROWING CRAYFISH G4 S3 \nFALLICAMBARUS DANIELAE SPECKLED BURROWING CRAYFISH G2 S2 \nFUNDULUS JENKINSI SALTMARSH TOPMINNOW G2 S3 \nGOPHERUS POLYPHEMUS GOPHER TORTOISE G3 S2 \nGRUS CANADENSIS PULLA MISSISSIPPI SANDHILL CRANE G5T1 S1 \nHAEMATOPUS PALLIATUS AMERICAN OYSTERCATCHER G5 SPB,SZN \nHALIAEETUS LEUCOCEPHALUS BALD EAGLE G4 S1B,S2N \nHETERANDRIA FORMOSA LEAST KILLIFISH G5 S3 \nHETERODON SIMUS SOUTHERN HOGNOSE SNAKE G2 SH \nLATERALLUS JAMAICENSIS BLACK RAIL G4 S2N \nLEPIDOCHELYS KEMPII KEMP'S OR ATLANTIC RIDLEY G1 S1N \nMACROCHELYS TEMMINCKII ALLIGATOR SNAPPING TURTLE G3G4 S3 \nMALACLEMYS TERRAPIN PILEATA     MISSISSIPPI DIAMONDBACK TERRAPIN    G4T3 S2 \nNERODIA CLARKII CLARKII GULF SALT MARSH SNAKE G4T3 S2? \nNOTROPIS CHALYBAEUS IRONCOLOR SHINER G4 S2 \nNYCTICORAX NYCTICORAX BLACK-CROWNED NIGHT-HERON G5 S3?B,SZN \nONTHOPHAGUS POLYPHEMI ONTHOPHAGUS TORTOISE \nCOMMENSAL SCARAB BEETL \nG?                            S?                            \nPANDION HALIAETUS OSPREY G5 S3B,SZN \nPELECANUS ERYTHRORHYNCHOS    AMERICAN WHITE PELICAN G3 S2N \nPELECANUS OCCIDENTALIS BROWN PELICAN G4 S1N \nPEROMYSCUS POLIONOTUS OLDFIELD MOUSE G5 S2S3 \nPICOIDES BOREALIS RED-COCKADED WOODPECKER G3 S1 \nPITUOPHIS MELANOLEUCUS \nLODINGI \nBLACK PINE SNAKE G4T3 S2 \nPROCAMBARUS FITZPATRICKI SPINY-TAILED CRAYFISH G2 S2 \nPSEUDEMYS POP 1 MISSISSIPPI REDBELLY TURTLE G? S1 \nPSEUDOTRITON MONTANUS MUD SALAMANDER G5 S2S3 \nRANA HECKSCHERI RIVER FROG G5 S1 \nRANA SEVOSA DARK GOPHER FROG G1 S1 \nREGINA RIGIDA SINICOLA GULF CRAYFISH SNAKE G5T5 S3? \n\nTchoutacabouffa River Watershed Partnership \nAction Plan  \nSpring 2007 \nPage 2\n\n2\n of 22 \nRHADINAEA FLAVILATA PINE WOODS SNAKE G4 S3? \nSTERNA ANTILLARUM LEAST TERN G4 S3B,SZN \nSTERNA MAXIMA ROYAL TERN G5 S1B,S4N \nTHRYOMANES BEWICKII BEWICK'S WREN G5 S2S3B,SZN \nTRICHECHUS MANATUS MANATEE G2 SZ \n ",
  "metadata": {
    "id": "tchoutacabouffa-river-watershed-action-plan-2007",
    "originalName": "tchoutacabouffa-river-watershed-action-plan-2007.pdf",
    "mergedFrom": [
      "tchoutacabouffa-river-watershed-action-plan-2007-1.json",
      "tchoutacabouffa-river-watershed-action-plan-2007-2.json",
      "tchoutacabouffa-river-watershed-action-plan-2007-3.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.797Z",
    "length": 36216
  }
}