{
  "id": "turkey-creek-watershed-plan-2006",
  "rawText": "\n\n \n \n \nWATERSHED IMPLEMENTATION PLAN \nTURKEY CREEK  \nCity of Gulfport, Harrison County, MS  \n \nPrepared in collaboration with: \nTurkey Creek and North Gulfport community partners \n \n \nSponsored by:  \n \nWith funding assistance from EPA, Region IV \n \n \n \n \nPrepared by:  \nEco-Logic Restoration Services, LLC \n1004 Government Street \nOcean Springs, Mississippi  29564 \nwww.ecologic-restoration.com\n \n \n \n \nSubmitted October 16, 2006  \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 2 of 42    \n \n \n \nTurkey Creek Watershed Implementation Plan \nOctober 2006 \n \n \n \nSponsored by: \nLand Trust for the Mississippi Coastal Plain \nP.O. Box 245 \nBiloxi, Mississippi  39533 \n228.435.9191 \nwww.ltmpc.org\n \n \nWith Acknowledgement for Contributions made by: \nTurkey Creek Community Initiatives \n14439 Rippy Road \nGulfport, MS  39503 \n \nNorth Gulfport Community Land Conservancy \n4803 Indiana Avenue \nGulfport, MS  39501 \n \nMIG – Moore, Iacofano, Goltsman, Inc. \n800 Hearst Avenue \nBerkeley, CA 94710 \n \nKenneth Dean, Watershed Management  \nEPA, Region IV \n61 Forsyth Street, SW  \nAtlanta, GA 30303-8960 \n \nSteve Goff and Coastal Basin Team \nMS Dept. of Environmental Quality \nP.O. Box 20385 \nJackson, MS  39289 \n \nSpecial thanks to: \nElla Holmes-Hines, Ward III Councilwoman, City of Gulfport \nWilliam Martin, District IV Supervisor, Harrison County \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 3 of 42    \n \n \n \n \nTABLE OF CONTENTS \n                  PAGE \n        EXECUTIVE SUMMARY          04  \nI. STATEMENT OF PURPOSE        06 \nII. PARTNERS           AND           COLLABORATORS                                                                             06           \nIII. WATERSHED           DESCRIPTION           AND           HISTORY                                                                  09           \nIV. WATER QUALITY OF TURKEY CREEK       11 \nV. WATERSHED ACTION PLAN:  GOALS, STRATEGIES, TIMELINES   12  \nA. PROTECTION GOAL        13 \nB. RESTORATION GOAL        17 \nVI. BUDGET  ESTIMATES         22 \nVII. EVALUATION          23 \n \n \n \nAPPENDICES \nAPPENDIX A:    Map:  Turkey Creek Greenways  \n \nAPPENDIX B: 2004 Turkey Creek Watershed Greenway Public Education and Input \nSummary Report by Land Trust for Mississippi Coastal Plain \n \nAPPENDIX C: 2006 Turkey Creek and North Gulfport Neighborhoods Community Plan \nby MIG \n \nAPPENDIX D: Map:  Turkey Creek Watershed, Land Use and Land Classification  \n \nAPPENDIX E: Map:  Turkey Creek Watershed, with Aerial Imagery \n \nAPPENDIX F:    Natural Heritage List, Harrison County and Turkey Creek area \n \nAPPENDIX G: Map:  Turkey Creek Watershed, Sites that present environmental \nconcerns to community residents \n \nAPPENDIX H:    Proposed list of annual environmental education events \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 4 of 42    \n \n \nTurkey Creek Watershed Implementation Plan \n \nEXECUTIVE SUMMARY \n \nIn 2003, community leaders in the Turkey Creek Watershed approached the Land Trust and \nDistrict IV, Harrison County Board of Supervisor, William Martin, about their desire to \nhighlight the benefits of the Creek by creating a greenway.  In 2004, a Turkey Creek \nGreenway Coalition was formed and the Land Trust for the Mississippi Coastal Plain (LTMCP) \nbegan a series of forums funded in part by Harrison County Board of Supervisors and EPA \nRegion IV to gauge community support for a greenway and to determine other environmental \nissues residents considered important. (See Appendix A and Appendix B.) Progress was \ntemporarily halted by the devastation of Hurricane Katrina on August 29, 2005.  After Katrina, \ncommunity development and renewal continued with the creation of the North Gulfport \nNeighborhoods Community Plan, a planning process hosted by Turkey Creek Community \nInitiatives and North Gulfport Community Land Conservancy with technical assistance and \ndocument production by Moore, Iacofano, Goltsman, Inc. (see Appendix C).   \n \nAlso, after Hurricane Katrina, the LTMCP wanted to build on the work of the Greenway \ncoalition and further develop a unique, engaged watershed partnership with the Turkey Creek \ncommunity.  Preparation for the Turkey Creek Watershed Implementation Plan began in \nOctober 2005 with funding assistance from the EPA.  This partnership is intended to foster a \nmore sustainable future for residents, businesses and community institutions by addressing \nnatural and cultural resource concerns in a comprehensive plan.  The Turkey Creek Watershed \nImplementation Plan was developed to serve as overall guidance for improving water quality \nin Turkey Creek.  The LTMCP and its partners believe that citizens and private sector \nstakeholders can best achieve this goal by (1) creating a community greenway with public  \naccess to the creek; (2) prioritizing ecological restoration projects and environmental \neducation programs and (3) developing partnerships to implement watershed projects. \n \nIn January 2006, the Turkey Creek-North Gulfport Neighborhood’s identified five primary \nconservation goals (see Appendix C): \n \n1. Protect Existing Resources \n2. Educate and Empower the Community \n3. Restore Ecological Functions and Natural Connections to System Headwaters \n4. Increase  Non-vehicular  Connectivity  between  schools,  parks,  community  centers,  \nhomes, businesses and neighborhoods \n5. Coordinate  funding  so  that  public  projects  are  well  leveraged  to  maximize  public  \nbenefit  \n \nIn order to achieve these goals, we have created a Watershed Implementation Plan (the Plan) \nthat contains appropriate actions for public/private action along Turkey Creek, such as public \naccess, environmental and watershed education, ecological restoration, wetland and tree \ncanopy protection.    Strategies identified in the Plan could be supported through several \nfederal, state and local funding programs.  Funding support to develop the Plan came through \nan EPA grant to the LTMCP with technical support from Mississippi Department of \nEnvironmental Quality (DEQ).  The Plan was developed to be in compliance with EPA and DEQ \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 5 of 42    \n \n319 funding program guidelines in anticipation of that LTMCP and other community \norganizations will submit future proposals to the 319 grant program.  The Plan is divided into \ntwo parts:  protection and restoration strategies that the community wants to see \naccomplished within the next few years.   \n \n(1) PROTECTION GOAL:  To defend the existing natural and cultural resources of the Turkey \nCreek Watershed from further degradation caused by encroachment, abuse or neglect.  The \nPlan includes 8 management strategies and 15 education strategies to help meet the \nprotection goal. \n \n(2) RESTORATION GOAL:  To actively initiate or accelerate the recovery of the ecological and \ncultural health, integrity and sustainability of the Turkey Creek Watershed wherever it has \nbeen degraded, damaged or destroyed.  The Plan includes 15 management strategies and 8 \neducation strategies to help meet the restoration goal. \n \nIn addition to strategies, the Plan includes a watershed description and history, as well as a \nbudget estimate and a provision for regular review of the Plan – measuring and celebrating \nsuccess.  The estimated cost for completing this watershed action plan is approximately $2.3 \nmillion.  This budget could be met through several different federal, state and local \nenvironmental grant programs as well as through public-private partnerships.  Sustaining a \nunified vision for Turkey Creek’s future is crucial and, to that end, it is intended that the \nsteering committee will meet quarterly to review progress, include newly developed \npartnerships, measure success and re-align strategies with the most current environmental-\nsocial-political reality. \n \nIf you are reading this Executive Summary, then you are most likely a stakeholder in the \nTurkey Creek Watershed and as such, we invite your wholehearted participation in a long-\nterm process to create cleaner water, a healthier watershed and a brighter future for the \nTurkey Creek and North Gulfport Communities.  Your questions and comments are welcomed! \n \n \nJudy Steckler \nDirector \nLand Trust for the Mississippi Coastal Plain \nOctober 16, 2006 \n \n  \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 6 of 42    \n \n \nI. STATEMENT OF PURPOSE \nOur purpose is to work within the context of an engaged partnership to develop a more \nsustainable future for residents, businesses and community institutions located within the \nTurkey Creek Watershed by addressing natural and cultural resource concerns in a \ncomprehensive Watershed Implementation Plan.   \n \nThe Turkey Creek Watershed Implementation Plan was developed to serve as overall guidance \nfor improving water quality in Turkey Creek by: \n(1) Creating a community greenway  \n(2) Identifying and implementing ecological restoration projects  \n(3) Creating environmental education opportunities  \n(4) Building partnerships for implementing this plan.   \n \n \n \nII.       PARTNERS       AND       COLLABORATORS:  Turkey Creek Watershed \nThe Turkey Creek Watershed has been the subject of numerous initiatives designed to protect \nand conserve its valuable resources, both natural and cultural.  The following lists of partners \nand collaborators were developed to gather those individuals already involved in various \ninitiatives surrounding the watershed, and additional individuals with technical expertise, into \na cohesive planning group that speaks with a singular authoritative voice for the protection \nand restoration of the Turkey Creek Watershed resources.   \n \nA. Watershed Implementation Team (Steering Committee for the Plan): \n  Derrick Evans, Turkey Creek Community Initiatives (TCCI) \nRose Johnson, North Gulfport Community Land Conservancy (NGCC) & Sierra Club \nMark LaSalle, Audubon Mississippi \nBuck Lawrence, Land Trust for Mississippi Coastal Plain  \n  Judy Steckler, Land Trust for Mississippi Coastal Plain \n  Flowers White, Eulice N. White Civic Organization and Mt. Pleasant UMC \n  Lettie Evans-Caldwell, Mt. Pleasant UMC Environmental Ministry \n  \nTechnical Committee (Coastal Basin Team Members) for Turkey Creek Watershed \nImplementation Plan: \nJudy Steckler, Land Trust for Mississippi Coastal Plain \nJennifer Buchanan Grand Bay NERR, DMR \nTina Shumate, CRMP – Heritage Program, DMR \nPhil Bass, EPA, Gulf of Mexico Program \nKenneth Dean, EPA, Region I$, Watershed Management \nPansy Maddox MS State Dept of Health \nStan Crider, MS Dept of Wildlife, Fisheries and Parks \nAndrew Whitehurst MS Dept of Wildlife, Fisheries and Parks \nEd Pinero, USM, Dept of Marine Sciences \nGwen Necaise Smith, MSU, Extension Service, Hancock County \nMS Forestry Commission \nKay Whittington, MDEQ, TMDL Section \nMark Gilbert, MSSWCC \nTyree Harrington, NRCS \n    \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 7 of 42    \n \n \nB.   The   following   are   committees   of   Turkey   Creek   and   North   Gulfport   \nNeighborhoods Community Plan.  They have been the primary contributors \nto  the  establishment  of  the  Turkey  Creek  Greenway  Plan  and  the  Turkey  \nCreek Watershed Plan.  It is the long-term commitment of these committees \nthat  will  continue  to  inform  and  support  implementation  of  the  Turkey  \nCreek Watershed Implementation Plan. \n \nSteering Committee:   \n                        Sam            Arnold,            International Relief and Development \n  Ruby Brewer, North Gulfport Civic Club \n  Charles Dubra, North Gulfport 7\nth\n – 8\nth\n Grade School \nDerrick Evans, Turkey Creek Community Initiatives \n  Frances Fredericks, Mississippi House of Representatives  \n  Sammy Gray, Villa Del Rey Subdivsion  \nElla Homes-Hines, Gulfport City Council, Ward 3 \n  Rose Johnson, North Gulfport Community Land Trust and Sierra Club \n  JP Lawrence, South Mississippi Regional Housing Authority \n  Richard Marsh, Fredericks and Good Deeds Community Centers \n  William Martin, Harrison County Board of Supervisors, District 4 \n  Purvis McBride, Forrest Heights Boys & Girls Club \n  Philip McSwain, Greater Mt. Olive Baptist Church \n  Edward Moses, Mt. Pleasant United Methodist Church \n  Gaynette Flowers-Pugh, Good Deeds Association \n  George D. Rouse, Forrest Heights Baptist Church \n  Mary Spinks-Thigpen, Forrest Heights Homeowners-Renters Association \n  Flowers White, Elice N. White Civic Organization and Mt. Pleasant UMC \n      \nTask Force on Education, Recreation and Public Health  \n  Gayle Abrams, Harrison Central 9\nth\n Grade School \n  Sheila Belcher, Forrest Heights Boys and Girls Club \n  Christine Brice, Workers Helping Youth, Inc. \n  Charles Dubra, North Gulfport 7\nth\n-8\nth\n Grade School \nLettie Evans-Caldwell, Mt. Pleasant UMC, Environmental Ministry \nLuther Graves, Gulfport Chapter AARP, Turkey Creek Community Initiatives \nJanice Green, North Gulfport Senior Citizens’ Center \nMark LaSalle, Audubon Mississippi \nBill Liermann, Mt. Pleasant UMC, Environmental Ministry \nGregg Magee, Silver Cloud District Boy Scouts \nRichard Marsh, Good Deeds and Isaiah Fredericks Community Centers \nPurvis McBride, Forrest Heights Boys & Girls Club \nCarol Paola, Long Beach Elementary School \nMaurice Reese, West Gulfport NFL Youth \nBruce Roberts, Forrest Heights boys & Girls Club \nSandra Smith, Mt. Pleasant UMC, Turkey Creek Community Initiatives \nMary Spinks-Thigpen, Forrest Heights Boys & Girls club \nAndrew Whitehurst, MS Museum of Natural Science \n \nTask Force for Environmental Preservation and Watershed Planning \n Margaret Bretz, Land Trust for Mississippi Coastal Plain \n Jennifer Buchanan, Grand Bay National Estuarine Research Reserve \n Kris Carter, Region IV, US Environmental Protection Agency \n Lettie Evans-Caldwell, Mt. Pleasant United Methodist Church \n Becky Gillette, Sierra Club \n Steve Goff, Mississippi Department of Environmental Quality \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 8 of 42    \n \n Tyree Harrington, Natural Resource Conservation Service \n Flinda Hill, MPCO and SMEACO \nChris Lagarde, Congressman Gene Taylor’s Office \n Mark LaSalle, Audubon, MS \n Buck Lawrence, Land Trust for Mississippi Coastal Plain \n Bill Liermann, Mt. Pleasant United Methodist Church \n Amy Mitchell, MIG \n Howard Page, Sierra Club \n Cynthia Ramseur, Eco-Logic Restoration Services, LLC \n Patty Rogers, Natural Resource Conservation Science \n Patricia Spinks, Turkey Creek Community Initiatives \n Judy Steckler, Land Trust for Mississippi Coastal Plain \n Flowers White, Mt. Pleasant United Methodist Church \n Andrew Whitehurst, MS Museum of Natural Science \n Donna Yowell, Mississippi Urban Forestry Council \n \n \n \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 9 of 42    \n \nIII. WATERSHED DESCRIPTION AND HISTORY \n \n“Anyone who flies in or out of Mississippi’s fastest-growing city can’t help but notice a \ndramatic island of greenery shaped something like a pork chop, lying smack in the middle of \ntwenty-first century Gulfport.  The Turkey Creek Watershed, containing some of Harrison \nCounty’s busiest roads, highways and businesses, also includes some of its oldest residential \ncommunities, as well as much of what’s left of the area’s distinctive natural habitats.  \nWhether from the air, a roadway, or the banks of the creek itself – the view is dramatic and \nthe contrasts are amazing  ... \n \nDrenched by eighty inches of rainfall each year, the Turkey Creek watershed has always \nincluded thousands of acres of wetlands.  All of its runoff, or storm water, not absorbed by \nsoils and plants or transpired into the air ends up in the creek itself – which is also subjected \neach day to the Gulf of Mexico’s rising and falling tides.  A literal extension of the gulf by \nway of Biloxi Bay and Bernard Bayou, the eastern stretch of Turkey Creek is actually a \nbrackish bayou – a coastal estuary of remarkable biodiversity and classic southern beauty. \n \nEqually imp\n\nortant, this easternmost segment of the watershed is where an international \nairport, a U.S. interstate a major state highway, an active railway, and scores of \ncommercial and industrial activities converge as well.  Lying at the very center of both \npast and prospective annexations by Gulfport, the Turkey Creek watershed remains a \ndramatic foacl point of the city’s continuing growth.  Consequently, nowhere on the \nMississippi coast or in our state is the need for balanced development or smart planning \nany more obvious, important or challenging.  Whether we like it or not, tis small but \ncomplex watershed and stream will help shape and define our community and lives for \ncountless more years to come – be we residents, developers, business owners, \ngovernment officers, or children.”    \nQuoting Derrick Evans, “The Emerald Port Chop”.  \nTurkey Creek Community Initiative, 2005.  \n \nTurkey Creek is in the Coastal Basin Hydrologic Unit Code (HUC) 031700090702 in \nsoutheastern Mississippi (Figure 1 below).  It flows approximately 12.9 miles in a southeastern \ndirection from its headwaters until its confluence with Bernard Bayou.  Turkey Creek \nheadwaters are located just north of Interstate 10 and west of Highway 49.  The drainage \narea is approximately 11,000 acres and lies within Harrison County.  The watershed is rural \nbut includes some urban areas, those portions located within the city limits of Gulfport and \nLong Beach.  The historic Turkey Creek community is surrounded by large urban \ndevelopments:  the airport lies to the south, highway 49 lies to the west and the industrial \nseaway lies to the north.  Outside the city limits, open land (wet-pine savannas and forests) is \nthe dominant landuse within the watershed (see Appendix D, land use map and Appendix E, \naerial view of Turkey Creek Watershed).  \n  \nLand Distribution in Acres for the Turkey Creek Watershed \nUrban**          Forest*                     Cropland          Pasture          Total                    \nArea   (acres)    1,392      5,134      3,270      1,328      11,124   \n%           Area                      12.5%                      46.2%                      29.4%                      11.9%                      100%           \n*Includes wetlands        **Includes barren lands    (Ref:  MDEQ, Fecal Coliform TMDL for Turkey Creek, June 2003) \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 10 of 42    \n \n \n \n           Figure 1.  Turkey Creek Watershed, Gulfport, Harrison County, Mississippi \n \nThe historic communities of Turkey Creek, North Gulfport and Forrest Heights are located at \nthe lower end of the Turkey Creek watershed.   The lower reaches of the Creek are navigable \nfrom west of the North Gulfport Middle School to Bernard Bayou.  It is a popular waterway for \nfishing, swimming and canoeing and contributes to the culture and quality of life of the \nresidents.  \n \nThe watershed is located in the East Gulf Coastal Plain ecoregion of the southeastern U.S. and \nis part of the Mississippi Coastal Basin and Streams.  Native vegetation in the watershed \nincludes those species found in coastal wet pine savannas, mixed southern forests, bayhead \nswamps and bottomland hardwood forests. The topography of the watershed is relatively flat \ncreating a slow-moving coastal stream and tidal creek.  \n \nIn 1866, a group of emancipated African-Americans exercised their newly acquired rights to \npurchase and settle 320 acres in Harrison County Mississippi.  Land records listed this area as \nuninhabited “Swamp Land”.  Now known as Turkey Creek, the land encompasses bottomland \nand coastal maritime forests, freshwater marsh and scrub-shrub habitats. The settlers created \narable land to practice sustainable agriculture and supplemented their diet with fish, plants \nand wildlife from the forests and streams.  They developed a viable, self-sufficient \ncommunity bound together by culture and ecology.  \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 11 of 42    \n \n \nUntil the mid 1980s, Turkey Creek’s community institutions and land use remained remarkably \nunchanged as land was passed from generation to generation.  Since then however, this piece \nof American heritage has been critically threatened by airport expansion, municipal \nannexation, land speculation, deforestation, wetland destruction, commercial sprawl, spot \nzoning and political isolation.  As a result, in 2001, the Mississippi Heritage Trust listed the \nentire community as one of the state’s Ten Most Endangered Historical Places. \n \nPost-Katrina, the community leaders through the Turkey Creek and North Gulfport \nNeighborhoods Community Plan are leading a movement to provide intelligent urban planning \nincorporating conservation and ecological restoration.  With the help of long-term \nstakeholders and concerned citizens, these leaders seek to preserve and restore Turkey \nCreek’s natural and cultural heritage using smart growth planning principles and techniques.   \nThe Turkey Creek Watershed Implementation Plan is intended to inform the Turkey Creek and \nNorth Gulfport Neighborhoods Community Plan and bring federal and state resources to \nimprove water quality and protect natural resources. \n \nThe watershed’s natural capital resource base includes a wide array of flora and fauna \nspecies found in south Mississippi.  (See Appendix F, Natural Heritage List.)  Current threats to \necological and cultural integrity are outlined along with strategies for their restoration and \npreservation.  (See also Appendix G which identifies sites of special environmental concern to \nthe community.)  \n \n \nIV. WATER QUALITY OF TURKEY CREEK \n \nThe water use classification for Turkey Creek, as established by the State of Mississippi in the \nWater Quality Criteria for Intrastate, Interstate and Coastal Waters regulation, is “Fish and \nWildlife Support”.  The designated beneficial uses for Turkey Creek are “Secondary Contact \nand Aquatic Life Support”.  Local residents have informed MDEQ of a swimming hole used by \nlocal children in Turkey Creek and the current water use classification may not support this \nuse.  Further investigation with community and MDEQ regarding use classification is a \nproposed strategy in this plan. \n \nA segment of Turkey Creek, from the confluence with Canal #2 to Highway 49, was included \non the Mississippi 1998 Section 303(d) List of Waterbodies as impaired due to fecal coliform \nbacteria.  MDEQ assumed there is a 50% failure rate of septic tanks in the drainage area based \non estimates from the State Department of Health for this area of the state.  There are two \nNPDES permitted treatment plants that discharge treated effluent that contains fecal \ncoliform in the watershed.  According to the method used to determine this TMDL, a 52% \nreduction is indicated for Turkey Creek to meet water quality standards.  It is also necessary \nto evaluate the current septic tanks in the watershed to reduce the potential for pollution \nfrom failing septic tanks.  Additionally, the City of Gulfport needs to reduce accidental spills \nfrom the sewage collection system that impairs this stream during flood events.  There is one \nMDEQ ambient monitoring station located near Long Beach on the listed stream segment and \nthere is a special study station at Gulfport and Highway 49 at the Arkansas Street Bridge.  \n(Ref: MDEQ, Fecal Coliform TMDL for Turkey Creek, Coastal Basin, Harrison County.  June \n2003) \n  \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 12 of 42    \n \nWater quality data available for the monitored segment of Turkey Creek shows that low levels \nof pH have been found in the stream.  There is one ambient station operated by MDEQ that \nhas pH monitoring data available.   The nonpoint sources from storm water run off that could \ncontribute to an alteration of pH in Turkey Creek include failing septic systems (considered in \nthe TMDL and based on a 50% failure rate), acidic soil (considered uncontrollable and not \naccounted for in the TMDL), pine needle decay (considered uncontrollable and not accounted \nfor in the TMDL), and urban development (considered controllable, however, there is a \nlimited amount of urban area in the watershed).  (Ref:  MDEQ, TMDL for Low pH in Turkey \nCreek, Coastal Streams Basin, Harrison County, Mississippi.  December 2000).  According to \nBinkley and Richter, 1987, “under pines where there is a lower pH value, burning tends to \nraise the pH.”    Therefore, acidic soil and pine needle decay may be managed to some \ndegree by reestablishing a natural fire regime on the open lands in the watershed, \nparticularly those outside the city limits.  \n \nSite visits on January 25\nth\n and March 3\nrd\n revealed an ecologically damaged watershed \nexhibiting resultant losses in environmental quality and function.  Degradation to the Turkey \nCreek Watershed is the result of human activities:   \n \n•\n Filling of wetlands \n•\n Dredging/channelizing of wetlands \n•\n Timbering operations within and surrounding wetlands including clear-cutting of vegetation \nup to the stream edge causing reductions in the filtering capacity of the wetland and \nsubsequent increased sediment loading of the stream channel \n• Development and/or constructions up to the stream \nedge with the same results as above \n• Habitat fragmentation from development without adequate greenway planning \n• Habitat degradation through hydrologic alterations and reductions in vegetative cover \n• Exotic species invasions, particularly Chinese tallow tree and cogongrass, that cause partial \nor complete alterations in biological communities that can modify ecological function and \nwildlife utilization  \n• Uninformed or ill-conceived zoning ordinances that adversely impact environmentally \nsensitive areas \n• Non-implementation of Best Management Practices (BMPs) \n• Inadequate wetland permitting enforcement \n• Direct and indirect chemical contamination – historic and current \n \n \n \nV. TURKEY CREEK WATERSHED ACTION PLAN:  GOALS AND STRATEGIES \n \nThe Turkey Creek and North Gulfport Neighborhoods Community Plan identified five primary \nconservation goals: \n \n1. Protect Existing Resources \n2. Educate and Empower the Community \n3. Restore Ecological Functions and Natural Connections to System Headwaters \n4. Increase  Non-vehicular  Connectivity  between  schools,  parks,  community  centers,  \nhomes, businesses and neighborhoods \n5. Marshall  funding  so  that  public  projects  are  well-coordinated  and  leveraged  to  \nmaximize public benefit. \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 13 of 42    \n \nFor the purposes of the Turkey Creek Watershed Implementation Plan, the above conservation \ngoals are restated in two categories:  (1) Protection Goals and (2) Restoration Goals.  Action \nplans to help achieve these goals have been identified through partnership planning and are \nlisted below with a possible timeline and a possible lead organization.  \n \n \n \n \nI.     PROTECTION GOAL   \n \nTo defend the existing natural and cultural resources of the Turkey Creek \nWatershed from further degradation caused by encroachment, abuse or neglect. \n \nA.  Management:  Forestry and Construction BMP strategies for Protection are listed  \nbelow.  (Not in order of priority.) \n \n1. Fund and acquire identified priority conservation areas in the Turkey Creek Greenway \nfrom Canal Road area in Long Beach to the confluence with Bernard Bayou.   (see \nGreenway Map, Appendix A).  Work to assure that acquisitions will help complete \nconnectivity goals of the community. \n Proposed Timeline:  2006 and early 2007  \n Lead organizations:  City of Gulfport with funding from CIAP I already awarded  \nLTMCP with funding from 319 program, CIAP II and other funding programs  \n \n2. Promote the development of “green design” subdivisions in areas off 28\nth\n street that \nare being zoned T3.   \n Proposed Timeline: on-going   \n Possible Lead organizations:  NGCC with support from LTMCP, TCCI, NGCC and \nCity of Gulfport \n \n3. Work to complete proposed “green design” subdivision model in Bayou Bernard \nheadwaters near County Farm Road.  The tract was recently cutover and is now slated \nfor a residential development.  It needs restoration and long-term protection of \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 14 of 42    \n \nwetlands through fee simple donation or conservation easement donation.  Project to \nserve as a model project for the Turkey Creek Watershed.   \n Proposed Timeline: 2006 and early 2007   \n Possible Lead organization:  LTMCP and NGCC.  Work in progress \n \n4. Create corridor protection zones by promoting conservation options for landowners, \nsuch as conservation easements and Transfer of Development Rights (TDRs).  \nCurrently, Mississippi does not have statutes that favor TDRs.  One recommendation of \nthe Governor’s commission is to consider a change the state statutes.  If they are \nchanged, the City would need to specify the donor areas for TDRs.  In future, be sure \nthat Turkey Creek is identified as a donor site for TDRs in City of Gulfport.   \n Proposed Timeline: 2008   \n Possible Lead organizations: LTMCP, TCCI, NGCC and City of Gulfport \n \n5. Work with City of Gulfport to support, revise if needed and enforce a city-wide tree \nprotection ordinance in Gulfport.   \n Proposed Timeline: 2007   \n Possible Lead organizations: Turkey Creekkeeper, LTMCP, MS Urban Forestry \nCouncil  \n \n6. Provide education about streamside buffers and need to protect and enhance the \nnative tree canopy, particularly in the 250 – 500 foot streamside management zone \nalong Turkey Creek. Focus on native hardwood trees and shrubs typical of coastal plain \nhabitats.  \n Proposed Timeline: 2008   \n Possible Lead organizations: TCCI, MS Urban Forestry Council, LTMCP \n \n7. Wetland protection is of primary importance to flood control and protection of Turkey \nCreek watershed.  Establish a “Creekkeeper” program to review wetland permits and \nreport wetland violations to regulatory agencies. \n Proposed Timeline:  announced October, 2006\n!  \n Lead organization:  TCCI \n \n8. Promote the implementation of student-led designs for biking paths in City of Long \nBeach using canals to link schools with residential communities and ball parks.  This is \nan important strategy for City of Long Beach (canals) as well as North Gulfport and \nTurkey Creek Community.  \n Proposed Timeline:  2008 \n Lead organizations:  City of Long Beach, City of Gulfport, TCCI and LTMCP \n \n \n \nB.  Education and Outreach strategies for Protection are listed below.  See Appendix H.   \n(Not in order of priority.) \n \n1. Working with the Education, Recreation and Public Health Taskforce of the Turkey \nCreek North Gulfport Community Plan, provide for an environmental science educator \nand coordinator for the Turkey Creek Community to implement education strategies \nput forth in this plan working through the Turkey Creek education. Recreation and \npublic health task force. \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 15 of 42    \n \n Proposed Timeline:  Fall 2006   \n Possible Lead organization:  TCCI with partial funding through MDEQ 319 or EPA \n \n2. Provide additional watershed education about Turkey Creek through updated, state of \nthe art TCCI websites.   \n Proposed Timeline:  ongoing from 2006  \n Possible Lead organization:  TCCI with assistance from MIG \n \n \n \n \n3. Host “Wetlands 101 workshop” to train local residents and contractors about how to \nrecognize a wetland and how to engage in the permitting process.   \n Timeline:  Completed September 2006!\n   \n Lead organization:  Gulf Restoration Network \n \n4. Provide a “Creekkeeper” for Turkey Creek:  local capacity to monitor water quality \nand water quantity issues, oversee “adopt-a-stream” program. \n Proposed Timeline:  2007\n \n Possible Lead organization:  TCCI\n \n \n5. Begin construction of public access to the lower reaches of the Creek (Canal Road to \nBernard Bayou).  Public access should accommodate the following activities:  bird \nwatching, canoeing, walking, biking and science education.   \nOutdoor Environmental Classroom \n Timeline:  Completed Summer 2006\n!    \n Lead organization:  Harrison County School Board, North Gulfport 7\nth\n & 8\nth\n \nGrade School, Visions Service Adventures) \nThe people who live in the North Gulfport and Turkey Creek communities have a strong vision for \nwhat they want their community to be like:  well connected to t\n\nhe natural resource base of \nTurkey Creek through a series of boardwalks, natural areas and walking/biking trails.  Just ask \nRose Johnson!   Several years ago, Rose took these photographs of Florida’s Turkey Creek  Walk.  \nNow in 2006, she continues to lead her community to achieve its dreams. \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 16 of 42    \n \nMt. Pleasant UMC’s Turkey Creek Nature Area (Audubon Birding Site #24) \n Proposed Timeline -:  begin summer 2006   \n Lead organizations:  Mt. Pleasant UMC, TCCI, Audubon \n   \n6. Provide interpretation at public access points: (coordinated visual cues:  brochures, \nmaps, and signage for recreational activities such as canoeing, fishing, bird watching).  \n Proposed Timeline:  Spring 2007   \n Possible Lead organizations: TCCI, Audubon Mississippi \n  \n7. Provide public fishing piers on the Creek.  \n Proposed Timeline:  Begin Fall 2006  \n Possible Lead organization:  TCCI and MS Wildlife Fisheries and Parks \n \n8. Provide enhanced public access to Turkey Creek by creating walking trails to connect \nschools, parks, neighborhoods and businesses.  Leverage Mississippi Tidelands Funds \nalready allocated to Turkey Creek (for example, at the Forrest Heights levee). \n Possible Timeline:  Summer 2006 \n Possible Lead organizations:  Gulfport Airport, City of Gulfport, TCCI  \n \n9. Work with Forrest Heights Boys and Girls Clubs, Harrison County and City of Gulfport \nto maximize connectivity between the new clubhouse, the Youther Lee Keyes Park and \nthe proposed levee trail.  Painted bicycle crossing at Ohio. \n Proposed Timeline:  Begin in 2007. \n Possible Lead organization:  Forrest Heights Homeowners and Renters \nAssociation, TCCI \n \n10.  Provide signage where federal, state, county and city roads cross into the Turkey \nCreek Watershed (see EPA program).  “You are entering the Turkey Creek Watershed”.  \n Possible Timeline:  2007   \n Lead organizations:  MDEQ, EPA and MDOT \n \n11. Identify other signage needs and messages that will provide long-term watershed \neducation and promote Personal Responsibility in a Desirable Environment (PRIDE). \n Timeline:  ongoing.   \n Lead organizations:  Mt. Pleasant UMC Environmental Ministry and Mississippi \nGulf Coast Affiliate of Keep Mississippi Beautiful \n \n12. Make Turkey Creek a Gateway for visitors to City of Gulfport and Mississippi Gulf \nCoast.  Beautify Hwy 49 corridor.  Tie-in to the native nursery goal. \n Timeline: Begin Fall 2006 \n Lead organization:  North Gulfport Community Land Conservancy, Land Trust \nfor Mississippi Coastal Plain, Audubon Mississippi, NRCS, City of Gulfport \n \n13. Schedule the Watershed Harmony Puppet show for Turkey Creek community (at the 7\nth\n \nand 8\nth\n grade school.  Charles Dubra is the principal).  \n Timeline:  fall 2006      \n Lead organization:  MDEQ \n \n14. Expand the “Turkey Creek Cane Pole Derby” and “Creek Sweep” for 2006.   \n Timeline:  summer 2006   \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 17 of 42    \n \n Lead organization:  TCCI \n \n15. Create the first Turkey Creek Heritage Festival (possibly to coincide with annual Mt. \nPleasant Anniversary, first weekend in August).   \n Timeline:  summer 2007   \n Lead organization:  TCCI in partnership with Mt. Pleasant UMC and South \nMississippi Heritage Program (DMR)  \n \n \n \n \nII.     RESTORATION GOAL   \n \nTo actively initiate or \naccelerate the recovery \nof the ecological and \ncultural health, integrity \nand sustainability of the \nTurkey Creek Watershed \nwherever it has been \ndegraded, damaged or \ndestroyed. \n \n \nA.   Management:  Restoration strategies listed below.  (Not in order of priority.) \n \n1. Forrest Heights levee restoration and re-engineering of levees. (restored and approved \nand  tied  to  the  greenway  concept).    The  community  wants  it  to  be  an  ecologically  \nfunctional,  visibly  appealing  and  publicly  accessible  component  of  the  Turkey  Creek  \nGreenway. \n Timeline:  begin in second round of MSCIP projects    \n Lead organizations:  NRCS, City of Gulfport, NGCC, TCCU \n \n2. Proactively guide the post-Katrina debris removal on Turkey Creek for canoeing and \nfishing passage.  Work with the three agencies assigned to the debris removal to \nassure that all actions taken are administered in an environmentally friendly manner:  \nHarrison County Board of Supervisors, Mississippi Department of Marine Resources and \nNatural Resources Conservation Services \n Timeline:  begin springs and summer 2006   \n Lead organization:  Turkey Creekkeeper, MDMR, NRCS, Army COE \n \n3. Design and implement bayhead swamp restoration project at Mt. Pleasant UMC’s \nTurkey Creek Nature Area (Audubon Birding Site #24).  This identified restoration \nproject will provide flood storage during storm events and reduce non-point source \npollution by filtering storm water.  Ecological restoration of this area will enhance the \nrecreational fishing opportunities at this historic fishing hole.  It will also provide \nimportant wildlife habitat, particularly bird habitat for the Audubon Coastal Birding \nTrail site located here.  \n Timeline:  planning to begin winter 2007   \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 18 of 42    \n \n Lead organizations:  Mt. Pleasant UMC, Audubon and MDMR (proposal to Coastal \nPreserves)                                                                                                                                                                                                                  \n \n4. Establish an aggressive cogongrass eradication program at “Camp Cogon”, an area \nbetween Rippy Road, Three Rivers Road, Airport Crash Zone and fuel storage tanks.  \nThis cogongrass infestation not only degrades wildlife habitat and biodiversity, it also \nposes a major public safety threat because of the increased risk of higher intensity \nwildfires.  Work with Airport, NRCS, City and County Public Safety Officials to \nrecognize and mitigate the public safety concerns raised by the cogongrass fields.  \n Timeline:  Spring 2006  \n Lead organizations:  NRCS, Airport \n \n5. Design and implement an urban forest renewal program (tree planting plan) focused \non tree plantings same comments as before (such as live oak, cypress, cedar, \nmagnolia, bay, green ash, red maple, cherry bark oak.) at the following sites:   \na. Forrest Heights Baptist Church, on the creek's south bank \nb. Forrest Heights levee,  \nc. Forrest Heights Boys and Girls Club \nd. North Gulfport 7\nth\n and 8\nth\n Grade School \ne. Will Skinner's land, south side of the creek,  \nf. Derrick Evan’s vacant 7 acres from Rippy Road south (200' x 1600'),  \ng. MLK Boulevard,  \nh. North Gulfport side streets,  \ni. LC Jones Public Housing Project,  \nj. Mt. Pleasant UMC’s Turkey Creek Nature Area (Audubon Birding Site #24), \nk. Sites at Gulfport/Biloxi Airport, as identified by airport, \nl. Louisiana Avenue drainage project, \nm. Three Rivers – Creosote Road corridor. \n Timeline:  begin in fall 2006  \n Lead organizations:  Audubon, LTMCP and MS Urban Forestry Council \n \n6. Work with the Airport to reforest the RPZ Zone and other properties with native shrubs \nand grasses (trees where allowable).  Currently airport has funding for noise reduction \n– trees and shrubs would certainly reduce noise pollution.  An on-going productive \ndialogue with the airport could be a key element to success of the Turkey Creek \nWatershed Implementation Plan.   \n Timeline:  begin discussions with airport in 2006   \n Lead organizations:  LTMCP, TCCI and NGCC \n \nAlso, work with the airport to mitigate within the watershed.  Consider asking COE to \nestablish an in-lieu program? \n \n7. Expand and utilize Turkey Creek Native Plant Nursery to promote and facilitate urban \nreforestation.   \n Timeline:  begin in fall 2006   \n Lead organizations:  Audubon, MS Urban Forestry Council and NRCS \n \n8. Clean-up neighborhood ditches and restore filtering function with native vegetation \nsuch as duck potato.  Install screens on culverts to trap trash and keep it out of the \nCreek.  Stencil storm drains.  \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 19 of 42    \n \nTimeline:  First annual, “Remarkable Riches of Splendid Ditches” celebration and \nwatershed-wide creek and ditch clean-up.  May 2007  \nLead organization:  TCCI \n \n9. Work to meet the TMDL for fecal coliform by removing point sources (get the Canal \nRoad Mobile Home Park to connect to public sewerage.)  Timeline:  on-going discussion   \n Lead organizations:  Harrison County.  MS Health Department.  MDEQ   \n \n10. Advocate for cleaner water:  We need to meet or exceed the TMDL for fecal coliform \nby minimizing non-point sources (reducing the number of failing septic systems).  \nPrivate entities do not have the ability to take direct action on failing septic systems; \nthey can however work diligently to keep the issue and desired future condition in the \nminds and actions of politicians and regulatory agencies.    Specifically, public \ninfrastructure needs to be created and regulations enforced to (a) get Ridgecrest \nEstates to stop discharging into a sewerage lagoon, (b)get City of Gulfport to reduce \naccidental spills during flood events, (c) stop new septic systems from going online. \n Timeline:  on-going advocacy, decision-maker education  \n Lead organizations: Turkey Creekkeeper with MS Health Department.  MDEQ.  \nHarrison County Board of Supervisors, City of Gulfport \n \n11. Take action for cleaner water:  We need to meet or exceed the TMDL for pH by \nincreasing riparian buffer zones and reducing storm-water runoff. \n Timeline:  on-going advocacy, decision-maker education  \n Lead organization to increase riparian buffer zones:  LTMCP, Harrison County \nBoard of Supervisors \n \n12. Take action for cleaner water:  We need to meet the TMDL for pH by reducing pine \nneedle litter resulting in higher soil pH in addition to reducing fire hazard and \nincreasing wildlife habitat.   \n Timeline:  on-going advocacy, decision-maker education  \n Lead organization:  MS Forestry Commission, NRCS, Prescribed Fire Cooperative \n \n13. Assess geomorphic stability of Turkey Creek, identify stream bank/channel restoration \ndemonstration areas and implement a one-mile passive stream restoration project\n.  \nIdentify areas to restore tidal marshes and wetlands creating additional storm water \nstorage capacity in riparian zone.  Rip rap is ugly:  Design and construct more effective \nand aesthetic bank stabilization methods.  Identify areas where rip-rap needs to be \nremoved and natural stream stabilization technology utilized.   \n Timeline:  begin winter 2007   \n Lead organizations:  possible – TCCI or  LTMCP with funding from MDEQ/EPA \n \n14. Work to complete proposed “green design” subdivision model in Bayou Bernard \nheadwaters near County Farm Road and implement a native vegetation restoration.  \nThe tract was recently cutover and is now slated for a residential development.  It \nneeds restoration and long-term protection of wetlands through fee simple donation or \nconservation easement donation.  Project to serve as a model project for future \ndevelopment in the Turkey Creek Watershed, particularly on the 28\nth\n street corridor.  \nRef:  the items under protection.   \n Timeline: 2006 and early 2007   \n Lead organization:  LTMCP.  Work in progress \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 20 of 42    \n \n \n \nB.  Education and Outreach Strategies for Restoration are listed below.  (Not in order of  \npriority.) \n \n1. Expand “CreekSweep”  2006 (September coastal cleanup).    \n Timeline:  September 2006   \n Lead organization:  TCCI \n \n2. Advocate for the completion of clean-up at primary brownfield restoration sites:  \ncreosote plant, Seabee base (agent orange contamination), Teledyne Irby Steel, \nChemFax, WC Fore Trucking, public dump off Canal Road and Stanbro site on creek at \nWashington Avenue.   \n Timeline:  ongoing discussion   \n Lead organization:  Turkey Creek Keeper, Sierra Club, Gulf Restoration Network \n(GRN), TCCI \n \n3. Advocate to minimize/reduce impact of Airport’s expansion plans, especially car \nwash/car rental (12 acres).   \n Timeline:  ongoing discussion  \n Lead organization:  Turkey Creekkeeper \n \n4. Advocate for light industrial zoning as opposed to heavy industrial zoning, for example \nArkansas Avenue.   \n Timeline:  now with Smart Code discussions with City of Gulfport   \n Lead organization:  Turkey Creekkeeper and City of Gulfport \n \n5. In a productive manner, address the public’s concern about air and water quality \nissues caused by the concrete plant on Creosote Road.  \n Timeline:  ongoing discussion   \n Lead organizations:  Turkey Creekkeeper, MDEQ and EPA \n \n6. Plan the first annual “Remarkable Riches of Splendid Ditches” celebration and \nwatershed-wide ditch clean-up to be held in May 2007.   \n Timeline:  planning new event should begin in late winter 2007   \n Lead organization:  TCCI \n \n7. Advocate for DEQ to change use designation of Turkey Creek from Fish and Wildlife \nSupport to Recreation, making it safer for those swimming/immersion.   \n Timeline:  begin discussion with this watershed implementation plan   \n Lead organization:  Turkey Creek Keeper and TCCI \n \n8. Provide educational opportunities to private landowners about (1) Best Management \nPractices such as forestry, construction and streamside management (2) Conservation \noptions for landowners, such as conservation easements, transfer of development \nrights, fee simple donations.   \n Timeline:  begin planning a series of workshops for 2007 or 2008   \n Lead organizations:  LTMCP, NRCS and TCCI \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 21 of 42    \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 22 of 42    \n \n \nVI.    WATERSHED IMPLEMENTATION PLAN – BUDGET ESTIMATES \n \n \nRough Budget estimates \n              \nTurkey Creek Watershed Implementation Plan \n  \n$70,000.00     for     \n         \n*1 New capacity \n         \nTurkey Creekkeeper \nI.  PROTECTION GOAL: \n    \n$108,500.00     for     \nA1. acquire identified conservation areas, TC Greenway  $1,470,000.00 \n*2 New Capacity \n CIAP I acquisitions. Work not completed funding already allocated $60,000.00 \n Education staff \nA2. Green subdivision model; conservation easement, 28th st $2,500.00      \nA3. Green subdivision model; conservation easement, Bernard Bayou $2,500.00 *2  \nA4. Education about conservation options for Landowners $1,200.00      \n Support statewide legislative action to allow TDRs  $1,300.00   \nA5. Advocate and support City tree protection ordinance - Creekkeeper $2,500.00 *1  \nA6. Education about streamside buffer and urban forests $2,500.00 *2  \nA7. New capacity:  Creekkeeper to review wetland permits $25,000.00 *1  \nA8.     Promote     walking/biking     paths     for Long Beach canals $25,000.00 *2  \n       \nSubtotal: $1,592,500.00                                          \n              \nB1. New capacity: environmental science education coordinator  $25,000.00 *2  \nB2. passive education thru website   $6,000.00   \nB3.     Wetlands     101workshop                       $850.00               \nB4. Creekkeeper to monitor water quality   $25,000.00 *1  \nB5. Greenways construction of public access  $95,000.00   \nB6. Interpretation of Greenway and public access: maps, signage $10,000.00 *2  \nB7. Fishing piers - included in B5   $0.00   \nB8 Coordinate building of walking,biking trails  $7,500.00 *2  \nB9 Build and enhance connectors, walk/bike on levees  $15,000.00   \nB10    Highway signage:  \"you are entering...\"   $7,500.00   \nB11    Printing:  signage and other educational materials  $2,500.00   \nB12    Create Gateway to City of Gulport   $15,000.00   \nB13    MDEQ    Puppet    Show                $2,500.00            \nB14    Turkey Creek Cane Pole Derby   $1,000.00 *2  \nB15    Develop a Turkey Creek Heritage Festival  $35,000.00   \n       \nSubtotal: $247,850.00                                          \n              \nII.  RESTORATION GOAL: \n          \nA1..    Restore Forrest Heights levee   $45,000.00   \nA2. Guide debris removal from Creek   $2,500.00 *1  \nA3. Bayhead reforestation at Mt. Pleasant/Audubo\n\nn site  $250,000.00   \nA4.     Cogongrass     eradication     program               $18,000.00     *2  \nA5. Urban Forest Renewal Program   $7,500.00 *2  \nA6.     Airport     revegetation                    $25,000.00               \nA7. Native plant nursery    $10,000.00   \nA8.     Ditch     cleanup                         $3,500.00     *2  \nA9:     TMDL     fecal                    $2,500.00     *1  \nA10    TMDL    fecal                 $2,500.00    *1  \nA11    TMDL    PH    \n(buffer zone creation funded under \nprotection)                                                                $5,000.00                                                                                                                                                                                                \nA12    TMDL    PH                   $15,000.00            \nA13    Gemorph assessment and bank stabilization, 1 mile $240,000.00   \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 23 of 42    \n \nA14    Restoration of native vegetation on easement: bernard bayou $25,000.00   \n       \nSubtotal: $651,500.00                                          \n              \nB1 \nCreeksweep - \nCreekkeeper                                                                                                    $5,000.00                         *2  \nB2 Advocate for brownfield restoration - Creekkeeper  $10,000.00 *1  \nB3 Advocate for reduced airport impacts   included in B2   \nB4 Advocate for light industrial zoning   included in B2   \nB5 Advocate for cleaner water/air at concrete plant  included in B2   \nB6 Remarkable riches of splendid ditches   $1,000.00 *2  \nB7 Change use designation    included in B2   \nB8 Educational ops for private landowners   $5,000.00\n   \n       \nSubtotal: $21,000.00                                          \n              \n       \n  $2,512,850.00                                          \n \n \n \nVII.    WATERSHED IMPLEMENTATION PLAN – SCHEDULE AND MILESTONES \n \nProposed timeline for discussion is listed with each strategy.  Before timeline and budget can \nbe refined, lead organizations need to be confirmed or identified.  Lead organizations would \nneed to provide final timelines and budget estimates. \n \nHowever, completion of several strategies hinge on the establishment of two programs within \nthe TCCI:  (1) an environmental education/stewardship program at an estimated cost of \n$90,500 per year, and a (2) Creek Keeper program at an estimated cost of $30,000 per year.  \nThe establishment of both these programs is recommended in order to assure completion and \nsemi-annual review and revision of the watershed implementation plan. \n \nVIII.    EVALUATION    \n \n A. Monitoring and Assessment of progress  \n \nInterim milestones must be established to determine whether management measures are \nbeing implemented. \n \nEach strategy shall be assessed semi-annually by the steering committee (watershed \nimplementation team).  The lead organization and primary partners for each strategy shall \nidentify the measures of success and methods of evaluation for each strategy. \n \n B. Evaluation, Adaptations and Revisions of Plan \n• Specific evaluation tools must be developed to measure progress \ntoward reducing pollutant loads and meeting watershed goals \n• Evaluation tool for every event.   \n• Semi-annual evaluation of progress on timeline.  Education, \nRecreation and Health committee will review plan and recommend \nplan revisions to the steering committee. \n    \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 24 of 42    \n \n \n \nAppendix A \n \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 25 of 42    \n \nAppendix B \n \n2004 Turkey Creek Watershed Greenway \nPublic Education and Input Summary Report \nDecember 20, 2004 \n \n \nBackground \n \nIn response to concerns regarding stormwater management and natural resource conservation \nexpressed by numerous Harrison County residents and business owners, the Harrison County Board of \nSupervisors authorized the Land Trust for the Mississippi Coastal Plain to provide a public education \nprogram about greenways and to identify whether citizens of the Turkey Creek Watershed are interested \nin establishing one as a framework for addressing shared public policy concerns.  \n \nThrough a series of public forums and individual stakeholder meetings conducted in the Fall of 2004, \nrepresentatives of the Land Trust shared information about the general purposes of greenways, the \nvarious processes for establishing them, and the benefits such organizations offer communities.  Through \nguided discussions and written surveys, Harrison County citizens reached a consensus about what they \nbelieve are Turkey Creek Watershed’s most critical needs and then they identified workable solutions to \naddress these problems in ways that will support balanced development.    \n \nStakeholder Meetings \n \nTo insure a broad base of support for the public education program, Land Trust representatives began \nthe process by meeting with stakeholders in both Long Beach and Gulfport as well as unincorporated \nparts of Harrison County.  Long Beach’s Mayor Skellie asked several aldermen and key members of his \nstaff to attend an informational meeting with the Land Trust and George Carbo, Urban Development \nDirector for the City of Gulfport, met with Land Trust early in the process to familiarize himself with the \nobjectives of the program and to share information.  Gulfport-Biloxi International Airport officials \nexpressed support and a willingness to participate in the greenway program, as did Turkey Creek \nCommunity Initiatives members.   The Land Trust also met with numerous property owners to discuss the \nbenefits of establishing a greenway and to encourage their participation in the public forums.  \n \nWindshield Survey \n \nOver a one-week period in October 2004, the Land Trust conducted a windshield survey of the Turkey \nCreek Watershed to identify existing land uses and to document through photographs assets and \nliabilities.  These photographs were incorporated into powerpoint presentations at each of the public \nforums to help citizens better understand how residential, commercial and industrial land uses impact one \nanother within the relatively small geographic area of the watershed.    \n \nPublic Forums \n \nA series of three public forums was conducted by the Land Trust, with the times, dates and locations \ndetermined by input from citizens and public officials to encourage the broadest participation of \nstakeholders.   \n - The first forum was held at 6 p.m., Thursday, October 14 at the West Harrison County \nCommunity Center on Espy Avenue in Long Beach.   \n- The second forum was held at 6 p.m., Thursday, October 21 at the same location.   \n- The third forum was conducted at 4 p.m., Tuesday, October 26 at North Gulfport Middle School.   \n  \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 26 of 42    \n \nA fourth meeting was held at 6 p.m., Monday, December 13 at the Isiah Fredericks Community Center in \nGulfport, to present a summary of citizen input from the forums and to discuss the formation of the Turkey \nCreek Watershed Coalition. \n \nPublic Notice\n \n \nFliers promoting each of the forums were posted throughout Harrison County in places such as the \ncourthouse, Long Beach and Gulfport City Halls, libraries and chambers of commerce, public schools, \nchurches and community centers.  Press releases were published in the Sun Herald\n and meeting notices \nran daily in the newspaper’s community calendar one week before each meeting.  A postcard detailing \nthe time and location of the fourth forum was mailed to each person who signed in at the first three \nmeetings. \n \nIn addition to the citizens who live and/or work in the watershed, participants in this public process \nincluding elected officials and employees of both city and county government, state agency \nrepresentatives from the Mississippi Department of Environmental Quality, Mississippi Museum of Natural \nScience, Mississippi Department of Wildlife, Fisheries and Parks, Mississippi State University Extension \nService, Mississippi Department of Marine Resources, and representatives from the U.S. Corps of \nEngineers, Southern Mississippi Planning and Development District, and the Sierra Club.   \n \nA copy of the fliers, meeting notices and sign-in sheets from each of the public forums is included as an \nattachment. \n \nPrinciples for Conduct\n \n \nAt the beginning of each meeting, participants were asked to review and agree to abide by the principles \nidentified below to insure a civil discourse and effective exchange of information and ideas about \nestablishing a Turkey Creek Watershed Greenway.   \n• Create a process open to all \n• Recognize and preserve every idea \n• Rely on the wisdom of the community \n• Respect both the simplicities and the complexities of the process \n• Eliminate all barriers to sincere and honest dialogue \n• Create cooperation among diverse groups \n• Develop workable solutions through the creation of real projects \n• Insist on diversity \n• Accept responsibility for the consequences of the vision \n•           Establish           trust           \n \n \nAgenda\n \n \nA written agenda was distributed at each forum to provide focus to the public education and input \nprocess.  At all of the meetings, information about the mission and goals of the Land Trust for the \nMississippi Coastal Plain was shared through a powerpoint presentation to define the nonprofit’s role as \nan educational  facilitator.    \n \nDuring the first three meetings, the Land Trust identified what a greenway is and how such a program \nmay help address local land use concerns.  The process for establishing a greenway was discussed, \nalong with information about the variety of greenway programs currently operating across the country.  \n \nAt the first two forums, participants were asked to prioritize the issues that they would like to see \naddressed through a greenway program and to identify reasonable ways to address these concerns. After \nmuch discussion, consensus was reached that the following are the watershed’s top four critical needs: \n1.          Enhanced          recreational          opportunities          \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 27 of 42    \n \n2. Opportunities for environmental preservation & conservation \n3.          Improved          stormwater          management          \n4. Balanced residential growth with industrial & commercial development \n \nAt the third forum, these top needs were reviewed and participants were asked if they concurred with the \nconsensus reached by participants in the first two meetings.  Consensus was confirmed and then the \nLand Trust facilitated a discussion to identify citizens’  top five preferred ways to address these needs, \nwith the following results. \n \n1.   Top 5 ways to enhance recreational opportunities: \n  - provide nature trails \n  - improve water quality \n  - provide boardwalks \n  - link recreational activities to schools & communities to expand \n usage \n  - improve safety & security \n \n2.   Top 5 opportunities for environmental preservation & conservation: \n-     improve     water     quality     \n- replant native trees \n- seek grant money to fund the greenway \n- use best management practices \n- lobby for local environmental protection, policies & ordinances \n \n3.   Top 5 ways to improve stormwater management: \n- reduce impervious paved surfaces \n- maintain natural flow of Turkey Creek \n- restore native vegetation on creek banks \n- implement smart growth \n- no more drainage routed into the creek from other agencies \n \n4.   Top 5 ways to balance residential growth with industrial & commercial development: \n- utilize abandoned buildings to reverse sprawl \n- create natural areas that link the greenway while buffering industrial land uses \n-     re-address     zoning     \n- implement smart growth to create a balance among land uses \n- update & review existing plans for future growth \n \nAt the fourth meeting, the Land Trust presented a summary of the Turkey Creek Watershed critical \nneeds and the public’s top priorities for addressing them.  Establishment of a greenway coalition, to \nprovide an organizational structure for citizen input and participation in addressing the watershed’s critical \nneeds, was identified as the next step in the process.  Proposed committees were discussed and are as \nfollows: \n \nSteering Committee - comprised of a geographically-balanced group of interested citizens each \nof whom has a vested, long-term interest in the Turkey Creek Watershed and has agreed to \nspearhead the effort to establish a Turkey Creek Watershed Greenway.  The Land Trust for the \nMississippi Coastal Plain will continue to work in support of the Greenway in an advisory capacity \nto the Steering Committee, which will work to:   \n* Develop the general vision for the Greenway and a long-term masterplan for \nimplementing it, with specifically identified short-term objectives \n* Establish a working structure for the Greenway coalition, including selecting a Steering \nCommittee chair and Standing Committee chairs and scheduling regular public meetings  \n*Adopt policies to protect the rights of property owners, promote public safety, address \ngeneral liability issues, and conserve the Greenway’s natural resources through a comprehensive \nGreenway operations and maintenance plan \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 28 of 42    \n \n*Promote cooperative working relationships between state and local governments, \nprivate citizens, property owners, nonprofit agencies, and persons living, working or attending \nschool in or near the Greenway  \n* Access public and private funding sources that are available for planning and \nimplementing the Greenway master plan \n* Develop design guidelines for signage and adopt a logo for the Greenway \n \nStanding Committees  \nWhile the Standing Committees will work in coordination and support of one another, each must \nhave specific objectives in order to achieve the comprehensive benefits of an integrated \ngreenway.  Each Standing Committees will be comprised of private citizens and representatives \nfrom government and nonprofit agencies, and at least one member of the Steering Committee.  \nEach committee chair shall be appointed by and shall report to the Steering Committee. \n \nCommunity Outreach & Education Committee:\n  to research and recommend to the Steering \nCommittee ways of educating, informing and inspiring the public about the Greenway’s multiple \nbenefits and ongoing progress.  This includes recruiting volunteers, working with schools, \nchurches, civic groups, residents and land owners, organizing special events and conducting \nregularly scheduled greenway programs and activities for community’s benefit. \n \nCompatible Planning and Growth Committee:\n  to research and recommend to the Steering \nCommittee ways of balancing residential land use with commercial and industrial development in \nthe Greenway.  This includes  supporting the enforcement of local and state government smart \ngrowth regulations and policies and creating natural areas that link the Greenway while buffering \nit from industrial development.  This committee also is responsible for researching and making \nrecommendations to the Steering Committee about encouraging the reutilization of abandoned \nbuildings to reverse sprawl, amending local zoning regulations, and updating/reviewing existing \nlocal government plans for future land use.  It also is charged with working with the Harrison \nCounty Smart Growth Initiative as it applies to the Turkey Creek Watershed area. \n \nStormwater Management Committee\n:  to research and recommend to the Steering Committee \nways of assisting other agencies in identifying alyternmatives to routing increased drainage loads \ninto Turkey Creek.  This inclides researcxhing and advocating the minimization of impervious \nsurfaces in the Greenway; maintaining the natural flow of Turkey Creek; restoring native \nvegetation on creek banks, wetlands, etc; and supporting local and state government regulations, \nsmart growth policies and Best Management Practices related to stormwater management. \n \nNatural Resource Conservation Committee\n: to assess and evaluate the Greenway’s natural \nresources, identify opportunities for conservation and/or restoration, advocate and incorporate the \nuse of Best Management Practices in the Gr\n\neenway, support local and state policies and \nregulations that protect the environment, and promote the above means as important and \neffective ways of improving stormwater management, water quality and other desirable public \nbenefits \n \n  \nWritten Surveys\n \n \nTo supplement verbal input recorded at the first two forums, participants were encouraged to complete a \nwritten survey that ranked individual priorities and provided basic demographic information.  Respondents \nhad the options of completing the survey at the forum, turning it in at the next meeting, or mailing it to the \nLand Trust office.  \n \nA total of 27 completed surveys were submitted during the process, with the following responses.  A copy \nof a blank survey form is attached. \n \nSurvey Summary: \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 29 of 42    \n \n \nScale: \n1    This item is important to me \n2    This item is less important to me \n3    This item is not important to me \n \n1           2           3\n \n27   protect water quality of streams and wetlands \n25  1  protect wildlife and native habitats \n17 8 1 provide recreation areas to canoe, fish and hike \n20 6  acquire land to be conserved as natural areas \n25           1           1           protect           floodplain           areas           \n21 5  preserve archaeological and cultural heritage resources   \n18 6 1 provide opportunities for ongoing environmental education \n6   other, please specify & rank:   \n                                                    -             encourage             residents’             participation             \n    - provide outdoor recreation of all kinds \n                                                    -             plant             more             native             trees             \n                                                    -             provide             campsites,             outdoor             classrooms             \n    - prevent flooding by preserving rather than developing \n    - preserving cultural heritages, history & communities is \n very important \n    - stabilize or improve the water quality   \n- construct bicycle trails \n    - prevent further soil contamination from creosote plant \n    \nRecreational Areas \nHow many times have you or your family used the following types of recreational space in the last six \nmonths? \n \npicnic facility    1 survey 8 times; 1 – 5 times; 6 - 3 times; 2 – 2 times; 4 - 1 time     \n  \nfishing area 1 survey 15 times; 2 -13 times; 2 - 12 times; 2  - 4 times; 2 – 3 \n times; 3 - 2 times; 3 - 1 time \ncanoeing/boating 1 survey 180 times;  1 – 15 times; 1 – 12 times; 1 – 10 times;  \n4 – 3 times; 2 – 2 times; 2 – 1 time  \nplayground   2 surveys 10 times; 1 – 8 times; 1 – 6 times; 1 – 3 times; 1 – 2 \n times; 3 – 1 time    \nhiking trail  1 survey 30 times; 1 – 10 times; 4 – 6 times; 2 – 4 times; 1 – 3 \n times; 2 – 2 times; 4 – 1 time      \nwaterfront boardwalk 2 surveys 20 times; 1 – 14 times; 1 – 10 times; 1 – 5 times; 3 – 4 \n times; 2  – 3 times; 2 – 2 times; 3 – 1 time  \ncampground     1 survey 4 times; 1 - 2 times; 1 -1 time          \nother, please identify: 2 surveys:  parks for tree identification, bird watching & star gazing \n      1 survey: walking trai \n \n \n \nWhat would encourage you to use public recreation space more often? \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 30 of 42    \n \n13 responses  closer proximity to your home   \n10 responses better maintenance of areas \n15 responses improved security/safety    \n12 responses additional recreation choices (canoeing & hiking written in on 1 survey) \n5 responses other, please explain:   \n - better information at trails; more detailed online information about resources \n - boat ramp; cleaner water \n - marked trails for length & plant species \n - woods biking \n - trails or pathways; sidewalks; bikeways to connect recreation areas \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 31 of 42    \n \n \nAppendix C \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 32 of 42    \n \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 33 of 42    \n \nAppendix D \n \n \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 34 of 42    \n \nAppendix E \n \n \n \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 35 of 42    \n \nAppendix F \nNATURAL HERITAGE LIST \n \nThe tables below contain a Natural Heritage Inventory – Mississippi Museum of Natural Science \nrepresentative of Harrison County and thus for the Turkey Creek watershed.  This list is not meant to be \ncomprehensive, but list species of “special concern”. \n \nPlant species  \nScientific Name Common Name Global Rank State Rank \nAGALINIS APHYLLA COASTAL PLAIN FALSE-\nFOXGLOVE \nG3G4                     S2S3                     \nAGALINIS FILICAULIS THIN STEMMED FALSE-\nFOXGLOVE \nG3G4                     S2?                     \nAGRIMONIA INCISA INCISED GROOVEBUR G3 S3S4 \nANDROPOGON \nPERANGUSTATUS \nELLIOTT'S BLUESTEM (VAR.2) G5T3T4 S1? \nARISTIDA CONDENSATA SANDHILLS THREE AWN G4? S3S4 \n      \nBURMANNIA BIFLORA NORTHERN BURMANNIA G4G5 S3S4 \nCALOPOGON BARBATUS BEARDED GRASS-PINK G4? S2S3 \nCAREX EXILIS COAST SEDGE G5 S2 \nCHAMAECRISTA DEERINGIANA FLORIDA SENNA G1G2 S1 \nCLEISTES DIVARICATA SPREADING POGONIA G4 S3 \nCOREOPSIS BASALIS GOLDEN-MANE TICKSEED G5 S1? \nDICHANTHELIUM \nERECTIFOLIUM \nERECT-LEAF WITCHGRASS G4 S3S4 \nELYONURUS TRIPSACOIDES PAN AMERICAN BALSAMSCALE G5? SH \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 36 of 42    \n \nEPIDENDRUM CONOPSEUM GREEN-FLY ORCHID G4 S2 \nERIOCAULON TEXENSE TEXAS PIPEWORT G4 S2S3 \nGAYLUSSACIA FRONDOSA DANGLEBERRY                                  G5                                  S2S3                                  \nHELIANTHEMUM ARENICOLA GULF ROCKROSE G3 S1S2 \nILEX AMELANCHIER JUNEBERRY HOLLY G4 S3 \nILEX CASSINE DAHOON HOLLY G5 S2 \nILEX MYRTIFOLIA MYRTLE HOLLY G5? S3S4 \nIPOMOEA PES-CAPRAE RAILROAD VINE G5 S2S3 \nISOETES LOUISIANENSIS LOUISIANA QUILLWORT G3 S2 \nJUNIPERUS SILICICOLA SOUTHERN RED CEDAR G5T4T5 S2 \nLACHNOCAULON DIGYNUM PINELAND BOGBUTTON G3 S2 \nLILAEOPSIS CAROLINENSIS CAROLINA LILAEOPSIS G3G5 S2S3 \nLINDERA SUBCORIACEA BOG SPICE BUSH G2 S2 \nLINUM MACROCARPUM LARGE FRUITED FLAX G2? S2 \nLYCOPODIUM CERNUUM NODDING CLUBMOSS G5 S2 \nMACRANTHERA FLAMMEA FLAME FLOWER G3 S3? \nMELANTHIUM VIRGINICUM VIRGINIA BUNCHFLOWER G5 S2S3 \nMIKANIA CORDIFOLIA FLORIDA KEYS HEMPVINE G5 S3S4 \nPANICUM NUDICAULE NAKED-STEMMED PANIC GRASS    G3Q S2 \nPARONYCHIA ERECTA BEACH SAND-SQUARES                  G3G4                     S1S2                  \nPASPALUM MONOSTACHYUM GULFDUNE PASPALUM G4? SU \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 37 of 42    \n \nPELTANDRA SAGITTIFOLIA WHITE ARUM G3G4 S2S3 \nPETALOSTEMON GRACILIS PINE BARRENS PRAIRIE CLOVER    G5T3T4 S2S3 \nPHYSALIS ANGUSTIFOLIA COAST GROUND-CHERRY G3G4 S3S4 \nPINGUICULA PLANIFOLIA CHAPMAN'S BUTTERWORT G3? S2 \nPINGUICULA PRIMULIFLORA SOUTHERN BUTTERWORT G3G4 S3 \nPLATANTHERA \nBLEPHARIGLOTTIS \nLARGE WHITE FRINGED ORCHID G4G5                     S2                     \nPLATANTHERA CRISTATA CRESTED FRINGED ORCHID G5 S3 \nPLATANTHERA INTEGRA YELLOW FRINGELESS ORCHID G3G4 S3S4 \nPOLANISIA TENUIFOLIA SLENDER-LEAF CLAMMY-WEED G5 S1S2 \nPOLYGALA HOOKERI HOOKER'S MILKWORT G3 S1S2 \nQUERCUS MYRTIFOLIA MYRTLE-LEAF OAK G5 S1? \nRHYNCHOSPORA MACRA LARGE BEAKRUSH G3 S3 \nRHYNCHOSPORA STENOPHYLLA CHAPMAN BEAKRUSH G4 S1? \nRUELLIA NOCTIFLORA NIGHT-FLOWERING RUELLIA G2 S2 \nRUELLIA PEDUNCULATA SSP \nPINETORUM \nPINE BARREN RUELLIA G5T3? S3 \nSARRACENIA LEUCOPHYLLA CRIMSON PITCHER-PLANT G3 S2S3 \nSORGHASTRUM \nAPALACHICOLENSE \nOPEN INDIAN GRASS G3Q S3 \nSPIRANTHES LONGILABRIS GIANT SPIRAL LADIES'-\nTRESSES \nG3                          S2S3                          \nSTEWARTIA MALACODENDRON   SILKY CAMELLIA G4 S3S4 \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 38 of 42    \n \nSTYLISMA AQUATICA WATER SOUTHERN MORNING-\nGLORY \nG4                          S1                          \nSYNGONANTHUS FLAVIDULUS    YELLOW PIPEWORT G5 S2? \nUTRICULARIA PURPUREA PURPLE BLADDERWORT G5 S2S3 \nXYRIS CHAPMANII CHAPMAN'S YELLOW-EYED \nGRASS \nG3                          S2?                          \nXYRIS DRUMMONDII DRUMMOND'S YELLOW-EYED \nGRASS \nG3                          S2                          \nXYRIS FLABELLIFORMIS FAN-SHAPED YELLOW-EYED \nGRASS \nG4                          SU                          \nXYRIS SCABRIFOLIA HARPER'S YELLOW-EYED GRASS    G3 S1S2 \n \n \nAnimal Species \nScientific Name Common Name Global Rank State Rank \nACCIPITER STRIATUS SHARP-SHINNED HAWK G5 S1?B,SZN \n      \nAIMOPHILA AESTIVALIS BACHMAN'S SPARROW G3 S3?B,SZN \nANAS FULVIGULA MOTTLED DUCK G4 S3B,S4N \n      \nCHARADRIUS MELODUS PIPING PLOVER G3 SZN \nCOTURNICOPS \nNOVEBORACENSIS \nYELLOW RAIL G4 S2N \nDRYMARCHON CORAIS \nCOUPERI \nEASTERN INDIGO SNAKE G4T3 S1 \nEGRETTA RUFESCENS REDDISH EGRET G4 SZN \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 39 of 42    \n \nENNEACANTHUS GLORIOSUS BLUESPOTTED SUNFISH G5 S3 \nFALCO COLUMBARIUS MERLIN G5 SZN \nFALLICAMBARUS BYERSI LAVENDER BURROWING \nCRAYFISH \nG4                          S3                          \nFALLICAMBARUS DANIELAE SPECKLED BURROWING \nCRAYFISH \nG2                          S2                          \nFUNDULUS JENKINSI SALTMARSH TOPMINNOW G2 S3 \nGOPHERUS POLYPHEMUS GOPHER TORTOISE G3 S2 \n      \nHAEMATOPUS PALLIATUS AMERICAN OYSTERCATCHER G5 SPB,SZN \nHALIAEETUS LEUCOCEPHALUS     BALD EAGLE G4 S1B,S2N \nHETERANDRIA FORMOSA LEAST KILLIFISH G5 S3 \nHETERODON SIMUS SOUTHERN HOGNOSE SNAKE G2 SH \nLATERALLUS JAMAICENSIS BLACK RAIL G4 S2N \n      \nMACROCHELYS TEMMINCKII ALLIGATOR SNAPPING TURTLE G3G4 S3 \nMALACLEMYS TERRAPIN \nPILEATA \nMISSISSIPPI DIAMONDBACK \nTERRAPIN \nG4T3                     S2                     \nNERODIA CLARKII CLARKII GULF SALT MARSH SNAKE G4T3 S2? \nNOTROPIS CHALYBAEUS IRONCOLOR SHINER G4 S2 \nNYCTICORAX NYCTICORAX          BLACK-CROWNED          NIGHT-HERON G5                          S3?B,SZN                          \nONTHOPHAGUS POLYPHEMI ONTHOPHAGUS TORTOISE \nCOMMENSAL SCARAB BEETL \nG?                          S?                          \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 40 of 42    \n \nPANDION HALIAETUS OSPREY G5 S3B,SZN \nPELECANUS \nERYTHRORHYNCHOS \nAMERICAN WHITE PELICAN G3 S2N \nPELECANUS OCCIDENTALIS BROWN PELICAN G4 S1N \nPEROMYSCUS POLIONOTUS OLDFIELD MOUSE G5 S2S3 \nPICOIDES BOREALIS RED-COCKADED WOODPECKER G3 S1 \nPITUOPHIS MELANOLEUCUS \nLODINGI \nBLACK PINE SNAKE G4T3 S2 \nPROCAMBARUS FITZPATRICKI SPINY-TAILED CRAYFISH G2 S2 \n      \nPSEUDOTRITON MONTANUS MUD SALAMANDER G5 S2S3 \nRANA HECKSCHERI RIVER FROG G5 S1 \nRANA SEVOSA DARK GOPHER FROG G1 S1 \nREGINA RIGIDA SINICOLA GULF CRAYFISH SNAKE G5T5 S3? \nRHADINAEA FLAVILATA PINE WOODS SNAKE G4 S3? \nSTERNA ANTILLARUM LEAST TERN G4 S3B,SZN \nSTERNA MAXIMA ROYAL TERN G5 S1B,S4N \nTHRYOMANES BEWICKII BEWICK'S WREN G5 S2S3B,SZN \nTRICHECHUS MANATUS MANATEE G2 SZ \n \n \n \n \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 41 of 42    \n \n \n\nTurkey                Creek                Watershed                Implementation                Plan                                                                                                                September                2006                \n \nLand Trust for Mississippi Coastal Plain  Page 42 of 42    \n \nAppendix G \n \n \n \n \n ",
  "metadata": {
    "id": "turkey-creek-watershed-plan-2006",
    "originalName": "turkey-creek-watershed-plan-2006.pdf",
    "mergedFrom": [
      "turkey-creek-watershed-plan-2006-1.json",
      "turkey-creek-watershed-plan-2006-2.json",
      "turkey-creek-watershed-plan-2006-3.json",
      "turkey-creek-watershed-plan-2006-4.json",
      "turkey-creek-watershed-plan-2006-5.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.799Z",
    "length": 86623
  }
}