{
  "id": "upper-little-bayou-pierre-watershed-plan-2018",
  "rawText": "\n\nUpper Little Bayou Pierre GY 2018 \n1 \n \n \nUpper Little-Bayou Pierre Watershed Plan \n9 Key Elements \nHUC 080602030702 \nMWS 6031 \nGY18 Proposed Project Area \nNovember 9, 2018  \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Upper Little Bayou Pierre Watershed (080602030702) is located primarily in Claiborne \nCounty, MS, and includes the upper portion of Little Bayou Pierre which is a tributary of the \nBayou Pierre located in the South Independent Streams River Basin.  According to the 2011 \nNational Land Cover Database (NLCD), this watershed is approximately 22,120 acres and \ncontains many different land use types, including forest (75%), pasture/grassland (8%), \nscrub/barren (10%), wetland (4%), cropland (1%) and urban (3%) as is depicted in Figure 1.  \n \nThe area is predominantly forest land and is a very popular location for hunting and other \nrecreational activities such as four-wheeling and picnicking on the pretty white sandbars of the \ncreek. Little Bayou Pierre has its headwaters southeast of the town of Pattison and flows \nnorthwest to the confluence with Bayou Pierre near the city of Port Gibson crossing Claiborne, \nJefferson and Copiah Counties.  Little Bayou Pierre is the major water body in the Upper Little \nBayou Pierre watershed with smaller tributaries, like Brandywine Creek and other smaller \nunnamed streams, flowing into Little Bayou Pierre.    \n \nThe water use classification for Little Bayou Pierre and all waters in the Upper Little Bayou \nPierre Watershed, as established by the State of Mississippi Water Quality Criteria for Intrastate, \nInterstate, and Coastal Waters (MDEQ 2015) regulation, is predominantly Fish and Wildlife \nSupport. Waters with this classification are intended for fishing and propagation of fish, aquatic \nlife, and wildlife. Waters that fall within the Fish and Wildlife classification should also be \nsuitable for secondary contact recreation, which is defined as incidental contact with water \nincluding wading and occasional swimming.  However, the Little Bayou Pierre main stem is \nclassified for Recreation Use. Waters in this classification should be suitable for primary contact \nrecreational purposes, including such water contact activities as swimming and wading. \n \nThe Little Bayou Pierre (MS450E) has a long history with MS’s Section 303(d) List of Impaired \nWater Bodies and represents the entire length of the stream from its headwaters in the Upper \nLittle Bayou Pierre Watershed to the mouth at Bayou Pierre.  This water body segment was \ninitially listed as evaluated on the 1996 List due to pesticides, nutrients, siltation, and organic \nenrichment/low dissolved oxygen (DO) based primarily on review of anecdotal information and \nnot monitoring data.  The water body remained on the 1998 §303 (d) List for the same causes.  \nAlso in 1998, the segment was included on the evaluated list as impaired for the Recreation Use \ndue to pathogens.    The portion of MS450E that falls within the Upper Little Bayou Pierre \nWatershed is shown in Figure 1. \n \n\nUpper Little Bayou Pierre GY 2018 \n2 \n \n \n \nFigure 1: Upper Little Bayou Pierre Watershed Landuse, 2011 NLCD \n\nUpper Little Bayou Pierre GY 2018 \n3 \n \nIn order to make water quality assessments on wadeable streams outside of the Mississippi \nAlluvial Plain, MDEQ uses a calibrated and verified index of biological integrity (IBI) referred \nto as the Mississippi Benthic Index of Stream Quality (M-BISQ).  Using biological community \ndata and comparing it to the attainment thresholds from the M-BISQ, Upper Little Bayou Pierre \nwas assessed as impaired (segment MS450E) for Aquatic Life Use Support due to biological \nimpairment in 2002.  Due to this determination, the evaluated causes of pesticides, nutrients, \nsiltation, and organic enrichment/low dissolved oxygen (DO) based primarily on review of \nevaluated anecdotal information and not monitoring data from the 1996 and 1998 §303(d) lists \nwere removed and MS450E was included on the 2002 §303(d) List of Impaired Water Bodies for \nbiological impairment. \n \nMDEQ has a strong team of scientists and engineers focused on evaluating water quality data \nand identifying stressors in water bodies that have been listed as being biologically impaired \nusing benthic macroinvertebrate community data.  When biological community data indicate that \na water body segment is impaired, an investigative, stressor identification analysis using \nstrength-of-evidence approach is conducted to determine the cause(s) of the impairment.  Such \ncauses may range from specific pollutants (e.g. Total Nitrogen) to other causes of pollution such \nas sedimentation, habitat loss or hydrologic alteration.  In most cases, nonpoint sources \ncontribute, or are the primary causes of impairment.  MDEQ relies upon all available monitoring \nand assessment data and conducts additional monitoring to gather the necessary data and \ninformation to help determine both the causes and sources of impaired waters.  The U.S. \nEnvironmental Protection Agency (EPA) Stressor Identification Process and Stressor \nIdentification Guidance Document (USEPA, 2000), is used to identify most probable stressors \ncausing biological impairment to provide the information necessary to develop required TMDLs \nthat will guide restoration activities.    A stressor identification study was conducted on Little \nBayou Pierre in 2009.  As a result of the analysis, sediment was identified as the primary \nprobable pollutant causing the aquatic life use impairment to the stream.  This information was \nthen used to develop a Total Maximum Daily Load (TMDL) for sediment in Upper Little Bayou \nPierre. Total Maximum Daily Loads, TMDLs, are pollution budgets. A TMDL determines how \nmuch of a pollutant can be present in a stream, river, or lake without negatively affecting aquatic \nlife or public health. \n \nThere are two TMDLs for the Little Bayou Pierre segment MS450E; one is for sediment and the \nother for pathogens.  The Fecal Coliform TMDL for Bayou Pierre (MDEQ, 1999), which \nincludes Little Bayou Pierre (MS450E), was developed for the waterbodies within the larger \nBayou Pierre Watershed; however, none of the NPDES permitted facilities included in the \nTMDL are located within the Upper Little Bayou Pierre Watershed boundaries.  This TMDL \nrequires all NPDES permitted discharges of fecal coliform to meet water standards for \ndisinfection and recommends reducing fecal coliform contributions from cattle access to streams \nand failing septic systems in the watershed. \n \nIn 2009, MDEQ developed the Total Maximum Daily Load Designated in the South Independent \nStreams Basin for Impairment Due to Sediment (MDEQ, 2009), which includes the Little Bayou \nPierre waterbody segment MS450E.  There are no facilities in the Upper Little Bayou Pierre \nWatershed with NPDES permits that include limits for Total Suspended Solids (TSS) which is \nused as an indicator of sediment contributions from permitted activities. The pollutant of concern \n\nUpper Little Bayou Pierre GY 2018 \n4 \n \nfor the Little Bayou Pierre TMDL is sediment from land-use runoff. Certain contaminants may \nbe associated with sediment such as pesticides and nutrients. These contaminants were not \naddressed directly within the sediment TMDL. However, these contaminants would also be \ncontrolled by the same best management practices (BMPs) that control the sediment from \nnonpoint sources of pollution.  \n \nNonpoint loading of sediment in a water body results from the transport of material into \nreceiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion. Sources of sediment include: agriculture, silviculture, rangeland, construction sites, \nroads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream sources, \nand historical land use activities and channel alterations.  \n \nElement b: Expected Load Reduction \n \nThe Fecal Coliform TMDL for Bayou Pierre (MDEQ, 1999) was developed for the streams and \ncreeks within the larger Bayou Pierre Watershed including the Little Bayou Pierre (MS450).   \nThis TMDL requires all NPDES permitted discharges of fecal coliform, the water quality \nindicator for pathogens, to meet water standards for disinfection and recommends reducing 85% \nof the cattle access to streams and 80% reduction in fecal coliform contributions from failing \nseptic systems in the watershed. \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2015) regulation does not include a numeric water quality standard for aquatic life \nprotection due to sediment. The narrative standard for the protection of aquatic life is sufficient \nfor justification of TMDL development, but does not provide a quantifiable TMDL target. The \ntarget for the sediment TMDL is based on reference sediment yields developed by the USDA \nAgricultural Research Service’s Channel and Watershed Processes Research Unit (CWPRU) at \nthe National Sedimentation Laboratory (NSL).  Based on the ranges of stable and unstable yield \nvalues, a reduction in sediment of 95 - 98% is recommended for Upper Little Bayou. \n \nThe MDEQ will work with agency resource partners to identify and implement BMPs to address \npathogen and sediment concerns identified in the Upper Little Bayou Pierre Watershed.   The \nNatural Resource Conservation Service (NRCS) has a list of approved BMPs that address \npathogen and sediment issues and this list will be used to identify BMPs that are candidates to be \nused in the Upper Little Bayou Pierre Watershed.  Figure 2 shows recent imagery taken of the \nUpper Little Bayou Pierre watershed along with the listed segment MS450E. \n \n \n  \n\nUpper Little Bayou Pierre GY 2018 \n5 \n \n \nFigure 2: Upper Little Bayou Pierre Watershed Aerial Imagery.  \n\nUpper Little Bayou Pierre GY 2018 \n6 \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC) the local Soil and Water Conservation Districts (SWCDs), and the \nNatural Resource Conservation Service (NRCS).  These partners have been coordinating with \nlocal stakeholders to gauge landowner interest and, based on their expertise, have identified a \nsuite of BMPs that should be effective in addressing nonpoint source pollution sources in the \nUpper Little Bayou Pierre Watershed.   \n \nStaff from MSWCC and the SWCD depend upon assistance from their NRCS partners in \ndetermining landowner interest in the watershed because they are present on the farms and in the \nfields with local landowners.  These staff members also understand the conservation needs at the \nlocal level, and have knowledge of the amount of unfunded applications for federal program \nassistance which meet Section 319 eligibility requirements.  At present, the Upper Little Bayou \nPierre Watershed has TMDLs for sediment and pathogens.  Based on previous experience in \nwatersheds with similar impairments, our partners recommend installation of the following \nBMPs to help mitigate sediment and pathogen issues in the Upper Little Bayou Pierre \nWatershed: critical area planting, fencing, grade stabilization, streambank and shoreline \nprotection, grassed waterways, water and sediment control basins, instillation of tank and \ntroughs, and heavy use protection area practices. Through a collaborative effort to identify water \nquality concerns and needs within this watershed, these agencies feel the following management \nmeasures will help ensure success and mitigate pollution sources.  Those measures are as \nfollows:  \n \n1. Likely water quality benefit; \n2. Willing landowners; \n3. Implementation of the recommendations of the TMDL(s); \n4. Ease of showing effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the Initiative period); \n \nUpon receipt of funding, MDEQ will coordinate with the field staff from MSWCC in Claiborne \nCounty to target implementation in priority areas, and then move to other areas as funds allow.  \nA map depicting the landuse can be found in Figure 1 and recent imagery in Figure 2. Additional \nconsiderations for prioritization of BMPs included the positioning of BMPs with willing \nlandowners; the increased likelihood for leveraging of in-kind services; and proximity to \npollutant sources to Upper Little Bayou Pierre.   \n\nUpper Little Bayou Pierre GY 2018 \n7 \n \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project who may contribute match include MSWCC, NRCS, USGS (monitoring), \nand/or local landowners.  Generally, project planning and administration (planning, coordination \nand watershed plan revision) consumes 10-15% of the total budget, however.  Provided below is \na summary of estimated project costs for a full-scale watershed restoration.  The MSWCC \nprovided the following estimates for BMP instillation below: \nActivity Size/Amount \nEstimated \nCost \nBMPs \n    \n    Critical Area Planting 43ac @ $178 7,654 \n    Fencing \n19,930 ft. \n@$2.05 \n40,857 \n    Grade Stabilization Structure 28 ea. @ $5,000 140,000 \n    Streambank and Shoreline Protection 630ft @ $111 69,930 \n    Grassed Waterway 12ac @ $1,755 21,060 \n    Water and Sediment Control Basin 5ea @ $5,000 25,000 \n    Tank or Trough 7 ea. @ $3,000 21,000 \n    Heavy Use Area Protection 4,500 ft. @$1.00 4,500 \nMonitoring \n  \n10,000 \nEducation/Outreach \n  \n11,500 \nTechnical Assistance \n  \n25,000 \nProject Management, Implementation, Coordination, \nPlan Revision \n  \n40,000 \n   \nTotal Estimated Project Cost \n \n$416,501  \n \nTo maximize education and outreach activities and monitoring efforts, MDEQ plans to leverage \nwith existing programs already allocated for funding where possible.     \n \nElement e: Information and Education` \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor land use categories of Nonpoint Source Pollution, namely; agriculture, construction, \nforestry, on-site waste water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals and \n\nUpper Little Bayou Pierre GY 2018 \n8 \n \nliterature can be used in the Upper Little Bayou Pierre Watershed project by tailoring them to \naddress the pollutants of concern.  A positive approach is used to reach the full diversity of \npeople in the community with projects that foster a “sense of place”, a “sense of pride in \ncommunity”, and a sense of the native plants, animals, and general ecology of their region, as \nwell as, the history of the community and a sense of economics.  Stakeholders and coordinators \njoin together to participate in problem-solving, brainstorming, plan development, training \nworkshops, festival event planning, soil and water conservation field days, tree boards, poster, art \nand writing projects and other activities that promote collaboration and ownership of the \nwatershed, as well as, solutions to its problems.  The ultimate goal is to bring about behavior \nchanges and the use of “best management practices” that will improve water quality and the \noverall quality of life in the watershed.  Evaluation forms, pre-test/ post-test, surveys, and \nreporting of the number of people who attend workshops, trainings and events are among the \nmethods used to measure the success of education/information programs.  A partial list of \nMDEQ’s programs that could be used in the Upper Little Bayou Pierre watershed is listed below: \n \n Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Upper Little Bayou Pierre Watershed. \n Watershed Harmony Mobile Classroom - for age’s kindergarten – adults with state and \nfederal public education objectives tailored for 4\nth\n and 5\nth\n grade students. \n “Train the Trainer” - workshops and materials for Soil and Water districts, Extension     \nService, etc. \nAs part of the education outreach efforts, the stakeholder group forming the Upper Little Bayou \nPierre Watershed Implementation Team (WIT) will participate in a minimum of 3 face-to-face \nmeetings.  The purpose of these meetings is to provide updates on implementation activities, \neducation events and review and modify the watershed plan.  In concert with these WIT \nmeetings, and to incentivize stakeholder participation, project funding will be used to purchase \nfood and other refreshments for the WIT along with providing support for renting facilities in \nwhich to host those events.  In accordance with 41 CFR § 301-74.11, light refreshments, meals, \nand/or beverages are an allowable expense under CWA Section 319, provided a description of \nthe agenda, purpose, location, costs, etc., are outlined in an approved 319 grant work plan. The \npurpose of the meetings will be for updating the watershed plan, and hosting field days to \nshowcase the implemented BMPs for the public. At this time the exact number of participants \nand locations are not known therefore costs have been estimated for the purposes of this plan and \nwill be updated.   \n\nUpper Little Bayou Pierre GY 2018 \n9 \n \n \nElement f: Implementation Schedule \n\n\nThe following work plan describes the approaches and tasks that the grantee shall collaboratively \nperform with project partners to advance and implement this watershed-based plan. During this \neffort, the grantee will work with the MDEQ Basin Team and will put forth its best effort to \nperform the tasks identified below within the given timetable. \n  \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the \nroles, tasks, requirements, and milestones for project implementation. (Month 1)  \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan. \n(Months 1 – 36)  \n3. Work with the Claiborne County SWCD, MSWCC, NRCS, and MDEQ to inform \nlandowners and operators within the watershed about the project and work to secure \ncommitments from priority area landowners and operators who are willing to \nparticipate in the project. (Months 1 – 6)  \n4. Work with the local SWCD, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that \nare contributing significant pollutant loads.  All BMPs shall be installed in \naccordance with the guidelines developed in the latest edition of the NRCS Technical \nField Manual, or other approved guidelines.  (Months 1-36) \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion \nand implementation of an effective and efficient plan to monitor baseline water \nquality conditions in the watershed and track changes in water quality over time \nresulting from the BMPs implemented through this project.  (Plan Completion:  \nMonths 1-2); Implementation:  Months 3-36). \n \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 13-36) \n \n7. Conduct inspections of BMPs during construction (Months 3-36)  \n8. Coordinate with and support the local SWCD, MSWCC and NRCS in the collection \nof relevant GPS coordinates of all installed BMPs and incorporate this information \ninto a GIS format.  All geospatial data shall be collected in a manner consistent with \nthe Federal Geographic Data committee-endorsed standards.  (Months 3-36)  \n \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs (Months 3-36) \n \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data (1-36) \n\nUpper Little Bayou Pierre GY 2018 \n10 \n \n \nElement g:  Milestones and Outcomes \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nUSGS, MSWCC, and the Copiah and \nClaiborne Counties Soil and Water \nDistrict to determine priority areas that \nare contributing significant pollutant \nloads to Upper Little Bayou Pierre \nTarget priority areas \nfor BMPs \nMonth 1-2 \nEstablish Watershed Implementation \nTeam to begin refinement of Watershed \nBased Plan for Upper Little Bayou \nPierre watershed \nEstablish WIT \n \nMonth 1-2 \nInitiate watershed monitoring Baseline condition \nmonitoring \nMonth 3-12 \nMeet with landowners and cooperators \nto secure commitments to install BMPs \nin priority areas \nLandowner \nCommitment \nMonths 1-6 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT meetings Months 1-36 \nImplement BMPs BMP instillation Months 6-36 \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection Months 6-36 \nBegin monitoring to collect data on \npost-BMP water quality \nPost-BMP Monitoring Months 42-48 \nFinalize education and outreach plan Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal: Reduce the pathogen and sediment loads entering waters in the Upper Little Bayou Pierre \nWatershed.   \n\nUpper Little Bayou Pierre GY 2018 \n11 \n \nElement h: Load Reduction Evaluation \n \nAccording to the State of Mississippi Water Quality Criteria for Intrastate, Interstate, and \nCoastal Waters (MDEQ, 2015), most waters in the Upper Little Bayou Pierre watershed, are \nclassified for Fish and Wildlife Use.  As such waters in this classification must meet the aquatic \nlife designated use and the secondary contact recreation designated use.  The Little Bayou Pierre \nmain stem is classified for Recreation Use and thus should be protective of the Primary Contact \nRecreation designated use in addition to supporting the Fish and Wildlife classification.  \nAlthough the TMDL was developed using fecal coliform as the indicator for pathogens, in 2015, \nMDEQ updated the water quality criteria for recreational waters.  With this update, the pathogen \nindicator was switched from fecal coliform to e. coli.  In compliance with current water quality \ncriteria, e coli will be used as the pathogen indicator for all bacteriological monitoring.   \n \nMississippi’s water quality criteria do not include a water quality standard applicable to aquatic \nlife protection due to sediment.   However, a narrative standard for the protection of aquatic life \nwas interpreted to determine an applicable target for the sediment TMDL.  The narrative \nstandard for aquatic life use states that waters shall be free from materials attributable to \nmunicipal, industrial, agricultural, or other dischargers producing color, odor, taste, total \nsuspended solids, or other conditions in such degree as to create a nuisance, render the waters \ninjurious to public health, recreation, or to aquatic life and wildlife, or adversely affect the \npalatability of fish, aesthetic quality, or impair the waters for any designated uses.   In lieu of \nnumeric criteria for sediment, monitoring will be conducted to collect data on parameters that are \nconsidered surrogates for sediment (Total Suspended Solids, Total Suspended Sediment, \nturbidity) and nutrients (chlorophyll-a) along with conventional in-situ parameters generally \nmeasured to determine aquatic health (e.g. Dissolved Oxygen, pH, Temperature, Conductivity, \nDissolved Solids) will also be obtained.  In addition, e. coli monitoring will be conducted in the \nLittle Bayou Pierre. The following thresholds will be used to measure compliance applicable \nwith water quality criteria and/or target thresholds:  \n  \nParameter Threshold \nDissolved Oxygen Daily Average of 5.0 mg/L; Instantaneous threshold of 4.0 mg/L \nDissolved Oxygen % Sat ≥ 70% - ≤ 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold less than 1500 \nmg/L \nChemical Oxygen \nDemand 35 mg/L \nTotal Suspended Solids 65 mg/L \nTurbidity 75 NTU \nE. coli \n30-day geometric mean of 126 per 100 ml; samples during 30-day period should \nnot exceed 410 per 100 ml more than 10% of the time \nM-BISQ West Bioregion 43.7 Calibration 3 \n \n\nUpper Little Bayou Pierre GY 2018 \n12 \n \n \nIn addition to chemical data, biological community data, in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements.  For freshwater wadeable streams, not including the Mississippi Alluvial \nPlain (i.e. Delta), Mississippi uses a calibrated and verified index of biotic integrity to make \nwater quality assessment decisions.  This index, the Mississippi Benthic Index of Stream Quality \n(M-BISQ) was originally developed in 2000 and has undergone three recalibration efforts to \nrefine the sensitivity of the index.  As part of the index development process, the state was \ndivided into unique bioregions.  Within each bioregion, the index has a defined attainment \nthreshold that is used to determine if the biological community measures collected at a site are \nrepresentative of good water quality that can support a balanced benthic macroinvertebrate \ncommunity.  If the score is above the attainment threshold for the bioregion, the site is assessed \nas attaining the aquatic life use designation.  Along with overall MBISQ scores, the in-stream \nhabitat surveys will also be used to determine change over time.     \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the work plan. At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Upper Little Bayou Pierre \nWatershed.   In the event data indicate little or no positive change, a Stressor Analysis will be \nconducted to determine if any new or additional stressors are preventing improvements to water \nquality.  If any new stressors are identified, the Watershed Implementation Team will identify \nfuture actions/activities to address those stressors. \n \n\nUpper Little Bayou Pierre GY 2018 \n13 \n \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation water quality chemical and biological monitoring \nhave been compiled from 2001 – 2018 to serve as baseline data for the project on streams in the \nUpper Little Bayou Pierre watershed and on Brandywine Creek.  Brandywine Creek flows into \nthe Little Bayou Pierre from the south and represents the major drainage flowing into the \nwatershed.  This varied water quality monitoring included water chemistry data (nutrients, \nsuspended solids, oxygen demand, chlorides, etc.), in-situ field measurements for such \nparameters as dissolved oxygen, pH, temperature, specific conductance, and turbidity, as well as \nbiological community monitoring for benthic macroinvertebrates in wadeable streams. A list of \nthis historical water quality monitoring in the Upper Little Bayou Pierre Watershed is provided \nin the table below and their sample locations are shown in Figure 3.   \n \nStation \nID \nWater \nBody \nSampling \nYear/Agency \nProject \nType \nWater \nChem \nIn-\nSitu \nBacteria Benthics \nand/or \nAlgal \n111F16 Little Bayou \nPierre \n2018 MDEQ MBISQ X X \n \nX \n111D57 Brandywine \nCreek \n2015 MDEQ MBISQ X X \n \nX \n112G95 Brandywine \nCreek \n2017 MDEQ MBISQ X X \n \nX \n \n \nPost-BMP monitoring locations will be selected using best professional judgment and will be \ntargeted to reflect water quality downstream of BMP activity.  Once BMP installation is \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring \nwill be initiated.  Post BMP monitoring will be conducted in a way that allows for comparison \nwith the pre-implementation data.  Because recovery periods of streams can be dependent on \ntype and amount of BMPs installed, more than 1 year of post BMP data may be needed to \nobserve a change in water quality.  In some cases, it may take 5 or more years to see full benefits \nof BMPs. All data collection efforts will be conducted using trained personnel following \nestablished Standard Operating Procedures and adhering to agency Quality Assurance protocols.   \n\nUpper Little Bayou Pierre GY 2018 \n14 \n \n \n \n  Figure 3: Upper Little Bayou Pierre and Brandywine Creek Historical Monitoring     \n                      Stations. ",
  "metadata": {
    "id": "upper-little-bayou-pierre-watershed-plan-2018",
    "originalName": "upper-little-bayou-pierre-watershed-plan-2018.pdf",
    "mergedFrom": [
      "upper-little-bayou-pierre-watershed-plan-2018-1.json",
      "upper-little-bayou-pierre-watershed-plan-2018-2.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.803Z",
    "length": 29266
  }
}