{
  "id": "upper-bay-of-st-louis-watershed-action-plan-2007",
  "rawText": "\n\n \n \nBuilding a Partnership \n for the Watersheds of the  \nUpper Bay of St. Louis* \n \n \n \n \n \nPhoto, Leah Bray, Jourdan River Coastal Preserve from I-10 \n \n \n2007 Action Plan \n \n*The Upper Bay of St. Louis Watershed Partnership consists of several stream basins \nthat flow into the western and northern reaches of the Bay of St. Louis and are \nprimarily located in Hancock County, Mississippi \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 2\n of 23 \nAction Plan for the Upper Bay of St. Louis Partnership Area \nSponsored by the Land Trust for the Mississippi Coastal Plain  \n \n \n \n \n \n \n \n \n \n \n \n \n \nFunding assistance from EPA, Region IV  Technical Assistance from MDEQ \nPascagoula River Basin Team\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPrepared by Eco-Logic Restoration Services, LLC \n \nwww.ecologic-restoration.com\n \n \n \nSpring 2007 \n \n \n \n \n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 3\n of 23 \nBuilding a Partnership for the Watersheds \nof the Upper Bay of St. Louis  \n2007 Action Plan \n \nTable of Contents \n \n \nI. Purpose and Introduction .........................................................................................Page 4 \n \nII. Upper Bay of St. Louis Watershed Teams ..............................................................Page 6 \na. Steering committee \nb. Technical advisory team \nc. Education and Recreation advisory team  \n \nIII. Watershed Description and Maps............................................................................Page 7 \na. Upper Bay of St. Louis Partnership area..................................................... Page 9 \nb. Bay of St. Louis Watershed ........................................................................Page 10 \n \nIV. Stakeholder interests:  Forum and Roundtable ...................................................Page 11 \n \nV. Watershed Action Plan ...........................................................................................Page 15 \n \nVI. Evaluation of progress and plan revision..............................................................Page 19 \n \nVII. Resources ...............................................................................................................Page 19 \n \nVIII. Appendix:   Natural Heritage Data, Hancock County...........................................Page 21 \na. Plants of Hancock County \nb. Animals of Hancock County \n \n \n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 4\n of 23 \n \nPurpose and Introduction \n \n \nBefore Hurricane Katrina, the Land Trust for the Mississippi Coastal Plain (Land Trust) was \nawarded a grant from EPA Region IV to build watershed partnerships in six watersheds in \nsouth Mississippi.  Criteria for selecting watershed partnership areas included: (1) \nwatersheds that represented south Mississippi both geographically and ecologically; (2) \nwatersheds where the Land Trust owned and managed lands; and (3) watersheds where \nthere was a demonstrated need for restoration and protection.  The six watersheds that \nwere chosen included Turkey Creek in Harrison County, Red Creek (stream sections flowing \nthrough Stone County), Old Fort Bayou in Jackson County, West Hobolochitto Creek in Pearl \nRiver County, Tchoutacabouffa River (stream sections flowing through Harrison County) and \nUpper Bay of St. Louis (identified streams in Hancock County). \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThe Land Trust’s efforts to build a partnership for Upper Bay of St. Louis began in November \nof 2006 with Alison Anderson and Chris Lagarde agreeing to co-chair community watershed \nforums.  The first roundtable discussion was held at the Kiln public library on January 18, \n2007.  The second roundtable discussion was held at the Hancock County EOC on March \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 5\n of 23 \n29, 2007.  We have learned much from the participants and are very appreciative of their \nparticipation. \n \nHancock County was ground zero for this country’s greatest natural disaster, Hurricane \nKatrina.  We feel that it is important to respect that citizens are working hard to rebuild and \nrecover and that any individual’s time to participate in long-term watershed planning is \nlimited.  The Land Trust will continue to support the development of a watershed partnership \nfor the Upper Bay of St. Louis, seeking financial and other resources to help the community \naccomplish some of the actions identified to address their concerns for the waterways of \nHancock County. \n \nThis document is written to provide a strategic approach to watershed planning with \nparticular focus on private sector participation in the process.  We want to provide context \nand a brief overview of the ecological, cultural and scenic significance of streams as they \nflow to the Bay of St. Louis in Hancock County.  This is a record of our planning efforts and \nan accounting of actions identified to address watershed concerns.  The hope of those \ninvolved in this planning is to foster better stewardship of the natural resources of the \nwatershed.  \n \nForum participants were asked, “What’s so special about this place?  Is there anything in the \nwatershed in its present state that you want to protect?”  They responded with a clear \nunderstanding of their natural heritage and a strong vision of the qualities that they want to \nrestore and protect:   \n1. Rural heritage, including farmlands, healthy forests and open green space \n2. Peace and tranquility  \n3. Wild sounds: frogs, birds, insects \n4. Incredible beauty of our water:  clean, clear water that provides opportunities for \npeople to swim, fish and hunt \n5. Oak trees with their many colors of green. \n6. Seafood industry \n \nFrom the impacts of storm debris and tree loss to the threats of failing septic tanks and \naccelerated erosion in streams, participants clearly have a passion to restore, protect and \neducate.  Failing septic tanks, head cutting, down cutting, deforestation and contaminated \nrunoff are sources of stress that contribute to increased sedimentation, nutrient and \nbacteria loading.  Forum participants also identified the need for increased understanding \nabout the impact of motorized vehicles on stream banks, stream beds and sandbars and for \nincreased enforcement of public waterway laws.  Residents discussed the need to keep \nregular prescribed fire as a primary tool for natural lands management; limit development \nand create setback requirements in the floodplain through local zoning action; reforest \nstream banks and protect headwater streams and tributaries.  There is a great need to \neducate the local citizenry and to develop pride in place so that littering and dumping can be \nminimized, streamside management can be better understood and implemented, and \nappropriate public policy can be implemented as the population grows. \n \nThe goal of the Upper Bay of St. Louis Watershed Partnership is to develop and implement a \nsolution-oriented, action plan.  We have two primary objectives:  (1) Research, identify and \nimplement watershed protection and education strategies in the Upper Bay of St. Louis \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 6\n of 23 \nPartnership Area; (2) Research, design and implement watershed restoration and education \nstrategies in the Upper Bay of St. Louis Partnership.   \nProtection is defined as defending the existing natural and cultural resources of the \nWatershed from further degradation caused by encroachment, abuse or neglect.  Restoration \nis defined as actively initiating or accelerating the recovery of the ecological and cultural \nhealth, integrity and sustainability of the watershed that has been degraded, damaged or \ndestroyed.   \n \n \nTeams to Support the Upper Bay of St. Louis Watershed Partnership  \n \nProposed Steering Committee \nJudy Steckler, Land Trust for Mississippi Coastal Plain \nChris Lagarde \nAllison Anderson \nKelvin Burge \nDr. Donald Redalje \nCurt Beyer \nMike Felter \nJoe Pettigrew \n \nProposed Technical Advisory Team \nMDEQ, Coastal Basin Team Coordinator, Larry Estes \nSouth Mississippi RC&D Council, Patty Rogers \nMS Department of Wildlife Fisheries & Parks, Scenic Streams Program, Andrew Whitehurst \nMississippi Department of Marine Resources, CRMP \nMississippi Department of Marine Resources, Coastal Preserve Program \nMississippi Gulf Coast Heritage Program \nMS Soil and Water Conservation, Hancock County SWCD \nNatural Resource Conservation Service \nHancock County Utility Authority \nEPA, Gulf of Mexico Program (Habitat restoration team) \nEPA, Region 4, Watershed program \n \nProposed Education and Recreation Advisory Team  \nLand Trust for Mississippi Coastal Plain \nHancock County Planning Commission \nHancock County Greenways, Hancock County Chamber of Commerce \nMSU Extension Service  \nSouth MS Environment and Agricultural Coordination Organization (SMEACO) \nMS Canoe and Kayak Club \nWatershed Harmony Puppet Show \nHancock County School District \nMississippi Coast Audubon and Audubon Mississippi \n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 7\n of 23 \n \n \n \n \n \nDescription of the Upper Bay of St. Louis Partnership Area \n \n \nThe Watersheds of the Upper Bay of St. Louis flow into the western and northern reaches of \nthe Bay of St. Louis.  This watershed partnership area is part of the larger Bay of St. Louis \nWatershed. (See maps page 9 and 10). The Upper Bay Partnership Area can be broken \ndown further into smaller watersheds that include Bayou Bacon, Orphan Creek, Bayou Talla, \nand Cutoff Bayou which drain to the Jourdan River. Bayou La Terre drains into Rotten Bayou \nwhich empties into Jourdan River before that river meets the Bay of St. Louis. In addition, \nLower Bayou and Bayou LaCroix travel through the city of Bay St. Louis before meeting the \nBay of St. Louis.  The Upper Bay Partnership Area also includes the community of Kiln. \nOutside the city limits, the watershed is mostly rural with agricultural areas including \nlivestock farms and timberlands. Also included within the watershed is public Coastal \nPreserves owned and managed by the MS Department of Marine Resources. These \npreserves are mostly coastal marsh, wet pine savanna, and maritime forests.  \n \n \n \n \n \n \nBottomland hardwood adjacent to stream, Upper Bay area \nMarsh gradation, Jourdan River Coastal Preserves Marsh gradation with stream, Jourdan River Coastal Preserves \nWet pine savanna with stream, Upper Bay area \nPhotographs, Leah Bray, 2007 \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 8\n of 23 \nPrior to Hurricane Katrina, the Hancock County Greenways project hosted by the Hancock \nCounty Chamber of Commerce and Board of Supervisors conducted several public forums \nand surveyed the community.  Water quality concerns were the number one issue for both \ncitizens and local governments.   Most of the concern was focused on fecal coli-form \ncontamination in the waters caused by faulty septic and wastewater systems, especially \nafter heavy rain events. Currently, the county is working to install new water and sewer \nsystems; however, many rural residents are concerned that this will generate more \ndevelopment outside of the cities thereby increasing water quality issues, decreasing the \nquality of life in the rural setting and creating addition loss of wildlife habitat and green \nspace.  \n \nThe watersheds of the Upper Bay of St. Louis Partnership Area are: \n \nBayou Bacon Watershed\n covers \n @42 square miles and is 8.56 miles long \n*Hydrologic Unit Code (HUC): 031700090906 \n \nJourdan River/Bayou Talla Watershed\n \n covers @27 sq. miles and is 12.07 miles long \n*Hydrologic Unit Code:  031700091001 \n \nJourdan River/Cutoff Bayou Watershed\n  \ncovers @19 sq miles and is 4.31 miles long \n*Hydrologic Unit Code:  031700091004 \n \nRotten Bayou Watershed \ncovers  \n@35 square miles and is 12.84 miles long \n*Hydrologic Unit Code:  03170091002 \n \nBayou La Terre Watershed\n covers \n @24 sq. miles and is 10.73 miles long \n*Hydrologic Unit code:  03170091003 \n \nLower Bayou/LaCroix Watershed\n covers \n @21 sq. miles and is 7.30 miles long \n*Hydrologic Unit Code:  03170091\n102\n \n*Hydrologic Unit Code, or HUC as it is called, is the watershed address. \n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 9\n of 23 \n \n \n \n \nFigure 1:  Upper Bay of St. Louis, Watershed Partnership Area  \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 10\n of 23 \n \nFigure 2:  Bay of St. Louis Watershed  \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 11\n of 23 \nStakeholder interests:   \nResults from Community Forum and Roundtable Discussion\n \n \nWhat would you like to see for your watershed in the future? \n \n \n– Protect the integrity of the waterways: lakes, streams, rivers   \n– Protect waterways from development  \n– Keep waterways swimmable, fishable, floatable.  Waterways set aside for public \nrecreational use.  \n– Lower bacteria and nutrient levels and reduced sedimentation (turbidity) \n– More positive perception of the farmer; the farmer is not the primary source of water \nquality problems \n– Reduce non-point sources of pollution:  sustainable building practices that include \npermeability and swales to reduce run-off.  \n– Need sewerage systems in upper part of the county to replace failing septic tanks \n– Concerns about water quality at DuPont need to be mitigated:  more testing at Wolf \nRiver Station east side of the Bay \n– Identify key areas for land and water protection \n– Stop the dumping and littering:  increase the sense of personal responsibility  \n– More funding for restoration, especially for private landowners;  stream restoration and \ncleaner water benefits the public more than the private landowner \n– Forestry industry continues to become more environmentally conscious.  There is a need \nfor even more operations to work under BMPs \n– Need protected rural areas:  undeveloped and unfragmented farmlands and forest \nlands. \n– Protect tree canopy  \n– Great concern about loss of trees in the county. \n– More landowners participating in programs to keep cattle fenced out of waterways; \nstorm debris (timber) off the ground; more prescribed fires to reduce wildfires \n– Resolve sewerage problems:  eliminate sewerage outfalls into low-flow bayous  \n– More Protected and restored riparian buffers.    \n– More public access to the waterways and more options for public use:  recreation is a \ngood source of passive education. \n– Keep motorized vehicles (ATVs) out of the stream-beds.  Identify areas that can be free \nof jet skis \n \nHow would you describe the current state of your watershed? \n \nFair \n \n \nWhat’s so special about this place?  Is there anything in the watershed in its present state \nthat you want to protect?  \n– Rural heritage, including farmlands, healthy forests and open green space \n– Peace and tranquility  \n– Wild sounds, frogs  \n– Incredible beauty of the water \n– Clean, clear water - Swimming, Fishing, Hunting \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 12\n of 23 \n– Independent spirit of the people in Hancock County \n– Oak trees with their many colors of green. \n– Seafood industry \n \n \nWhat are the challenges/concerns that we face in order to see the watershed become what\n \nwe envision for the future? \n \n– Storm debris, forced timbering.  Problems with timber on the ground which can cause \nwildfires and also challenges for conducting prescribed fire. \n– Residential growth in northern part of the county \n– Concern for water/sewerage pipe in areas that don’t need that infrastructure; \ninfrastructure can encourage growth in areas not suited for growth, i.e. wetlands \n– Littering and dumping are big problems \n– The independent spirit, a positive quality, can also be negative quality because it drives \npeople to resist regulations needed to protect our environment as the population grows \n– Need more watershed education:  when people build houses they need to think about \nwhere the water is going to go (impervious surfaces create run-off); stop polluting \npractices such as washing paintbrushes in the creek/ditch or dumping used automotive \noil in the ditch or drain \n– Too often plans are left unimplemented:  need a strong plan and leadership for action \n– Need more personal responsibility in keeping a desirable environment \n– Need to take actions to reduce elevated bacterial and nutrient levels \n– Need to reduce sedimentation:  elevated bacterial and nutrient levels are associated \nwith increased sediment after storms \n– Concern that there is a negative perception of the farmer – that the farmer is blamed as \nthe primary source of the water quality problems \n– Big concern about non-point sources – we need to be a leader in sustainable building \npractices, providing permeability & swales to reduce run-off  \n– Need sewerage in upper part of the county – remove/replace failing septic tanks \n– Concerned about water quality at DuPont, wolf River station east side of the Bay \n– Need to  identify key areas for protection \n– One critical issue:  dumping and litter – there is no sense of personal responsibility.   \nThis can’t be mandated.  Trash along roads is an indicator of people who don’t care. \n– Most federal programs require a significant match and local landowners need to choose \nwhere they spend their cost-share $$.  If restoration and clean-up benefits the public at \nlarge, then the individual landowners should not be solely tasked with the local match.  \nIs there precedence in other watersheds – are there examples from other watersheds \nfor successful match programs?   \n– Allocate funding to solve identified problems.  Money talks. \n– Forestry industry is much more conscious about BMP now than 25 years ago.  \n– In the Upper Bay project area, there are some developed areas, still many rural areas – \nbut land is getting more and more frag\n\nmented.  Historically the objectives for the rural \nland were farming and timber – now different objectives (residential) are changing the \nbalance.  Need new strategies for reducing impacts of fragmentation.   \n– \nLand values are problematic.  Economically, we are land rich and cash poor.  This \ncreates environmental problems. For example, lands in the buffer zone are now $4-5K \nper acre without development rights so the land is often used as a source of fill dirt.  \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 13\n of 23 \n– Great concern about loss of trees in the county. \n– Many water quality problems in the Bay are associated with sewerage.  Toley Bayou is \nclear.  Watts Bayou is very turbid and stagnant – is the water there polluted?   There is a \nproblem with failing septic tanks and sewerage run-off from housing developments.  \nThere is concern about where the sewer outfalls are going – they are flushing into low-\nflow bayous – sewerage without enough flushing \n– Need to educate people about the negative impacts there actions have on the \nwatershed.   \n– There is a lot of stream bank erosion.  Sometimes nature heals itself, but it always starts \nback again.  Erosion is not necessarily a localized problem.  Need to understand \naccelerated erosion in the watershed:  what are the causes and what are the best \napproaches for restoration.   Private landowners don’t have the money to cost share for \nthis kind of restoration.  If we are going to have clean water that is swimmable and \nfishable, then we must restore stream banks.   \n– Some of the restoration needs to be done at 100% public funding.  Most federal \nprograms require a significant match.  Local landowners need to choose where they \nspend their cost-share $$.  General concern that if restoration and clean-up benefits the \npublic at large, then the individual landowners should not be solely tasked with the local \nmatch. \n \nHancock County was ground zero for Hurricane Katrina.  It will be decades before rebuilding \nand recovery is complete in the Upper Bay of St. Louis Watershed Partnership Area.  The \ndevastation of Hurricane Katrina creates a critical call for wetland protection and a \nwatershed approach to land use planning.  Yet, citizens and local governments can not \naccomplish this daunting task alone; we need technical and financial assistance at every \nlevel.   \n \nHosting watershed forums in Hancock County during 2006 was impossible and remained \ndifficult in 2007.  The Land Trust for Mississippi Coastal Plain is dedicated to working \nthrough their board of directors, members, staff and friends to ensure that private citizens \nhave a voice in watershed issues for the Bay of St. Louis. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nStorm debris on property owned and \nmanaged by the Land Trust for Mississippi \nCoastal Plain.  \nPhoto by Jim Kelly \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 14\n of 23 \n \n \n \n \nClearing storm debris on Land Trust property near the Bay of St. Louis. \n \nPhotos by Jim Kelly \n \n \n \n \n \n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 15\n of 23 \nUPPER BAY OF ST. LOUIS  \nWATERSHED PARTNERSHIP  \nACTION PLAN \n \nAfter reviewing literature about the Upper Bay of St. Louis and developing maps for use in \ncommunity discussions, the Land Trust for the Mississippi Coastal Plain (LTMCP) hosted two \nroundtable discussions with private landowners.  These meetings were our first formal \ndiscussions with landowners and the foundation of building a long-term partnership to \naddress the health of the Upper Bay of St. Louis.   \nThe mission of the LTMCP is to conserve, promote and protect the open spaces and green \nplaces that have ecological, cultural or scenic significance in the counties of the Mississippi \nCoastal Plain.   Riparian corridors, or streamside management zones, have great ecological, \ncultural and scenic significance and are a primary focus of the LTMCP.  Healthy riparian \ncorridors are also essential elements for maintaining clean water.  LTMCP owns and \nmanages four properties in Hancock County:  Sweetbay Hollow Preserve, Tate, Blount and \nWhitney.  Sweetbay Hollow Preserve and Tate are located just south of the Upper Bay \nwatershed in the independent coastal streams.  Both Blount and Whitney properties are \nwithin the watershed boundary.  Watershed education will become a part of the public use \nand management plans for all four protected properties. \nThe mission of EPA is to protect human health and to safeguard the natural environment - \nair, water and land - upon which life depends.  The foundation for building a watershed \npartnership for Upper Bay is funded through a grant from EPA Region IV to the LTMCP.   \nLTMCP is committed to achieving its mission in the Upper Bay of St. Louis and is grateful for \nthe EPA watershed grant that funded the exploration and initiation of this watershed \npartnership.  LTMCP is committed to working with stakeholders –private landowners, local \ngovernment and natural resource agencies, to implement identified education, protection \nand restoration strategies for the Upper Bay of St. Louis. \n \nFirst, we recommend an assessment at the watershed scale to determine the full extent of \ngeomorphic changes causing accelerated erosion and impairing water quality.  Such an \nassessment will identify priority areas for restoration, protection and land use planning at \nthe watershed scale, particularly in the flood plain.  Further study and partnership efforts \nmay ultimately result in the development of a watershed implementation plan that will \ninclude prioritized action, timelines, budget estimates and measures of success.  We \nrecommend continued strategic planning efforts to improve the scope of the Upper Bay of \nSt. Louis Watershed Action Plan. \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 16\n of 23 \n \nEDUCATION STRATEGIES \n \n1. Create a webpage for the Upper Bay of St. Louis that can provide answers to questions \nasked by local stakeholders: \na. General information  and map of the watershed \nb. Watershed Action Plan \nc. Information about natural services of wetlands \nd. Information about economic value of blueways and greenways \ne. Streamside Management and Best Management Practices (BMPs) \nf. Links to county and city zoning maps \ng. Links to primary collaborators and partners in the watershed and pertinent \nwatershed information \n \n2. Design and implement environmental education programs for elementary school-age \nchildren, programs that are specific to the Upper Bay of St. Louis \na. Print and distribute watershed education coloring books for children:  focus on \nlitter reduction, recycling – Keeping the environment clean, Grades K-3 \nb. Design Find the animal in the swamp activity page for Grades 3-5 \nc. Host Watershed Harmony Puppet Show during 2007-2008 school year, use \nabove educational materials in conjunction with performance \n \n3. Educate the public about watersheds and streamside management.  Specifically, \ndevelop and install watershed signage along roadsides and streamsides of willing private \nlandowner.  Signage will be designed to: \na. educate and build pride in place along the bayou and  \nb. encourage watershed protection. \n \n4. Host a neighborhood meeting, or series of meetings, about streamside management and \nbest management practices.  Include city and county public works employees in these \ndiscussions.  Print and distribute Upper Bay of St. Louis Streamside Management for \nLandowner’s Handbook. \n \n5. Prioritize other watershed education projects proposed for the watershed \na. Provide education venues to tie the water quality to economic development, \nproperty values and quality of life \nb. Develop a speakers bureau to educate general public about watershed issues \nc. Find meaningful ways to engage civic groups:  Farm Bureau, Cattleman’s \nAssociation,  Hancock County Forestry Association, Rotary,  Kiwanis, Master \nGardeners, Leadership Program, Hancock County Chamber of Commerce, \nWest Coast (Hancock County Tourism)  \nd. Work with MDOT and other partners to implement a watershed signage along \nmajor federal, state and county roads \ne. Design education campaign about septic tank maintenance for landowners \n \n6. Identify educational tools for county decision-makers and public officials about \nwatershed concerns and solutions:  land use changes, storm water management, \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 17\n of 23 \naccelerated erosion, wetland loss.  Plan and host an informational executive breakfast to \nbegin the discussion about watershed management; this would be a good opportunity for \nthe Land Trust to partner with the new Hancock County Utility Authority to engage the \npublic in conversations about a watershed approach to storm water and land use \nplanning. \n \n7. Discuss with MSU Coastal Extension Service the possibilities of designing and hosting a \nlandowner education program for homeowners that addresses the primary information \nneeds for homeowners and small land owners along the bayou, especially bank \nstabilization, native plants and reforestation.   \n \n \nPROTECTION AND RESTORATION STRATEGIES \n \n1. Identify streamside areas that need re-planting.  Establish a re-planting program to \ninclude native trees and vegetation in streamside management areas and other priority \nareas of the watershed. \n \n2. Install best management practices for (1) streamside management areas (2) \nconstruction areas. \n \n3. Work with County and City planning commissions to establish “set-backs” along the \nbanks of the bayous through zoning.   \n \n4.  Promote construction of conservation design developments – denser, tighter \ndevelopment that creates larger buffers and open green spaces.  Focus on use of \npermeable products and swales to reduce run-off. \n \n5. Support prescribed fire education and use of prescribed fire in the watershed.  Work with \nMS Department of Marine Resources, MS Forestry Commission and Volunteer fire \ndepartments to preserve right to burn and promote adequate resource allocation for \nprescribed fire on public and private lands  \n \n6. Create protected riparian buffers through voluntary conservation easements and/or fee \nsimple donations or acquisition. \n \n7. Work with state and federal partners, particularly EPA and MDEQ, to identify grant \nprograms and primary partners to complete a watershed assessment and watershed \nimplementation plan that will identify and prioritize (1) public and private stream and \necosystem restoration needs in the watershed, (2) conservation and protection \nstrategies in the watershed.   \n \n8. Identify funding programs to assist in private lands/stream bank restoration projects.  \nThis will provide a great benefit to the public good, not just the private landowners. \n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 18\n of 23 \n9. Work with Coastal Clean-up Program to include more waterway clean-ups.  Work with city \nand county governments to enforce litter and dumping laws.  Work with citizens to create \nand implement no littering campaigns. \n \n10. Identify landowners interested in adopt-a-stream programs along their local waterways \nand host an adopt-a-stream training and \nsupport. \n \n11. Establish a dialogue with Hancock County \nUtility Authority, particularly focused on \nencouraging the utilization of green \ninfrastructure for storm-water management \n(vegetated riparian buffers protected by \nconservation easements or fee simple \nacquisition/donation)  \n \n12. Consider options for private action to address \nfailing septic systems in the watershed.  Work \nwith DEQ and Health Department to develop \nand implement educational campaigns \nregarding landowner responsibilities to \nmaintain septic systems in working order. \n \n \n \n \n \nORGANIZATIONAL STRATEGIES  \nTO ENSURE IMPLEMENTATION AND SUPPORT OF ACTION PLAN \n \n1. Identify a local champion(s) for the watershed \n \n2. Ask the Land Trust for Mississippi Coastal Plain Board of Directors to establish an Upper \nBay of St. Louis Watershed Partnership Committee (steering committee) that will \nfunction as a special action committee under the Land Trust’s auspices until which time \nthe partnership desires to create an independent organization.  The primary purpose of \nthe committee will be to implement the action plan.  This committee will be tasked with: \na. Categorizing and prioritizing the Action Plan;  \nb. Creating a timeline for the Action Plan;  \nc. Developing an estimated budget and volunteer staffing program to implement \nthe timeline;  \nd. Conducting an annual review of the watershed Action Plan. \n \n3. Formalize the technical advisory committee and send each person a copy of the action \nplan so that they are better prepared to participate and provide information and \nassistance as needed. \n \n \nPhoto taken after Hurricane Katrina along the roadway near the Tate \nprotected area in Hancock County.  The photo demonstrates the need for \nimproved storm water and waste water systems, especially in \nanticipation of future storm events.  Photo by Jim Kelly \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 19\n of 23 \n4. Formalize the education, recreation resources team and send each person a copy of the \naction plan so that they are better prepared to participate and provide information and \nassistance as needed. \n \n \n \nEVALUATION OF PROGRESS AND PLAN REVISION \n \nRegular evaluation of the watershed action plan will ensure that the plan remains a vital tool \nfor developing a strong watershed partnership and to guide future management efforts in \nthe watershed.  LTMCP advisory team shall appoint a small working group to review the \naction plan annually.  Watershed plans are living documents that must be adapted to \nchanging conditions within the watershed.   The annual review shall include consideration of \ntasks completed as well as reviewing changes in the watershed, in stakeholder interests and \nin understanding of the Upper Bay of St. Louis.  \n \n \n \nRESOURCES \n \nWatershed Description:  \nMARIS on-line mapping for Mississippi at www.maris.state.ms.us/HTM/maps.htm \n \nWildlife Resources:  \nMississippi Natural Heritage Inventory on-line at \nwww.mdwfp.com/museum/html/research/general_info.asp, NatureServe Explorer database \nof species information on-line at www.natureserve.org/explorer/ \n \nWater Quality Standards:  \nThrough MDEQ Basin Management water quality standards website at \nwww.deq.state.ms.us/MDEQ.nsf/page/WMB_Water_Quality_Standards?OpenDocument\n \n \nDesignated Beneficial Uses:  through the MDEQ Basin Management website at \nwww.deq.state.ms.us/MDEQ.nsf/page/WMB_Basin_Management_Approach?OpenDocume\nnt \n \nBiological Ratings:  Contact MDEQ. \n \n303(d) List and 305(b) report:   MDEQ on-line at \nwww.deq.state.ms.us/MDEQ.nsf/page/TWB_Total_Maximum_Daily_Load_Section?OpenDoc\nument \n \nApproved TMDLS:   MDEQ TMDL website at \nwww.deq.state.ms.us/MDEQ.nsf/page/TWB_Total_Maximum_Daily_Load_Section?OpenDoc\nument  \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 20\n of 23 \nor through Basin Management website at \nwww.deq.state.ms.us/MDEQ.nsf/page/WMB_Basin_Management_Approach?OpenDocume\nnt \n \nPotential management actions:  \nMississippi NRCS program website at www.ms.nrcs.usda.gov/programs/\n, particularly the \nEQIP program conservation practice, sign up, and ranking documents \n \nMississippi Streamside Landowner’s Handbook.  By Andrew Whitehurst, Scenic Streams \nStewardship Program, Mississippi Museum of Natural Science, Mississippi Dept of Wildlife, \nFisheries and Parks \n \nHandbook for Developing Watershed Plans to Restore and Protect Our Waters, U.S. \nEnvironmental Protection Agency, Office of Water, Nonpoint Source Control Branch, Oct. \n2005 \n \nEconomic values (Natural Capital): \nFrom Open Spaces to Wild Places, The Economic Value of Habitat protection to Your \nCommunity, a publication of the Southeast Watershed Forum.  \nwww.southeastwaterforum.org\n \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 21\n of 23 \n \nAppendix \nMISSISSIPPI NATURAL HERITAGE DATA \nPLANTS AND ANIMALS FOUND IN HANCOCK COUNTY, MISSISSIPPI \nSource:  Mississippi Natural Heritage Program, located in the Mississippi Museum of Natural \nScience, Mississippi Department of Wildlife Fisheries and Parks:     \nwww.mdwfp.com/museum/html/research/\n \nThe Mississippi Natural Heritage Program identifies the state's most significant natural areas \nthrough a comprehensive inventory of rare plant and animal species, exemplary natural \ncommunities, special geological features, and significant natural areas. From the inventory, the \nNatural Heritage Database compiles information on the distribution, biology, status, and preservation \nneeds of these species and communities.  The database is updated continuously and is used to set \nstate, national and global priorities for the preservation of natural diversity. \nThe Natural Heritage Database \nThe Natural Heritage Database is a continuously updated inventory of rare plant and animal species \nand representative natural communities in Mississippi. Today current information on the statewide \nstatus and locations of special animals, plants, and natural communities is available in a central \nlocation. By utilizing the Heritage Program, resource planners are able to save time and money. The \ninformation contained within the Program's database was compiled from a broad range of sources, \nincluding museum and herbarium collection records, publications, unpublished reports, and experts \nthroughout the southeast. \nSpecific Information Available: \n• Tracks the status of more than 700 species of plants and animals that are rare or imperiled \nat the state or global level.  \n• Contains more than 9,400 records of locations for rare plants, animals, and natural \ncommunities.  \n• State and Federal protection status of select sp\n\necies.  \n• State and global ranking of species and communities.  \n• Protection and management priorities and urgency.  \nPlants – Hancock County \nScientific Name Common Name Global Rank State Rank \nAGALINIS APHYLLA COASTAL PLAIN FALSE-FOXGLOVE G3G4 S2S3 \nAGALINIS FILICAULIS THIN STEMMED FALSE-FOXGLOVE G3G4 S2? \nAMSONIA LUDOVICIANA CREOLE PHLOX G3 SH \nBURMANNIA BIFLORA NORTHERN BURMANNIA G4G5 S3S4 \nCALOPOGON BARBATUS BEARDED GRASS-PINK G4? S2S3 \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 22\n of 23 \nCALOPOGON MULTIFLORUS MANY-FLOWER GRASS-PINK G2G3 S1 \nCAREX EXILIS COAST SEDGE G5 S2 \nCHAMAECYPARIS THYOIDES ATLANTIC WHITE CEDAR G4 S2 \nCLEISTES DIVARICATA SPREADING POGONIA G4 S3 \nCOREOPSIS NUDATA GEORGIA TICKSEED G3? S1S2 \nELEOCHARIS ELONGATA SLIM SPIKE-RUSH G5? S1 \nEPIDENDRUM CONOPSEUM GREEN-FLY ORCHID G4 S2 \nERIOCAULON TEXENSE TEXAS PIPEWORT G4 S2S3 \nERYNGIUM AQUATICUM MARSH ERYNGO G4 S1 \nEULOPHIA ECRISTATA SMOOTH-LIPPED EULOPHIA G2 S1S2 \nGORDONIA LASIANTHUS LOBLOLLY BAY G5 S3S4 \nHIBISCUS COCCINEUS BRILLANT HIBISCUS G4? S2 \nILEX AMELANCHIER JUNEBERRY HOLLY G4 S3 \nILEX MYRTIFOLIA MYRTLE HOLLY G5? S3S4 \nJUNIPERUS SILICICOLA SOUTHERN RED CEDAR G5T4T5 S2 \nLACHNOCAULON DIGYNUM PINELAND BOGBUTTON G3 S2 \nLILAEOPSIS CAROLINENSIS CAROLINA LILAEOPSIS G3G5 S2S3 \nMACRANTHERA FLAMMEA FLAME FLOWER G3 S3? \nMELANTHIUM VIRGINICUM VIRGINIA BUNCHFLOWER G5 S2S3 \nPANICUM NUDICAULE NAKED-STEMMED PANIC GRASS G3Q S2 \nPHASEOLUS SINUATUS SANDHILL BEAN G3? S1S2 \nPHYSALIS ANGUSTIFOLIA COAST GROUND-CHERRY G3G4 S3S4 \nPINGUICULA PLANIFOLIA CHAPMAN'S BUTTERWORT G3? S2 \nPINGUICULA PRIMULIFLORA SOUTHERN BUTTERWORT G3G4 S3 \nPLATANTHERA INTEGRA YELLOW FRINGELESS ORCHID G3G4 S3S4 \nPOLYGALA HOOKERI HOOKER'S MILKWORT G3 S1S2 \nRHYNCHOSPORA CURTISSII CURTISS'S BEAKRUSH G4 S1 \nRHYNCHOSPORA MACRA LARGE BEAKRUSH G3 S3 \nRHYNCHOSPORA STENOPHYLLA CHAPMAN BEAKRUSH G4 S1? \nRUELLIA NOCTIFLORA NIGHT-FLOWERING RUELLIA G2 S2 \nRUELLIA PEDUNCULATA SSP \nPINETORUM \nPINE BARREN RUELLIA G5T3? S3 \nSAGERETIA MINUTIFLORA TINY-LEAVED BUCKTHORN G4 S2 \nSPIRANTHES LONGILABRIS GIANT SPIRAL LADIES'-TRESSES G3 S2S3 \nSYNGONANTHUS FLAVIDULUS YELLOW PIPEWORT G5 S2? \n\nWatersheds of the Upper Bay of St. Louis  \nAction Plan \nSpring 2007 \nPage 23\n of 23 \nUTRICULARIA PURPUREA PURPLE BLADDERWORT G5 S2S3 \nXYRIS DRUMMONDII DRUMMOND'S YELLOW-EYED GRASS G3 S2 \nXYRIS SCABRIFOLIA HARPER'S YELLOW-EYED GRASS G3 S1S2 \n \n \nAnimals – Hancock County \n \nScientific Name Common Name Global Rank State Rank \nALOSA ALABAMAE ALABAMA SHAD G3 S1 \nCRYSTALLARIA ASPRELLA CRYSTAL DARTER G3 S1 \nELANOIDES FORFICATUS SWALLOW-TAILED KITE G5 S2B \nEUDOCIMUS ALBUS WHITE IBIS G5 S3B,SZN \nFARANCIA ERYTROGRAMMA RAINBOW SNAKE G5 S2 \nGOPHERUS POLYPHEMUS GOPHER TORTOISE G3 S2 \nGRAPTEMYS OCULIFERA RINGED MAP TURTLE G2 S2 \nHALIAEETUS LEUCOCEPHALUS BALD EAGLE G4 S1B,S2N \nHETERODON SIMUS SOUTHERN HOGNOSE SNAKE G2 SH \nLAMPROPELTIS CALLIGASTER \nRHOMBOMACULAT \nMOLE KINGSNAKE G5T5 S3? \nMICRURUS FULVIUS EASTERN CORAL SNAKE G5 S3S4 \nNOTROPIS CHALYBAEUS IRONCOLOR SHINER G4 S2 \nNOTURUS MUNITUS FRECKLEBELLY MADTOM G3 S2 \nPERCINA LENTICULA FRECKLED DARTER G2 S2 \nPITUOPHIS MELANOLEUCUS \nLODINGI \nBLACK PINE SNAKE G4T3 S2 \nPLEUROBEMA BEADLEIANUM MISSISSIPPI PIGTOE G2G3 S3? \nPOLYODON SPATHULA PADDLEFISH G4 S3 \nPROCAMBARUS BIVITTATUS RIBBON CRAYFISH G4 S3 \nPTERONOTROPIS WELAKA BLUENOSE SHINER G3G4 S3 \nRHADINAEA FLAVILATA PINE WOODS SNAKE G4 S3? \nUNIOMERUS DECLIVIS TAPERED PONDHORN G5 S2 \n \n \n ",
  "metadata": {
    "id": "upper-bay-of-st-louis-watershed-action-plan-2007",
    "originalName": "upper-bay-of-st-louis-watershed-action-plan-2007.pdf",
    "mergedFrom": [
      "upper-bay-of-st-louis-watershed-action-plan-2007-1.json",
      "upper-bay-of-st-louis-watershed-action-plan-2007-2.json",
      "upper-bay-of-st-louis-watershed-action-plan-2007-3.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.802Z",
    "length": 39452
  }
}