{
  "id": "upper-piney-creek-9-key-element-plan",
  "rawText": "\n\nUpper Piney Creek Watershed  GY 2022 \n1 \n \nUpper Piney Creek Watershed Plan \n9 Key Element Plan \nHUC 080302060704 \nMWS 9223 \nGY 22 Project Area \nVersion 0 (9/21/2022) \n \nElement a: Identification of Causes and Sources of Impairment \n \nThe Upper Piney Creek Watershed (MWS 9223) is located in the Northeastern portion of Yazoo \nCounty, just east of Yazoo City, in North Central Mississippi covering approximately 31,154 \nacres.  This watershed includes Piney Creek from the headwaters to the watershed boundary. \nPiney Creek serves as the mainstem drainage for the watershed and flows west from the \nheadwaters to the watershed boundary.  The watershed includes several smaller unnamed \nintermittent streams and some small ponds. According to the 2019 National Land Cover \nDatabase (NLCD), the landuse within this watershed is comprised of approximately 64% \nforestland, 20% pastureland, 9% cropland, and 7% other (water, scrub/barren, wetland, and \nurban) as depicted in Figure 1. \n \nThe water-use classification for Piney Creek and all water bodies in the Upper Piney Creek \nwatershed, as established by Regulations for Water Quality Criteria for Intrastate, Interstate, \nand Coastal Waters (MDEQ, 2021), is Fish and Wildlife. Waters with this classification are \nintended for fishing and propagation of fish, aquatic life, and wildlife. Waters that are classified \nas Fish and Wildlife should also be suitable for secondary contact recreation, which is defined as \nincidental contact with water including wading and occasional swimming.   \n \nPiney Creek (MS366E) has a long history with Mississippi’s Section 303(d) List of Impaired \nWater Bodies.  The entire length of the stream (11 miles) from the headwaters in the Upper \nPiney Creek watershed to the mouth at the Yazoo River was listed as impaired. Originally, the \nsegment was listed based on an “evaluated” assessment in 1998 due to pesticides, pathogens, \nnutrients, siltation, and organic enrichment/low dissolved oxygen based primarily on review of \nanecdotal information and not actual monitoring data.  This waterbody remained on the list until \nTotal Maximum Daily Load (TMDL) estimates for sediment and pathogens were developed for \nPiney Creek.  Total Maximum Daily Loads, TMDLs, are pollution budgets. A TMDL determines \nhow much of a pollutant can be present in a stream, river, or lake without negatively affecting \naquatic life or public health. The portion of MS366E that falls within the Upper Piney Creek \nwatershed is shown in Figure 1.     \n \nIn order to make water quality assessments on wadeable streams outside of the Mississippi \nAlluvial Plain, MDEQ uses a calibrated and verified index of biological integrity (IBI) referred \nto as the Mississippi Benthic Index of Stream Quality (M-BISQ). Using biological community \ndata and comparing it to the attainment thresholds from the M-BISQ, Piney Creek was assessed \nas impaired (segment MS366E) for Aquatic Life Use Support due to biological impairment in \n2002. Due to this determination, the evaluated causes of pesticides, nutrients, siltation, and \norganic enrichment/low dissolved oxygen (DO) based primarily on review of evaluated \nanecdotal information and not monitoring data were removed and MS366E was included on the \n2002 §303(d) List of Impaired Water Bodies for biological impairment. \n\nUpper Piney Creek Watershed  GY 2022 \n2 \n \n \n \nFigure 1: Landuse Distribution in the Upper Piney Creek Watershed \n\nUpper Piney Creek Watershed Plan GY2022 \n3 \n \nThere are two TMDLs for the Piney Creek segment MS366E; one for sediment and another for \npathogens. The Fecal Coliform TMDL for Piney Creek (MDEQ, 2008), was developed for the \nentire segment of Piney Creek.  This TMDL requires all NPDES permitted discharges of fecal \ncoliform to meet water standards for disinfection and recommends reducing fecal coliform \ncontributions that occur as a result of cattle access to streams and failing septic systems in the \nwatershed. \n \nMDEQ has a strong team of scientists and engineers focused on evaluating water quality data \nand identifying stressors in water bodies that have been listed as being biologically impaired \nusing benthic macroinvertebrate community data. When biological community data indicate that \na water body segment is impaired, an investigative, stressor identification analysis using \nstrength-of-evidence approach is conducted to determine the cause(s) of the impairment. Such \ncauses may range from specific pollutants (e.g. Total Nitrogen) to other causes of pollution such \nas sedimentation, habitat loss or hydrologic alteration. In most cases, nonpoint sources contribute \nto, or are the primary causes of impairment. MDEQ relies upon all available monitoring and \nassessment data and conducts additional monitoring to gather the necessary data and information \nto help determine both the causes and sources of impaired waters. The U.S. Environmental \nProtection Agency (EPA) Stressor Identification Process and Stressor Identification Guidance \nDocument (USEPA, 2000), is used to identify the most probable stressors causing biological \nimpairment thereby providing the information necessary to develop required TMDLs that will \nguide restoration activities. A stressor identification study was conducted on Piney Creek in \n2007. The results of this analysis indicate that sediment is the primary probable pollutant causing \nthe aquatic life use impairment to the stream. This information was used to develop a TMDL for \nsediment.  \n \nPiney Creek (MS366E) is included in the Total Maximum Daily Load Yazoo River Basin Hills \nRegion for Impairment Due to Sediment (MDEQ, 2020). There are no facilities in the Upper Piney \nCreek Watershed with NPDES permits that include limits for Total Suspended Solids (TSS) \nwhich is used as an indicator of sediment contributions from permitted activities.  The pollutant \nof concern in the Upper Piney Creek watershed is sediment from land-use runoff.  Certain \ncontaminants may be associated with sediment such as pesticides and nutrients. These \ncontaminants were not addressed directly within the sediment TMDL. However, these \ncontaminants would also be controlled by the same best management practices (BMPs) that \ncontrol the sediment from nonpoint sources of pollution.  This TMDL calls for a 99% reduction \nin sediment.  Nonpoint loading of sediment in a water body results from the transport of material \ninto receiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion. Sources of sediment include agriculture, silviculture, rangeland, construction sites, \nroads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream sources, \nand historical land use activities and channel alterations. \n \nFigure 2 shows the location of the impaired segment along with the water quality monitoring \nlocations on Piney Creek. \n\nUpper Piney Creek Watershed Plan GY2022 \n4 \n \n \nFigure 2: Impaired Segment and Monitoring Sites in the Piney Creek Watershed\n\nUpper Piney Creek Watershed Plan GY2022 \n5 \n \nElement b: Expected Load Reduction \n \nThe Fecal Coliform TMDL for Piney Creek (MDEQ, 2008) requires all NPDES permitted discharges \nof pathogens to meet water standards for disinfection and recommends reducing overall contribution \nof pathogens from nonpoint sources by 15%.  The TMDL further recommends the implementation of \neducation projects to teach best management practices to better control nonpoint sources of \npathogens. \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters \n(MDEQ, 2021) regulation does not include a numerical water quality standard for aquatic life \nprotection due to sediment.  The narrative standard for the protection of aquatic life is sufficient for \njustification of TMDL development but does not provide a quantifiable TMDL target. The target for \nthe sediment TMDL is based on reference sediment yields developed by the USDA Agricultural \nResearch Service’s Channel and Watershed Processes Research Unit (CWPRU) at the National \nSedimentation Laboratory (NSL). Based on the ranges of stable and unstable yield values, a \nreduction in sediment of 99% is recommended for the Piney Creek Watershed. \n \nThe MDEQ will work with agency resource partners to identify and implement BMPs to address \npathogen and sediment concerns in the Upper Piney Creek Watershed. The United States \nDepartment of Agriculture (USDA) Natural Resource Conservation Service (NRCS) has a list of \napproved BMPs to address pathogen and sediment issues and this list will be used to identify \ncandidate BMPs in the Upper Piney Creek watershed.  Conservation practices that address \nsediment often provide an additional benefit in the reduction of nutrients as they attach to \nsediment particles in run-off.  Practices approved by NRCS will be used to identify candidate \nBMPs in the Upper Piney Creek watershed.   \n \nElement c: Proposed Management Measures \n \nCoordinating partners with MDEQ include the Mississippi Soil and Water Conservation \nCommission (MSWCC), the Natural Resource Conservation Service (NRCS), and the local Soil \nand Water Conservation Districts (SWCDs) throughout the state.  These SWCDs are typically \nhoused within USDA Service Centers co-located with NRCS offices.   These partners have been \ncoordinating with local stakeholders to gauge landowner interest and based on their expertise, \nhave identified a suite of BMPs that should be effective in addressing nonpoint source pollution \nsources in the Upper Piney Creek Watershed. \n \nStaff from MSWCC and the SWCD depend upon assistance from their NRCS partners in \ndetermining landowner interest in the watershed because they are present on the farms and in the \nfields with local landowners. These staff members also understand the conservation needs at the \nlocal level and have knowledge of unfunded applications for federal program assistance which \nmeet Section 319 eligibility requirements. At present, the Upper Piney Creek Watershed has \nTMDLs for sediment and pathogens. Based on previous experience in watersheds with similar \nimpairments, our partners recommend installation of the following BMPs to help mitigate \nsediment and pathogen issues in the Upper Piney Creek Watershed: cover crop planting, grade \nstabilization, streambank and shoreline protection, and structures for water control.  Factors \nconsidered for determining specific locations for the placement of BMPs included the following \nattributes based upon best professional judgement of trained NRCS, SWCD and MDEQ Staff: \n\nUpper Piney Creek Watershed Plan GY2022 \n6 \n \n \n1. Likely water quality benefit; \n2. Willingness of landowners to participate; \n3. Implementation of the recommendations of the TMDLs; \n4. Ease of showing effectiveness of the BMP(s) through monitoring; \n5. Shorter length of time for anticipated results (i.e., within the grant period). \n \nUpon receipt of funding, MDEQ will coordinate with the field staff from MSWCC in Yazoo \nCounty to target implementation in priority areas, and then move to other areas as funds allow. A \nmap depicting the landuse can be found in Figure 1 and recent imagery in Figure 2. Additional \nconsiderations for prioritization of BMPs included the positioning of BMPs with willing \nlandowners; the increased likelihood for leveraging of in-kind services; and proximity to \npollutant sources to Piney Creek. \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities.  \nPartners in this project who may contribute match include MSWCC, Yazoo County Soil and \nWater Conservation District, NRCS, and/or local landowners and operators.  For project \nimplementation, administration, management, and watershed plan revision, as well as hosting \nand facilitating team meetings, MDEQ plans to work under a memorandum of agreement (MOA) \nwith the MSWCC to implement this project.  Project partners provided the funding amounts used \nto estimate costs for BMP installation.  Provided below is summary of estimated costs for \npotential BMPs and overall project implementation: \n \nCost Estimate: Full Project Implementation \n \n \n \nNOTE: Conservation Best Management Practices provide a 40% match at a minimum \n*Denotes fields that are estimated upon three incremental funding cycles of the project  \n \nDue to the magnitude of BMP needs, this project will need to be funded incrementally using \nmultiple sources of funds. To fully address all suggested conservation needs in the watershed, \nBMPs\nAmount  Estimated Cost\nGrade Stabilization Structure\n85 ea.$1,068,330\nCover Crops\n400 ac$30,800\nStructure for Water Control\n20,000 Inft$80,000\nStreambank and Shoreline Protection\n867 cy$141,321\nTechnical Assistance*\nN/A$45,000\nEducation and Outreach*\nN/A$28,000\nMonitoring* \nN/A$25,760\nProject Management, Implementation, \nCoordination, Plan Revision*\n$135,000\nTotal Estimated Cost$1,554,211\n\nUpper Piney Creek Watershed Plan GY2022 \n7 \n \nthis plan recommends funding be provided in 3 increments. To maximize education and outreach \nactivities and monitoring efforts, MDEQ plans to leverage with existing programs already \nallocated for funding where possible. \n  \nBelow is the estimated budget for the first incremental funding (Phase 1) of this project: \n \nCost Estimate: Phase 1 Implementation: \n \n \nNOTE: Conservation Best Management Practices provide a 40% match at a minimum. \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor landuse categories of nonpoint source pollution: agriculture, construction, forestry, on-site \nwaste water disposal, surface mining, urban storm water runoff, and hydrologic modification.  \nAudiences from pre-school to adults throughout the state are reached with a variety of mature, \nwell-designed programs each year. These programs, events, manuals and literature can be used in \nthe Upper Piney Creek Watershed project by tailoring them to address pollutants of concern.  A \npositive approach is used to reach the full diversity of people in the community with projects that \nfoster a “sense of place”, a “sense of pride in community”, and a sense of the native plants, \nanimals, and general ecology of their region.  Stakeholders and coordinators join together to \nparticipate in problem-solving, brainstorming, plan development, training workshops, soil and \nwater conservation field days and other activities that promote collaboration and ownership of \nthe watershed, as well as solutions to its problems.  The ultimate goal is to bring about behavior \nchanges and the use of “best management practices” that will improve water quality and the \noverall quality of life in the watershed.  Evaluation forms, pre-test/ post-test, surveys, and \nreporting of the number of people who attend workshops, trainings and events are among the \nmethods used to measure the success of education/information programs.  A partial list of \nMDEQ’s programs that could be used in the Upper Piney Creek watershed are listed below: \n \n  Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \nBMPsAmount   Estimated Cost\nGrade Stabilization Structure (med. Flow/med. Fill) 25 each $235,550\nCover Crops  200 ac $15,400\nStreambank and Shoreline Protection  367 cy $59,821\nTechnical Assistance\nN/A$15,000\nEducation and Outreach\nN/A$12,800\nMonitoring \nN/A$19,500\nProject Management, Implementation, \nCoordination, Plan Revision\n$51,160\nTotal Estimated Phase 1 Cost$409,231\n\nUpper Piney Creek Watershed Plan GY2022 \n8 \n \n Teacher workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe watershed. \n Mobile Classroom Education and Outreach Events - for school ages kindergarten –5\nth\n \ngrade students. \n “Waste Pesticide Disposal Event” - The primary goal of this program is to help \nMississippi farmers and property owners minimize the environmental risks associated \nwith the disposal of waste-pesticide products by disposing of products in a safe and \nefficient manner. \n \nAs part of the education outreach efforts, the stakeholder group forming the Upper Piney Creek \nWatershed Implementation Team (WIT) will participate in collaborative meetings. The purpose \nof the meetings will be to identify partners, update the watershed plan, and host field days to \nshowcase the implemented BMPs for the public.  In concert with these WIT meetings, and to \nincentivize stakeholder participation, project funding will be used to purchase food and other \nrefreshments for the WIT along with providing support for renting facilities in which to host \nthose events. In accordance with 41 CFR § 301-74.11, light refreshments, meals, and/or \nbeverages are an allowable expense under CWA Section 319, provided a description of the \nagenda, purpose, location, costs, etc., are outlined in an approved 319 grant workplan. At this \ntime the exact number of participants and locations are not known therefore costs have been \nestimated for the purposes of this plan and will be updated. \n \nElement f: Implementation Schedule \n \nThe following schedule describes the approaches and tasks that will be undertaken with project \npartners to advance and implement this watershed-based plan. During this effort, resource \nagency partners will work with the Watershed Implementation Team and MDEQ Project \nManager (where applicable), to perform the tasks identified below: \n  \n1. Work to develop, execute, and implement a Subgrant Agreement that specifies the \nroles, tasks, requirements, and milestones for project implementation. (Month 1) \n \n2. Facilitate, in coordination with MDEQ and other partners, meetings, media and social \nmedia promotion of the project, and coordinate activities to fully implement this plan.  \n(Months 1-36) \n \n3. Work with the Yazoo County SWCD, MSWCC, NRCS, and MDEQ to inform \nlandowners and operators within the watershed about the project and work to secure \ncommitments from priority area landowners and operators who are willing to \nparticipate in the project.  (Months 1-6) \n \n4. Work with the local SWCD, MSWCC, NRCS, and MDEQ to determine through GIS \napplications and intensive site surveys the priority areas within the sub-watershed that \nare contributing significant pollutant loads.  All BMPs shall be installed in \n\nUpper Piney Creek Watershed Plan GY2022 \n9 \n \naccordance with the guidelines developed in the latest edition of the NRCS Technical \nField Manual, or other approved guidelines.  (Months 1-36) \n \n5. Facilitate, in cooperation with MDEQ and other monitoring partners, the completion \nand implementation of an effective and efficient plan to collect monitoring data and \ninformation to measure changes in water quality resulting from the BMPs \nimplemented through this project.  Months 3-36 \n \n6. Submit blank copies of standard maintenance agreements to MDEQ. (Months 3-36) \n \n7. Conduct inspections of BMPs during construction (Months 3-36) \n \n8. Coordinate with and support the local SWCD, MSWCC and NRCS in the collection \nof relevant GPS coordinates of all installed BMPs and incorporate this information \ninto a GIS format.  All geospatial data shall be collected in a manner consistent with \nthe Federal Geographic Data committee-endorsed standards.  (Months 3-36) \n \n9. Collect adequate photo documentation before, during, and after installation of the \napproved BMPs. (Months 3-36) \n \n10. Report measured, or estimated, nonpoint source pollutant load reduction, acreage \naffected, pre-and post- site conditions, and GIS data. (1-36) \n \nElement g:  Milestones and Outcomes \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nMSWCC, and the Yazoo Co. Soil and \nWater Conservation District to \ndetermine priority areas that are \ncontributing significant pollutant loads \nto Upper Piney Creek \nTarget priority areas \nfor BMPs \nMonth 1-6 \nEstablish Watershed Implementation \nTeam.  \nEstablish WIT \n \nMonth 1-2 \nInitiate watershed monitoring Baseline Condition \nMonitoring \nCompleted using historical \ndata \nMeet with landowners and cooperators \nto secure commitments to install BMPs \nin priority areas \nLandowner \nCommitment \nMonths 1-36 \nEstablish routine meeting schedule for \nWIT to support WBP revision \nWIT Meetings Months 1-36 \nImplement BMPs BMP Instillation Months 6-36 \nCoordinate with Landowners to inspect \nBMPs that were installed using Section \n319 funds \nBMP Inspection Months 6-36 \n\nUpper Piney Creek Watershed Plan GY2022 \n10 \n \nBegin monitoring to collect data on \npost-BMP water quality \nPost-BMP Monitoring  Months 40-48 \nImplement education and outreach plan   Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 30-36 \n \nGoal: Reduce pathogen and sediment loads entering waters in the Upper Piney Creek Watershed. \n \nElement h:  Load Reduction Evaluation \n \nAccording to the State of Mississippi Water Quality Criteria for Intrastate, Interstate, and \nCoastal Waters (MDEQ, 2021), waters in the Upper Piney Creek Watershed are classified for \nFish and Wildlife Use.  As such, waters in this classification must meet the aquatic life \ndesignated use and the secondary contact recreation designated use.  Although the TMDL was \ndeveloped using fecal coliform as the indicator for pathogens, in 2015, MDEQ updated the water \nquality criteria for recreational waters.  With this update, the pathogen indicator was changed \nfrom fecal coliform to e.coli.  In compliance with the current water quality criteria, e. coli will be \nused as the pathogen indicator for all bacteriological monitoring.   \n \nMississippi’s water quality criteria do not include a water quality standard applicable to aquatic \nlife protection due to sediment. However, a narrative standard for the protection of aquatic life \nwas interpreted to determine an applicable target for the sediment TMDL.  The narrative \nstandard is that waters shall be free from materials attributable to municipal, industrial, \nagricultural, or other dischargers producing color, odor, taste, total suspended solids, or other \nconditions in such degree as to create a nuisance, render the waters injurious to public health, \nrecreation, or to aquatic life and wildlife, or adversely affect the palatability of fish, aesthetic \nquality, or impair the waters for any designated uses.  In lieu of numeric criteria for sediment, \nmonitoring will be conducted to collect data on parameters that are considered surrogates for \nsediment (Total Suspended Solids, Total Suspended Sediment, turbidity) and nutrients \n(chlorophyll-a) along with conventional in-situ parameters generally measured to determine \naquatic health (e.g. Dissolved Oxygen, pH, Temperature, Conductivity, Dissolved Solids) will \nalso be obtained. In addition, e. coli monitoring will be conducted. The following thresholds will \nbe used to measure compliance applicable with water quality criteria and/or target thresholds: \n \nSuccess Measurement Thresholds: \nParameter Threshold \nDissolved Oxygen \nDaily Average of 5.0 mg/L; Instantaneous threshold of 4.0 \nmg/L \nDissolved Oxygen % Sat. > 70% - < 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous threshold \nless than 1500 mg/L \nChemical Oxygen Demand <50 mg/l \n\nUpper Piney Creek Watershed Plan GY2022 \n11 \n \nTurbidity <100 NTU \nTotal Suspended Solids <80 mg/l \nE. coli \n30-day geometric mean of 126 per 100 ml; samples during 30-\nday period should not exceed 410 per 100 ml more than 10% \nof the time \nM-BISQ South Bluff \nBioregion \nAssessment threshold 55.7 (25th percentile of reference \ncondition) \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project to determine attainment of the Aquatic Life Designated \nUse.  These data are extremely helpful in identifying positive trends in water quality and should \nprovide information to help determine if the implementation activities are resulting in water \nquality improvements.  Mississippi uses a calibrated and verified index of biotic integrity to \nmake water quality assessment decisions.  This index, the Mississippi Benthic Index of Stream \nQuality (M-BISQ), was originally developed in 2000 and has undergone three recalibration \nefforts to refine the sensitivity of the index.  As part of the index development process, the state \nwas divided into unique bioregions.  Within each bioregion, the index has a defined attainment \nthreshold that is used to determine if the biological community measures collected at a site are \nrepresentative of good water quality that can support a balanced benthic macroinvertebrate \ncommunity.  If the score is above the attainment threshold for the bioregion, the site is assessed \nas attaining the aquatic life use designation.  Piney Creek is in the South Bluff bioregion and the \nattainment threshold is 55.7.  Along with overall MBISQ scores, the in-stream habitat surveys \nwill also be used to determine change over time.     \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the \ntimeframe identified in the workplan.  At the end of the project, data will be analyzed to \ndetermine if the data indicate improvements to water quality in Piney Creek.  In the event data \nindicate little or no positive change, a Stressor Analysis will be conducted to determine if any \nnew or additional stressors are preventing improvements to water quality.  If any new stressors \nare identified, the Watershed Implementation Team will identify future actions/activities to \naddress those stressors. \n \nElement i: Monitoring  \n \nPrior to BMP installation, pre-implementation water quality chemical and biological monitoring \nwas collected in 2022 to serve as baseline data for the project. Water quality monitoring included \nwater chemistry data (nutrients, suspended solids, oxygen demand, chlorides, etc.), in-situ field \nmeasurements for such parameters as dissolved oxygen, pH, temperature, specific conductance, \nand turbidity, as well as biological community monitoring for benthic macroinvertebrates.  A list \nof this historical water quality monitoring in the Upper Piney Creek Watershed is provided in the \ntable below and their sample locations are shown in Figure 2. \n\nUpper Piney Creek Watershed Plan GY2022 \n12 \n \n \nStation \nID \nWater \nSample \nYear(s) \nCollecting \nAgency \nProject \nWater \nChem \nIn-\nSitu \nSonde Benthics \nBody \n111F65 \nPiney \nCreek \n2022   MDEQ    M-BISQ    X     X \n \nX \n \nPost-BMP monitoring locations will be selected using best professional judgment and will be \ntargeted to reflect water quality downstream of BMP activity. Once BMP installation is \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring \nwill be initiated.  Post BMP monitoring will be conducted in a way that allows for comparison \nwith the pre-implementation data.  Because recovery periods of streams can be dependent on \ntype and amount of BMPs installed, more than 1 year of post BMP data may be needed to \nobserve a change in water quality.  In some cases, it may take 5 or more years to see full benefits \nof BMPs. All data collection efforts will be conducted using trained personnel following \nestablished Standard Operating Procedures and adhering to agency Quality Assurance protocols.   \n \n ",
  "metadata": {
    "id": "upper-piney-creek-9-key-element-plan",
    "originalName": "Upper_Piney_Creek_9_Key_Element_Plan_2022.pdf",
    "mergedFrom": [
      "upper-piney-creek-9-key-element-plan-2022.json"
    ],
    "pageCount": 12,
    "mergedAt": "2025-10-02T06:41:26.810Z",
    "length": 28033
  }
}