{
  "id": "yazoo-pass-9-key-element-plan-2021",
  "rawText": "\n\n1 \nYazoo Pass Watershed GY 21 \nYazoo Pass Watershed \n9 Key Element Plan \nHUC 080302040903\n \nMWS 9317 \nGY21 Project Area\n \nSeptember 27, 2021 \nElement a: Identification of Causes and Sources of Impairment \nYazoo Pass Watershed (080302040903) is located predominately in northeastern Coahoma \nCounty with a small amount in northwestern Quitman County.  Yazoo Pass Watershed is a \n25,662-acre watershed \nwhere cropland comprises 75% (19,185acres) of the land use within the \nwatershed.  Wetlands 10.5% (2,715 acres) and 10% water (2,557 acres) make up another \n20.5% of the landuse.  Urban, pasture-grassland, forest, and scrub-barren are the remaining \nland uses (about 4.5%) according to the 2016 National Land Cover Database (NLCD) (Figure \n1)\n.   \nBeginning in 1998, the Yazoo-Mississippi Delta Water Management District (YMD) began to \norganize watershed level meetings throughout the Coldwater River Watershed, which included \nMoon Lake. In 2003, the U.S. Army Corp of Engineers signed an agreement with YMD and \nthe Tunica County Soil and Water Conservati on \nDistrict (TCSWCD) to develop a watershed-\nscale plan to further identify watershed problems and solutions. Subsequently, YMD and \nTCSWCD entered into multi-year agreement whereas funds were provided for monitoring and \nconservation practice implementation. According to the 2008 report by YMD, although \n$1,025,000 had been spent on conservation practices in the Coldwater River (HUC 8) \nWatershed, very little work \nhad been completed within the Moon Lake watershed, particularly \nin the Phillip’s Bayou watershed (HUC 10) where only one site had been documented as an \ninstalled conservation practice. \nMoon Lake is also included in a Coldwater River Watershed-Based Plan developed by Delta \nF.A.R.M. in 2012. While the plan covered the entire HUC 8 watershed, BMP implementation \nand evaluation focused on specific sites where funding from the NRCS Mississippi River Basin \nInitiative was leveraged.  \nYazoo Pass Watershed is a sub-watershed of the Phillips Bayou-Yazoo Pass larger HUC 10 \nwatershed \nand is the watershed that contains Moon Lake.  The surface area of Moon Lake is \napproximately 2,308 acres, and the mean depth is 5.5 meters (FTN, 1991). \nInflow to Moon \nLake enters from Phillips Bayou to the north. Moon Lake drains through the Yazoo Pass to the \neast. The Moon Lake Watershed is a small part of an immense flood plain that is nearly level.  \nMoon Lake is a popular destination for recreational users enjoying activities such as boating \nand fishing. Due to this, the east bank of the lake is highly developed, with houses lining much \nof the perimeter. A portion of the western bank has also been subject to development. With \nhigh public use comes interest and \nconcern for maintaining optimal conditions for fishing and \nboating. Historical declines in lake conditions have prompted several studies and investigations \nof the lake and surrounding watershed. One of the first was An Environmental Assessment of \nMoon Lake, Mississippi and its Watershed in 1989 by the USDA- ARS National Sedimentation \n\n2 \nYazoo Pass Watershed          GY 21 \n \nLaboratory. Following this, a Phase I Diagnostic/Feasibility study was conducted by FTN \nAssociates in 1991. These studies were conducted in response to concerns of reduction in \ndepth, water clarity, and the possible presence of pesticides.  Results of the studies indicated \nthat while pesticides weren’t an issue elevated turbidity levels following storms were \npreventing the lake from achieving its recreational and fishery potential.  . \n \n\n3 \nYazoo Pass Watershed          GY 21 \n \n \nFigure 1: Yazoo Pass Watershed Landuse Map \n \n \n\n4 \nYazoo Pass Watershed          GY 21 \n \nIn 1996, Moon Lake (MS320MLM) was included on MS’s Section 303(d) List of Impaired \nWater Bodies for siltation, nutrients, and pesticides.  A Total Maximum Daily Load \n(TMDL) was developed for sediment/siltation for Moon Lake in 2003.  With the \nadvancement of technology and data since this TMDL was written, the watershed area \nincluded in the TMDL has now been divided into three 12-digit HUCs (Figure 2).  The lake \nitself lies in the Yazoo Pass sub- watershed (HUC 080302040903).   \n \nThere are no facilities in the Yazoo Pass Watershed with NPDES permits that include limits for \nTotal Suspended Solids (TSS) which is used as an indicator of sediment contributions from \npermitted activities.  The pollutant of concern for the Moon Lake TMDL is sediment from land- \nuse runoff.  Certain contaminants may be associated with sediment such as pesticides and \nnutrients. These contaminants were not addressed directly within this TMDL. However, these \ncontaminants would also be controlled by the same best management practices (BMPs) that \ncontrol the sediment from nonpoint sources of pollution.  The target for the TMDL was based \non reference sediment yields developed by the Channel and Watershed Processes Research Unit \n(CWPRU) at the National Sedimentation Laboratory (NSL).  Based on the ranges of stable and \nunstable yield values, a reduction in sediment of 35% to 56% is needed in the Yazoo Pass \nwatershed. \n \nNonpoint loading of sediment in a water body results from the transport of material into \nreceiving waters by the processes of mass wasting, head cutting, gullying, and sheet and rill \nerosion.  Sources of sediment include agriculture, silviculture, rangeland, construction sites, \nroads, urban areas, mass wasting areas, gullies, surface mining, in-channel and instream \nsources, and historical landuse activities and channel alterations. \n \nIn 1998, Moon Lake was placed on the Section 303(d) list for fecal coliform.  Although there the \nlimited data available did not indicate an impairment, Moon Lake was included on the impaired \nwaters list and classified as “evaluated” based on information that was included in the Phase I \nDiagnostic/Feasibility study for Moon Lake conducted by FTN Associates in 1991.  Moon Lake \nwas listed because the potential to exceed the standard was observed based on a septic survey \nthat identified direct pipes and failing septic tanks (FTN, 1991). Subsequently in 2003, the Phase \nOne Fecal Coliform TMDL for Moon Lake was developed by MDEQ to address the fecal \ncoliform listing.  \n \nThere are no permitted discharges in Moon Lake for pathogens.  The potential nonpoint sources \nof fecal coliform bacteria for Moon Lake include failing septic systems, wildlife, and direct \ninputs, such as direct pipes. Human contributions from failing septic systems and direct pipes \nwere identified as the primary source of bacteria in Moon Lake.  As a part of the Phase One \nTMDL, MDEQ recommended that a reduction in the observed potential pollutant load be \nachieved through the elimination of all open pipes and inadequate individual wastewater \ntreatment systems.  \n. \n \n\n5 \nYazoo Pass Watershed          GY 21 \n \n \n \nFigure 2: HUC 10 changed to HUC12 \n\n6 \nYazoo Pass Watershed          GY 21 \n \nElement b: Expected Load Reduction \n \nThe TMDL for sedimentation/siltation on Moon Lake called for a 35% to 56% reduction in the \nsediment loading to the waterbodies within the watershed. Nonpoint loading of sediment in a water \nbody results from the transport of material into receiving waters by the processes of mass wasting, \nhead cutting, gullying, and sheet and rill erosion.  Sources of sediment include agriculture, \nsilviculture, rangeland, construction sites, roads, urban areas, mass wasting areas, gullies, surface \nmining, in-channel and instream sources, and historical landuse activities and channel alterations. \nThe Natural Resources Conservation Service (NRCS) has a list of approved BMPs that address \nsedimentation issues and this list will be used to identify BMPs that are candidates to be used in the \nYazoo Pass Watershed. \n \nAccording to the Phase One TMDL for fecal coliform that was developed in 2003 for Moon Lake, \nthere are no permitted discharges in Moon Lake for pathogens.  The potential nonpoint sources of \nfecal coliform bacteria include failing septic systems, wildlife, and direct inputs, such as direct \npipes. MDEQ recommended that a reduction in the observed potential pollutant load be achieved \nthrough the elimination of all open pipes and inadequate individual wastewater treatment systems.  \n \nElement c: Proposed Management Measures \n \nIn the Yazoo Pass Watershed, MDEQ will be working with the non-profit group Delta Farmers \nAdvocating Resource Management (better known as Delta F.A.R.M), a long-time partner in this \nregion of the state.  As a local resource to farmers, Delta F.A.R.M. staff communicate regularly \nwith the local landowners and operators within the watershed as they work to support sign-ups for \nFarm Bill and other conservation initiatives.  Delta F.A.R.M. staff understand conservation needs \nat the local level and are aware of needs not funded through NRCS programs which meet Section \n319 eligibility requirements.  Under this watershed plan, Delta F.A.R.M. will implement \nconservation strategies for the Yazoo Pass Watershed. Stakeholder committees representing lake \nand farm interests have been established and preliminary discussions are underway regarding \npriority areas for conservation practice implementation.  \n \nPreliminary surveys of the Yazoo Pass watershed have been conducted to estimate the type and \nquantity of conservation practices needed on the landscape. Delta F.A.R.M. used this as a \nstarting point to initiate surveys to prioritize sites for implementation so that the greatest \nenvironmental gain may be achieved with the available resources. Farm stakeholders in the \nwatershed have expressed interest in working cooperatively to implement and maintain \nconservation practices. Being in close proximity to the Mississippi River, the Yazoo Pass \nwatershed is characterized by ridge and swale topography, which is prone to sedimentation loss \ndue to sheet, rill, and gully erosion. Gully erosion will be addressed with water control \nstructures, both slotted and riser pipes. Sheet and rill erosion will be addressed through structural \nconservation practices as well as non-structural agricultural management practices. Structural \nmeasures include low-grade weirs and two-stage vegetated ditches. Non-structural practices such \nas cover crops and reduced tillage are proven to be the best method of addressing sheet and rill \nerosion. However, this requires farmers to alter their crop production practices, thus introducing \nrisk of financial loss. Overcoming these hurdles to the adoption of cover crops, reduced tillage, \nand other practices that improve soil health while providing environmental benefits has been a \nlarge part of Delta F.A.R.M.’s work over the past several years. This work will be transitioned \ninto the Yazoo Pass watershed by working with farmers to implement these practices, with \ntechnical and financial assistance, in priority areas prone to high rates of sediment and nutrient  \n\n7 \nYazoo Pass Watershed          GY 21 \n \n \nloss. Delta F.A.R.M. will also identify opportunities for BMP implementation through NRCS \ncovered programs and provide assistance to producers throughout the application and \nimplementation process.  Based on their analysis, installation of the following BMPs would \nmitigate the sediment issues in the Yazoo Pass Watershed: \n \n Water Control Structure \n Vegetated Ditches \n Grade Stabilization Structures \n Cover Crops \n Nutrient Management \n \nIn order to address any potential pathogen issues in Moon Lake, MDEQ will work with the MS \nDepartment of Health and the established lake landowner association.  Along with the MS \nDepartment of Health, MDEQ will provide education and outreach materials to landowners around \nthe lake regarding the proper operation and maintenance requirements for septic systems.  Where \npossible, MDEQ will work with landowners to identify potential funding sources to support any \nmaintenance needs.   \n \nElement d: Technical and Financial Assistance \n \nAs part of any Section 319 funded project, MDEQ requires a 40% match in project areas.  This \nmatch may be in the form of actual dollars or may be provided as “in-kind” to project activities. \nPartners in this project that may contribute match include Delta F.A.R.M., USGS (monitoring), \nproject partners, and/or local landowners.  Delta F.A.R.M. provided the following numbers used \nto estimate costs for BMP installation.  Funding was also estimated to support education and \noutreach activities for the operation and maintenance of onsite septic systems.  Provided below is \na summary of estimated project costs for full-scale watershed restoration: \n \nEstimated Quantity and Cost of Project Implementation for the Yazoo Pass Watershed. \n \nBMPs Size/Amount Estimated Cost \nGrade Stabilization Structure (#) \n32 @ $6,480 $207,360  \nWater Control Structure (#) \n82 @ $2,400 $196,800  \nVegetated Ditch (in ft) \n20,898 @ $10 $208,980  \nCover Crop (ac) \n17,727 @ $73 $1,294,071  \nEducation/Outreach \n  \n  \nFull Watershed \n  \n$30,000  \nLake Landowners (OSDS) \n  \n$50,000  \nMonitoring \n  \n$58,500  \nProject Management, Implementation, \nCoordination, Plan Revision \n  \n$109,320  \nTotal Estimated Project Cost \n  \n$2,155,031  \n \nGiven the large financial burden of full watershed-scale conservation practice implementation, \nan incremental approach focusing on building producer partnerships and leveraging other \n\n8 \nYazoo Pass Watershed          GY 21 \n \nfederal, state, and private investment in conservation should be considered. The following table \nsummarizes the quantity and costs of project implementation that could occur through an initial \nimplementation phase. \n \nPhase 1: Estimated Quantity and Cost of Project Implementation for the Yazoo Pass \nWatershed.\n \n \nBMPs Size/Amount Estimated Cost \nGrade Stabilization Structure (#) 5 @ $6,480 $32,400  \nWater Control Structure (#) 40 @ $2,400 $96,000  \nCover Crop (3 80 ac sites - 2 yr.) $73  $35,040  \nEducation/Outreach N/A $24,900  \nFull Watershed    $15,000  \nLake Landowners (OSDS)   $25,000  \nMonitoring N/A $29,250  \nProject Management, \nImplementation, Coordination, \nPlan Revision \n  $54,660  \nTotal Estimated Project Cost   $312,250  \n \nElement e: Information and Education \n \nThe MDEQ, in cooperation with numerous federal, state, and local stakeholders has developed \ndiversified information/education programs, best management practices manuals, literature, \nbooks, videos, and public service announcements that address pollutants from the seven (7) \nmajor land-use categories of Nonpoint Source Pollution: agriculture, construction, forestry, on-\nsite waste-water disposal, surface mining, urban storm water runoff, and hydrologic \nmodification.  Audiences from pre-school to adults throughout the state are reached with a \nvariety of mature, well-designed programs each year. These programs, events, manuals, and \nliterature can be used in the Yazoo Pass watershed project by tailoring them to address the \nsedimentation and bacteria issues in the watershed.  A positive approach is used to reach the full \ndiversity of people in the community with projects that foster a “sense of place”, a “sense of \npride in community”, and a sense of the native plants, animals, and general ecology of their \nregion, as well as the history of the community and a sense of economics.  Stakeholders and \ncoordinators join together to participate in problem-solving brainstorming, plan development, \ntraining workshops, festival event planning, soil and water conservation field days, tree boards, \nposter, art and writing projects and other activities that promote collaboration and ownership of \nthe watershed, as well as solutions to its problems.  The ultimate goal is to bring about behavior \nchanges and the use of “best management practices” that will improve water quality and the \noverall quality of life in the watershed.  Evaluation forms, pre-test/post-test, surveys, and \nreporting of the number of people who attend workshops, trainings and events are among the \nmethods used to measure the success of education/information programs.  A partial list of \nMDEQ’s programs that could be used in the Yazoo Pass watershed are listed below: \n\n9 \nYazoo Pass Watershed          GY 21 \n \n \n \n• Water Model Presentations - Enviroscapes and groundwater aquifer models distributed \nstatewide with training and related interactive lesson plans. \n• Teacher Workshops – train educators in proximity to the watershed about NPS pollution \nand provide materials and information that can be used in their classrooms. \n• Adopt A Stream - workshops and training venues for citizens, teachers, and students in \nthe Yazoo Pass Watershed. \n• Watershed Harmony Mobile Classroom - for ages kindergarten – adults with state \nand federal public education objectives tailored for 4\nth \nand 5\nth \ngrade students. \n• \nTrain the Trainer - workshops and materials for Soil and Water districts, Extension\n \nService, etc. \n• Waste Pesticide Disposal Event - The primary goal of this program is to help Mississippi \nfarmers and property owners minimize the environmental risks associated with the disposal \nof waste-pesticide products by disposing of products in a safe and efficient manner. \n• On-Site Disposal System – Provides education on the proper operation and maintenance of \non-site septic systems and provides information on available resources to address failing \nsystems in the watershed.  \n \nAs part of the education outreach efforts, the stakeholder group forming the Yazoo Pass \nWatershed Implementation Team (WIT) will participate in a minimum of 3 face-to-face \nmeetings.  In addition, staff will meet with the subset of landowners with property adjacent to \nMoon Lake to discuss issues related to bacteria in the lake and potential inputs from septic \nsystems. The purpose of these meetings is to provide updates on implementation activities, \neducation materials, and review and modify the watershed plan.  In concert with these WIT \nmee\n\ntings, and to incentivize stakeholder participation, project funding will be used to purchase \nfood and other refreshments for the WIT along with providing support for renting facilities in \nwhich to host those events. \n \nElement f: Implementation Schedule \n \nThe following work plan describes the approaches and tasks that the grantee shall collaboratively \nperform with project partners to advance and implement this watershed-based plan. During this \neffort, the grantee will work with the MDEQ Basin Team and will put forth its best effort to \nperform the tasks identified below within the given timetable. \n \n1.   Upon approval of 9 Key Element Watershed Plan,  the grantee shall work with MDEQ to \ndevelop, execute, and implement a Sub-Grant Agreement that defines the roles, tasks, \nrequirements, and milestones of the grantee. (Month 1) \n \n2.   The grantee, with assistance from MDEQ, shall determine priority areas that are \ncontributing significant pollutant loading to the watershed.  (Months 1-2) \n \n3.   The grantee, with assistance from MDEQ, shall assist in the identification of members \nand development of a Watershed Implementation Team (WIT). (Months 1-2) \n \n4.   The grantee, with assistance from the WIT, shall develop a Watershed Based Plan (WBP) \nfor the watershed that includes the tasks for achieving a reduction in sediment and \n\n10 \nYazoo Pass Watershed          GY 21 \n \npathogen loadings to waterbodies within the watershed. This WBP will include the 9 Key \nElement Plan as an attachment. (Months 24-36) \n \n5.   The grantee, in cooperation with the WIT, MDEQ, and others, shall assist in the \ndevelopment and implementation of a watershed monitoring plan for the project (Months 1- \n36). \n \n6.   The grantee shall inform landowners and operators within the identified priority areas \nabout the project and secure commitments from these priority-area landowners and \noperators who are willing to participate in the project. (Months 1-12) \n \n7.   The grantee, in accordance with the previously submitted and approved WBP, shall \ndevelop plans for the installation of BMPs on priority lands within the watershed. \n(Months 2-36) \n \n8.   The grantee shall assist participants in installing approved BMPs. All BMPs shall be \ninstalled in accordance with the guidelines developed in the latest edition of the NRCS \nTechnical Field Manual, or other approved guidelines. (Months 2-36) \n \n9.   The grantee shall, in a timely manner, notify MDEQ project officer of all project-site \nlocations/inspections/public meetings so that MDEQ project officer may have the \nopportunity to attend.  (Months 2-36) \n \n10. The grantee shall collect relevant GPS coordinates of all implemented practices and \nincorporate into GIS format.  All geospatial data shall be collected in a manner consistent \nwith the Federal Geographic Data Committee endorsed standards.  (Months 1-36) \n \n11. The grantee shall take adequate photo documentation before, during, and after the \ninstallation of the implemented practice. (Months 1-36) \n \n12. The grantee shall submit quarterly reports not later than the 25\nth \nof April, July, \nOctober, and January of each year showing the status of tasks and start/completion \ndates of each task. (Months 1-36) \n \n13. The grantee shall make project presentations as requested by MDEQ. (Month 1-36) \n \n14. The grantee shall assist the MDEQ project officer in conducting inspections during \nconstruction. (Months 3-36) \n \n15. The grantee shall submit a final report to MDEQ to include measured, or estimated, non- \npoint source pollutant reductions or water quality improvements, acreage affected, pre- \nand post- site conditions, and GIS data.  The grantee shall make revisions, if necessary, \nupon the request of MDEQ. (Month 36) \n\n11 \nYazoo Pass Watershed          GY 21 \n \n \nElement g: Milestones and Outcomes\n \n \nMilestone Outcome Probable Completion \nDate \nCoordinate with the MDEQ, NRCS, \nUSGS, and partners to determine priority \nareas that are contributing significant \npollutant loads to Moon Lake \nTarget priority areas \nfor BMPs \nMonth 1-6 \nEstablish Watershed Implementation \nTeam to begin refinement of Watershed \nBased Plan for Yazoo Pass watershed \nEstablish WIT Month 1-2 \nInitiate watershed monitoring Baseline condition \nmonitoring \nMonth 3-12 \nMeet with landowners and cooperators \nto secure commitments to install BMPs \nin priority areas \nLandowner \nCommitment \nMonths 1-6 \nEstablish routine meeting schedule for \nWIT to support WBP implementation/ \nrevision \nWIT meetings Months 1-36 \nImplement BMPs BMP installation Months 12-36 \nCoordinate with Delta F.A.R.M. to \ninspect BMPs that were installed using \nSection 319 funds \nBMP Inspection Months 24-36 \nBegin monitoring to collect data on \npost-BMP water quality \nPost-BMP Monitoring Months 30-42 \nFinalize education and outreach plan Education/Outreach \nevents scheduled \nMonths 8-36 \nFinalize revised WBP Final Revised WBP Months 28-36 \n \n \nElement h:  Load Reduction Evaluation \n \nThe State of Mississippi Water Quality Criteria for Intrastate, Interstate, and Coastal Waters do \nnot include a water quality standard applicable to aquatic life protection due to sediment. \nHowever, a narrative standard for the protection of aquatic life was interpreted to determine an \napplicable target for the Moon Lake TMDL. The narrative standard is that waters shall be free \nfrom materials attributable to municipal, industrial, agricultural, or other dischargers producing \ncolor, odor, taste, total suspended solids, or other conditions in such degree as to create a \nnuisance, render the waters injurious to public health, recreation, or to aquatic life and wildlife, \nor adversely affect the palatability of fish, aesthetic quality, or impair the waters for any \ndesignated uses.  In lieu of numeric criteria for sediment, the monitoring plan will be designed to \ncollect data on parameters that are considered surrogates for sediment concentrations and may \ninclude measurements for total suspended solids, total suspended sediment, and turbidity along \nwith conventional parameters generally measured to determine aquatic health (e.g., dissolved \noxygen, pH, temperature, conductivity).  For pathogens, waters must meet a 30-day geometric \nmean of 126 per 100 ml, nor should the samples examined during the 30-day period exceed 410 \nper 100 ml more than 10% of the time for E. coli. The following thresholds will be used to \nmeasure compliance with water quality criteria: \n\n12 \nYazoo Pass Watershed          GY 21 \n \n \nParameter Threshold \nDissolved Oxygen \nDaily Average of 5.0 mg/L; Instantaneous threshold of 4.0 \nmg/L \nDissolved Oxygen % \nSat. > 70% - < 125% \npH 6.0-9.0 \nTemperature Not to exceed 90°F \nSpecific Conductance Less Than 1000 micromhos/cm \nDissolved Solids \nMonthly average less than 750 mg/L; instantaneous \nthreshold less than 1500 mg/L \nChemical Oxygen \nDemand <50 mg/l \nTurbidity <100 NTU \nTotal Suspended Solids <80 mg/l \nE. coli \n30-day geometric mean of 126 per 100 ml; samples during \n30-day period should not exceed 410 per 100 ml more \nthan 10% of the time \n \nIn addition to chemical data, biological community data and in stream habitat surveys will be \ncollected over the course of the project.  These data are extremely helpful in identifying positive \ntrends in water quality and should provide information to help determine if the implementation \nactivities are resulting in water quality improvements.  As has been done in other watersheds in \nthis region, MDEQ and Delta F.A.R.M. will work with other watershed partners to identify \nopportunities to establish edge of field monitoring.  MDEQ will continue to monitor Moon Lake \nas part of the state’s Ambient Lake Monitoring Program.  In addition to ambient monitoring, \nMDEQ will collect E. coli in the lake to monitor for pathogens. \n \nIt should be noted that recovery time of a stream is variable and may extend beyond the timeframe \nidentified in the work plan.  At the end of the project, data will be analyzed to determine if they \nindicate improvements to water quality.  In the event data indicate little or no positive change, a \nStressor Analysis will be conducted to determine if any new or additional stressors are preventing \nimprovements to water quality.  If any new stressors are identified, the Watershed Implementation \nTeam will identify future actions/activities to address those stressors. \n \nElement i: Monitoring \n \nPrior to BMP installation, pre-implementation chemical and biological monitoring have been \ncompiled to serve as a baseline for the project along with any historical data available in the \nYazoo Pass Watershed (which contains Moon Lake).  This varied water quality monitoring \nincluded water chemistry data (nutrients, suspended solids, oxygen demand, chlorides, etc.), in- \nsitu field measurements for such parameters as dissolved oxygen, pH, temperature, specific \nconductance, turbidity and secchi depth (lakes), datalogger (sonde) deployment for continuous in-\nsitu field measurement data as well as biological community monitoring for benthic \nmacroinvertebrates in streams and algal chlorophyll-a in lakes for trophic index determination. A \nsummary of this historical water quality monitoring in the Yazoo Pass watershed is provided in the \ntable below and their locations are shown in Figure 3. \n \n\n13 \nYazoo Pass Watershed          GY 21 \n \n \nStation ID \nWater \nSample \nYear(s) \nCollecting \nAgency \nProject \nWater \nChem \nIn-\nSitu \nSonde Benthics \nBody \nA0270015 \nYazoo \nPass \n2009, \n2013 \nUSGS, \nMDEQ \nDelta \nBISQ \nX \n    \nX \nYZ291 \nMoon \nLake \n2002-\n2004, \n2009, \n2011, \n2015 - \n2020 \nMDEQ \nNutrient \nCriteria, \nAmbient \nLakes \nStatus & \nTrends \nX X \n    \nYZ292 \nMoon \nLake \n2002-\n2004, \n2009, \n2011, \n2015 - \n2020 \nMDEQ \nNutrient \nCriteria, \nAmbient \nLakes \nStatus & \nTrends \nX X \n    \nYZ431 \nMoon \nLake \n2002-\n2004, \n2009, \n2011, \n2015 - \n2020 \nMDEQ \nNutrient \nCriteria, \nAmbient \nLakes \nStatus & \nTrends \nX X \n    \n \nPost-implementation monitoring locations will be selected using best professional judgment and \nwill be targeted to reflect water quality downstream of BMP activity.  Once BMP installation is \ncomplete, and there has been sufficient time for the stream to stabilize, post BMP monitoring will \nbe initiated.  Post BMP monitoring will be conducted in a way that allows for comparison with \nthe pre-implementation data.  Because recovery periods of streams can be dependent on type and \namount of BMPs installed, more than 1 year of post BMP data may be needed to observe a \nchange in water quality.  In some cases, it may take 5 or more years to see full benefits of BMPs. \nAll data collection efforts will be conducted using trained personnel following established \nStandard Operating Procedures and adhering to agency Quality Assurance protocols. \n \n \n \n\n14 \nYazoo Pass Watershed          GY 21 \n \n \nFigure 3: Monitoring Locations: Yazoo Pass Watershed ",
  "metadata": {
    "id": "yazoo-pass-9-key-element-plan-2021",
    "originalName": "yazoo-pass-9-key-element-plan-2021.pdf",
    "mergedFrom": [
      "yazoo-pass-9-key-element-plan-2021-1.json",
      "yazoo-pass-9-key-element-plan-2021-2.json"
    ],
    "mergedAt": "2025-10-02T06:41:26.820Z",
    "length": 28908
  }
}